betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
        <register>
          <name>CR</name>
          <description>Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>SWRST</name>
              <description>Software Reset</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>START</name>
              <description>Start Conversion</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCALIB</name>
              <description>Touchscreen Calibration</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPRST</name>
              <description>Comparison Restart</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CVR</name>
          <description>Correction Values Register</description>
          <addressOffset>0xD4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OFFSETCORR</name>
              <description>Offset Correction</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>GAINCORR</name>
              <description>Gain Correction</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CWR</name>
          <description>Compare Window Register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LOWTHRES</name>
              <description>Low Threshold</description>
              <bitRange>[13:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>16383</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>HIGHTHRES</name>
              <description>High Threshold</description>
              <bitRange>[29:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>16383</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>EMR</name>
          <description>Extended Mode Register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CMPMODE</name>
              <description>Comparison Mode</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>When the converted data is lower than the low threshold of the window, generates the COMPE flag in ADC_ISR or, in Partial Wakeup mode, defines the conditions to exit system from Wait mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>When the converted data is higher than the high threshold of the window, generates the COMPE flag in ADC_ISR or, in Partial Wakeup mode, defines the conditions to exit system from Wait mode.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN</name>
                  <description>When the converted data is in the comparison window, generates the COMPE flag in ADC_ISR or, in Partial Wakeup mode, defines the conditions to exit system from Wait mode.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUT</name>
                  <description>When the converted data is out of the comparison window, generates the COMPE flag in ADC_ISR or, in Partial Wakeup mode, defines the conditions to exit system from Wait mode.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMPTYPE</name>
              <description>Comparison Type</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLAG_ONLY</name>
                  <description>Any conversion is performed and comparison function drives the COMPE flag.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>START_CONDITION</name>
                  <description>Comparison conditions must be met to start the storage of all conversions until the CMPRST bit is set.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMPSEL</name>
              <description>Comparison Selected Channel</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CMPALL</name>
              <description>Compare All Channels</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPFILTER</name>
              <description>Compare Event Filtering</description>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>OSR</name>
              <description>Over Sampling Rate</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_AVERAGE</name>
                  <description>No averaging. ADC sample rate is maximum.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR4</name>
                  <description>1-bit enhanced resolution by averaging. ADC sample rate divided by 4.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR16</name>
                  <description>2-bit enhanced resolution by averaging. ADC sample rate divided by 16.</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ASTE</name>
              <description>Averaging on Single Trigger Event</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MULTI_TRIG_AVERAGE</name>
                  <description>The average requests several trigger events.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINGLE_TRIG_AVERAGE</name>
                  <description>The average requests only one trigger event.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRCCLK</name>
              <description>External Clock Selection</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PERIPH_CLK</name>
                  <description>The peripheral clock is the source for the ADC prescaler.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK</name>
                  <description>GCLK is the source clock for the ADC prescaler, thus the ADC clock can be independent of the core/peripheral clock.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TAG</name>
              <description>Tag of ADC_LCDR</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SIGNMODE</name>
              <description>Sign Mode</description>
              <bitRange>[26:25]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SE_UNSG_DF_SIGN</name>
                  <description>Single-Ended channels: Unsigned conversions.Differential channels: Signed conversions.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SE_SIGN_DF_UNSG</name>
                  <description>Single-Ended channels: Signed conversions.Differential channels: Unsigned conversions.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALL_UNSIGNED</name>
                  <description>All channels: Unsigned conversions.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALL_SIGNED</name>
                  <description>All channels: Signed conversions.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADCMODE</name>
              <description>ADC Running Mode</description>
              <bitRange>[29:28]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Normal mode of operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET_ERROR</name>
                  <description>Offset Error mode to measure the offset error. See Table 7-6.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAIN_ERROR_HIGH</name>
                  <description>Gain Error mode to measure the gain error. See Table 7-6.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAIN_ERROR_LOW</name>
                  <description>Gain Error mode to measure the gain error. See Table 7-6.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IDR</name>
          <description>Interrupt Disable Register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>EOC0</name>
              <description>End of Conversion Interrupt Disable 0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EOC1</name>
              <description>End of Conversion Interrupt Disable 1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EOC2</name>
              <description>End of Conversion Interrupt Disable 2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EOC3</name>
              <description>End of Conversion Interrupt Disable 3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EOC4</name>
              <description>End of Conversion Interrupt Disable 4</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EOC5</name>
              <description>End of Conversion Interrupt Disable 5</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EOC6</name>
              <description>End of Conversion Interrupt Disable 6</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EOC7</name>
              <description>End of Conversion Interrupt Disable 7</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EOC8</name>
              <description>End of Conversion Interrupt Disable 8</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EOC9</name>
              <description>End of Conversion Interrupt Disable 9</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EOC10</name>
              <description>End of Conversion Interrupt Disable 10</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EOC11</name>
              <description>End of Conversion Interrupt Disable 11</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LCCHG</name>
              <description>Last Channel Change Interrupt Disable</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XRDY</name>
              <description>Touchscreen Measure XPOS Ready Interrupt Disable</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>YRDY</name>
              <description>Touchscreen Measure YPOS Ready Interrupt Disable</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRDY</name>
              <description>Touchscreen Measure Pressure Ready Interrupt Disable</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DRDY</name>
              <description>Data Ready Interrupt Disable</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GOVRE</name>
              <description>General Overrun Error Interrupt Disable</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPE</name>
              <description>Comparison Event Interrupt Disable</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PEN</name>
              <description>Pen Contact Interrupt Disable</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NOPEN</name>
              <description>No Pen Contact Interrupt Disable</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
