betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
        <register>
          <name>IER</name>
          <description>Interrupt Enable Register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>EOC0</name>
              <description>End of Conversion Interrupt Enable 0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EOC1</name>
              <description>End of Conversion Interrupt Enable 1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EOC2</name>
              <description>End of Conversion Interrupt Enable 2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EOC3</name>
              <description>End of Conversion Interrupt Enable 3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EOC4</name>
              <description>End of Conversion Interrupt Enable 4</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EOC5</name>
              <description>End of Conversion Interrupt Enable 5</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EOC6</name>
              <description>End of Conversion Interrupt Enable 6</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EOC7</name>
              <description>End of Conversion Interrupt Enable 7</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EOC8</name>
              <description>End of Conversion Interrupt Enable 8</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EOC9</name>
              <description>End of Conversion Interrupt Enable 9</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EOC10</name>
              <description>End of Conversion Interrupt Enable 10</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EOC11</name>
              <description>End of Conversion Interrupt Enable 11</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LCCHG</name>
              <description>Last Channel Change Interrupt Enable</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XRDY</name>
              <description>Touchscreen Measure XPOS Ready Interrupt Enable</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>YRDY</name>
              <description>Touchscreen Measure YPOS Ready Interrupt Enable</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRDY</name>
              <description>Touchscreen Measure Pressure Ready Interrupt Enable</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DRDY</name>
              <description>Data Ready Interrupt Enable</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GOVRE</name>
              <description>General Overrun Error Interrupt Enable</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPE</name>
              <description>Comparison Event Interrupt Enable</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PEN</name>
              <description>Pen Contact Interrupt Enable</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NOPEN</name>
              <description>No Pen Contact Interrupt Enable</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMR</name>
          <description>Interrupt Mask Register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>EOC0</name>
              <description>End of Conversion Interrupt Mask 0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EOC1</name>
              <description>End of Conversion Interrupt Mask 1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EOC2</name>
              <description>End of Conversion Interrupt Mask 2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EOC3</name>
              <description>End of Conversion Interrupt Mask 3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EOC4</name>
              <description>End of Conversion Interrupt Mask 4</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EOC5</name>
              <description>End of Conversion Interrupt Mask 5</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EOC6</name>
              <description>End of Conversion Interrupt Mask 6</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EOC7</name>
              <description>End of Conversion Interrupt Mask 7</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EOC8</name>
              <description>End of Conversion Interrupt Mask 8</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EOC9</name>
              <description>End of Conversion Interrupt Mask 9</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EOC10</name>
              <description>End of Conversion Interrupt Mask 10</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EOC11</name>
              <description>End of Conversion Interrupt Mask 11</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LCCHG</name>
              <description>Last Channel Change Interrupt Disable</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XRDY</name>
              <description>Touchscreen Measure XPOS Ready Interrupt Mask</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>YRDY</name>
              <description>Touchscreen Measure YPOS Ready Interrupt Mask</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRDY</name>
              <description>Touchscreen Measure Pressure Ready Interrupt Mask</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DRDY</name>
              <description>Data Ready Interrupt Mask</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GOVRE</name>
              <description>General Overrun Error Interrupt Mask</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPE</name>
              <description>Comparison Event Interrupt Mask</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PEN</name>
              <description>Pen Contact Interrupt Mask</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NOPEN</name>
              <description>No Pen Contact Interrupt Mask</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ISR</name>
          <description>Interrupt Status Register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>EOC0</name>
              <description>End of Conversion 0 (automatically set / cleared)</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EOC1</name>
              <description>End of Conversion 1 (automatically set / cleared)</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EOC2</name>
              <description>End of Conversion 2 (automatically set / cleared)</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EOC3</name>
              <description>End of Conversion 3 (automatically set / cleared)</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EOC4</name>
              <description>End of Conversion 4 (automatically set / cleared)</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EOC5</name>
              <description>End of Conversion 5 (automatically set / cleared)</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EOC6</name>
              <description>End of Conversion 6 (automatically set / cleared)</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EOC7</name>
              <description>End of Conversion 7 (automatically set / cleared)</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EOC8</name>
              <description>End of Conversion 8 (automatically set / cleared)</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EOC9</name>
              <description>End of Conversion 9 (automatically set / cleared)</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EOC10</name>
              <description>End of Conversion 10 (automatically set / cleared)</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EOC11</name>
              <description>End of Conversion 11 (automatically set / cleared)</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LCCHG</name>
              <description>Last Channel Change (cleared on read)</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XRDY</name>
              <description>Touchscreen XPOS Measure Ready (cleared on read)</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>YRDY</name>
              <description>Touchscreen YPOS Measure Ready (cleared on read)</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRDY</name>
              <description>Touchscreen Pressure Measure Ready (cleared on read)</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DRDY</name>
              <description>Data Ready (automatically set / cleared)</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GOVRE</name>
              <description>General Overrun Error (cleared on read)</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPE</name>
              <description>Comparison Event (cleared on read)</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PEN</name>
              <description>Pen contact (cleared on read)</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NOPEN</name>
              <description>No Pen Contact (cleared on read)</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PENS</name>
              <description>Pen Detect Status</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCCWR</name>
          <description>Last Channel Compare Window Register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LOWTHRES</name>
              <description>Low Threshold</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>HIGHTHRES</name>
              <description>High Threshold</description>
              <bitRange>[27:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDR</name>
          <description>Last Converted Data Register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>LDATA</name>
              <description>Last Data Converted</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CHNBOSR</name>
              <description>Channel Number in Oversampling Mode</description>
              <bitRange>[28:24]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>LCTMR</name>
          <description>Last Channel Trigger Mode Register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DUALTRIG</name>
              <description>Dual Trigger ON</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPMOD</name>
              <description>Last Channel Comparison Mode</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Generates the LCCHG flag in ADC_ISR when the converted data is lower than the low threshold of the window.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>Generates the LCCHG flag in ADC_ISR when the converted data is higher than the high threshold of the window.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN</name>
                  <description>Generates the LCCHG flag in ADC_ISR when the converted data is in the comparison window.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUT</name>
                  <description>Generates the LCCHG flag in ADC_ISR when the converted data is out of the comparison window.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
