betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
        <register>
          <name>MR</name>
          <description>Mode Register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TRGSEL</name>
              <description>Trigger Selection</description>
              <bitRange>[3:1]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_TRIG0</name>
                  <description>ADTRG</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_TRIG1</name>
                  <description>TIOA0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_TRIG2</name>
                  <description>TIOA1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_TRIG3</name>
                  <description>TIOA2</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_TRIG4</name>
                  <description>PWM event line 0</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_TRIG5</name>
                  <description>PWM event line 1</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_TRIG6</name>
                  <description>TIOA3</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_TRIG7</name>
                  <description>RTCOUT0</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLEEP</name>
              <description>Sleep Mode</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Normal Mode: The ADC core and reference voltage circuitry are kept ON between conversions.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLEEP</name>
                  <description>Sleep Mode: The wakeup time can be modified by programming the FWUP bit.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FWUP</name>
              <description>Fast Wakeup</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>If SLEEP is 1, then both ADC core and reference voltage circuitry are OFF between conversions</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>If SLEEP is 1, then Fast Wakeup Sleep mode: The voltage reference is ON between conversions and ADC core is OFF</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRESCAL</name>
              <description>Prescaler Rate Selection</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>STARTUP</name>
              <description>Startup Time</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SUT0</name>
                  <description>0 periods of ADCCLK</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUT8</name>
                  <description>8 periods of ADCCLK</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUT16</name>
                  <description>16 periods of ADCCLK</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUT24</name>
                  <description>24 periods of ADCCLK</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUT64</name>
                  <description>64 periods of ADCCLK</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUT80</name>
                  <description>80 periods of ADCCLK</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUT96</name>
                  <description>96 periods of ADCCLK</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUT112</name>
                  <description>112 periods of ADCCLK</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUT512</name>
                  <description>512 periods of ADCCLK</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUT576</name>
                  <description>576 periods of ADCCLK</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUT640</name>
                  <description>640 periods of ADCCLK</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUT704</name>
                  <description>704 periods of ADCCLK</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUT768</name>
                  <description>768 periods of ADCCLK</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUT832</name>
                  <description>832 periods of ADCCLK</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUT896</name>
                  <description>896 periods of ADCCLK</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUT960</name>
                  <description>960 periods of ADCCLK</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ANACH</name>
              <description>Analog Change</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No analog change on channel switching: DIFF0 is used for all channels.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALLOWED</name>
                  <description>Allows different analog settings for each channel. See ADC Channel Offset RegisterChannel Configuration Register.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRACKTIM</name>
              <description>Tracking Time</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TRANSFER</name>
              <description>Transfer Time</description>
              <bitRange>[29:28]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MAXSPEED</name>
              <description>Maximum Sampling Rate Enable in Freerun Mode</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>USEQ</name>
              <description>Use Sequence Enable</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NUM_ORDER</name>
                  <description>Normal mode: The controller converts channels in a simple numeric order depending only on the channel index.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG_ORDER</name>
                  <description>User Sequence mode: The sequence respects what is defined in ADC_SEQR1 and ADC_SEQR2 registers and can be used to convert the same channel several times.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OVER</name>
          <description>Overrun Status Register</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>OVRE0</name>
              <description>Overrun Error 0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OVRE1</name>
              <description>Overrun Error 1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OVRE2</name>
              <description>Overrun Error 2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OVRE3</name>
              <description>Overrun Error 3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OVRE4</name>
              <description>Overrun Error 4</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OVRE5</name>
              <description>Overrun Error 5</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OVRE6</name>
              <description>Overrun Error 6</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OVRE7</name>
              <description>Overrun Error 7</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OVRE8</name>
              <description>Overrun Error 8</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OVRE9</name>
              <description>Overrun Error 9</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OVRE10</name>
              <description>Overrun Error 10</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OVRE11</name>
              <description>Overrun Error 11</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRESSR</name>
          <description>Touchscreen Pressure Register</description>
          <addressOffset>0xBC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>Z1</name>
              <description>Data of Z1 Measurement</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>Z2</name>
              <description>Data of Z2 Measurement</description>
              <bitRange>[27:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SEQR1</name>
          <description>Channel Sequence Register 1</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>USCH1</name>
              <description>User Sequence Number 1</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>USCH2</name>
              <description>User Sequence Number 2</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>USCH3</name>
              <description>User Sequence Number 3</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>USCH4</name>
              <description>User Sequence Number 4</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>USCH5</name>
              <description>User Sequence Number 5</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>USCH6</name>
              <description>User Sequence Number 6</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>USCH7</name>
              <description>User Sequence Number 7</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>USCH8</name>
              <description>User Sequence Number 8</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SEQR2</name>
          <description>Channel Sequence Register 2</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>USCH9</name>
              <description>User Sequence Number 9</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>USCH10</name>
              <description>User Sequence Number 10</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>USCH11</name>
              <description>User Sequence Number 11</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TRGR</name>
          <description>Trigger Register</description>
          <addressOffset>0xC0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TRGMOD</name>
              <description>Trigger Mode</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_TRIGGER</name>
                  <description>No trigger, only software trigger can start conversions</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT_TRIG_RISE</name>
                  <description>External trigger rising edge</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT_TRIG_FALL</name>
                  <description>External trigger falling edge</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT_TRIG_ANY</name>
                  <description>External trigger any edge</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PEN_TRIG</name>
                  <description>Pen Detect Trigger (shall be selected only if PENDET is set and TSAMOD = Touchscreen only mode)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PERIOD_TRIG</name>
                  <description>ADC internal periodic trigger (see field TRGPER)</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONTINUOUS</name>
                  <description>Continuous mode</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRGPER</name>
              <description>Trigger Period</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
