betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>AES</name>
      <description>Advanced Encryption Standard</description>
      <baseAddress>0xF002C000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x14</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x40</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x50</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x60</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x70</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x88</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x98</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xB0</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xD0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>AADLENR</name>
          <description>Additional Authenticated Data Length Register</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>AADLEN</name>
              <description>Additional Authenticated Data Length</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ALPHAR</name>
          <description>Alpha Word Register</description>
          <addressOffset>0xD0</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>ALPHA</name>
              <description>Alpha Word x</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>BCNT</name>
          <description>Byte Counter Register</description>
          <addressOffset>0xB4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BCNT</name>
              <description>Auto Padding Byte Counter</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CLENR</name>
          <description>Plaintext/Ciphertext Length Register</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CLEN</name>
              <description>Plaintext/Ciphertext Length</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <description>Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>START</name>
              <description>Start Processing</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWRST</name>
              <description>Software Reset</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRR</name>
          <description>GCM Encryption Counter Value Register</description>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>CTR</name>
              <description>GCM Encryption Counter</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>EMR</name>
          <description>Extended Mode Register</description>
          <addressOffset>0xB0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>APEN</name>
              <description>Auto Padding Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>APM</name>
              <description>Auto Padding Mode</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PLIPEN</name>
              <description>Protocol Layer Improved Performance Enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PLIPD</name>
              <description>Protocol Layer Improved Performance Decipher</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PADLEN</name>
              <description>Auto Padding Length</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>NHEAD</name>
              <description>IPSEC Next Header</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>GCMHR</name>
          <description>GCM H Word Register</description>
          <addressOffset>0x9C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>H</name>
              <description>GCM H Word x</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>GHASHR</name>
          <description>GCM Intermediate Hash Word Register</description>
          <addressOffset>0x78</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>GHASH</name>
              <description>Intermediate GCM Hash Word x</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>IDATAR</name>
          <description>Input Data Register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>IDATA</name>
              <description>Input Data Word</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>IDR</name>
          <description>Interrupt Disable Register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>DATRDY</name>
              <description>Data Ready Interrupt Disable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>URAD</name>
              <description>Unspecified Register Access Detection Interrupt Disable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TAGRDY</name>
              <description>GCM Tag Ready Interrupt Disable</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EOPAD</name>
              <description>End of Padding Interrupt Disable</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PLENERR</name>
              <description>Padding Length Error Interrupt Disable</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <description>Interrupt Enable Register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>DATRDY</name>
              <description>Data Ready Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>URAD</name>
              <description>Unspecified Register Access Detection Interrupt Enable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TAGRDY</name>
              <description>GCM Tag Ready Interrupt Enable</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EOPAD</name>
              <description>End of Padding Interrupt Enable</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PLENERR</name>
              <description>Padding Length Error Interrupt Enable</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMR</name>
          <description>Interrupt Mask Register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>DATRDY</name>
              <description>Data Ready Interrupt Mask</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>URAD</name>
              <description>Unspecified Register Access Detection Interrupt Mask</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TAGRDY</name>
              <description>GCM Tag Ready Interrupt Mask</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EOPAD</name>
              <description>End of Padding Interrupt Mask</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PLENERR</name>
              <description>Padding Length Error Interrupt Mask</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ISR</name>
          <description>Interrupt Status Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>DATRDY</name>
              <description>Data Ready (cleared by setting bit START or bit SWRST in AES_CR or by reading AES_ODATARx)</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>URAD</name>
              <description>Unspecified Register Access Detection Status (cleared by writing SWRST in AES_CR)</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>URAT</name>
              <description>Unspecified Register Access (cleared by writing SWRST in AES_CR)</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDR_WR_PROCESSING</name>
                  <description>Input Data register written during the data processing when SMOD = 2 mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ODR_RD_PROCESSING</name>
                  <description>Output Data register read during the data processing.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MR_WR_PROCESSING</name>
                  <description>Mode register written during the data processing.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ODR_RD_SUBKGEN</name>
                  <description>Output Data register read during the sub-keys generation.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MR_WR_SUBKGEN</name>
                  <description>Mode register written during the sub-keys generation.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WOR_RD_ACCESS</name>
                  <description>Write-only register read access.</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TAGRDY</name>
              <description>GCM Tag Ready</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EOPAD</name>
              <description>End of Padding</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PLENERR</name>
              <description>Padding Length Error</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IVR</name>
          <description>Initialization Vector Register</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>IV</name>
              <description>Initialization Vector</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>KEYWR</name>
          <description>Key Word Register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>KEYW</name>
              <description>Key Word</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
