betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
        <register>
          <name>MR</name>
          <description>Mode Register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CIPHER</name>
              <description>Processing Mode</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GTAGEN</name>
              <description>GCM Automatic Tag Generation Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DUALBUFF</name>
              <description>Dual Input Buffer</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>AES_IDATARx cannot be written during processing of previous block.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>AES_IDATARx can be written during processing of previous block when SMOD = 2. It speeds up the overall runtime of large files.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PROCDLY</name>
              <description>Processing Delay</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SMOD</name>
              <description>Start Mode</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MANUAL_START</name>
                  <description>Manual Mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUTO_START</name>
                  <description>Auto Mode</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDATAR0_START</name>
                  <description>AES_IDATAR0 access only Auto Mode (DMA)</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>KEYSIZE</name>
              <description>Key Size</description>
              <bitRange>[11:10]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AES128</name>
                  <description>AES Key Size is 128 bits</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AES192</name>
                  <description>AES Key Size is 192 bits</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AES256</name>
                  <description>AES Key Size is 256 bits</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPMOD</name>
              <description>Operating Mode</description>
              <bitRange>[14:12]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ECB</name>
                  <description>ECB: Electronic Codebook mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBC</name>
                  <description>CBC: Cipher Block Chaining mode</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFB</name>
                  <description>OFB: Output Feedback mode</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CFB</name>
                  <description>CFB: Cipher Feedback mode</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTR</name>
                  <description>CTR: Counter mode (16-bit internal counter)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCM</name>
                  <description>GCM: Galois/Counter mode</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTS</name>
                  <description>XTS: XEX-based tweaked-codebook mode</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOD</name>
              <description>Last Output Data Mode</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFBS</name>
              <description>Cipher Feedback Data Size</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SIZE_128BIT</name>
                  <description>128-bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE_64BIT</name>
                  <description>64-bit</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE_32BIT</name>
                  <description>32-bit</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE_16BIT</name>
                  <description>16-bit</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE_8BIT</name>
                  <description>8-bit</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CKEY</name>
              <description>Key</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PASSWD</name>
                  <description>This field must be written with 0xE the first time AES_MR is programmed. For subsequent programming of AES_MR, any value can be written, including that of 0xE.Always reads as 0.</description>
                  <value>14</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ODATAR</name>
          <description>Output Data Register</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>ODATA</name>
              <description>Output Data</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TAGR</name>
          <description>GCM Authentication Tag Word Register</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>TAG</name>
              <description>GCM Authentication Tag x</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TWR</name>
          <description>Tweak Word Register</description>
          <addressOffset>0xC0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TWEAK</name>
              <description>Tweak Word x</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
