betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
        <register>
          <name>WPSR</name>
          <description>Write Protection Status Register</description>
          <addressOffset>0xE8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>WPVS</name>
              <description>Write Protection Violation Status</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WPVSRC</name>
              <description>Write Protection Violation Source</description>
              <bitRange>[23:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>AXIMX</name>
      <description>AXI Matrix</description>
      <baseAddress>0x00600000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>AXIMX_REMAP</name>
          <description>AXI Matrix Remap Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>REMAP0</name>
              <description>Remap State 0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CHIPID</name>
      <description>Chip Identifier</description>
      <baseAddress>0xFC069000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CIDR</name>
          <description>Chip ID Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>VERSION</name>
              <description>Version of the Device</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EPROC</name>
              <description>Embedded Processor</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SAMx7</name>
                  <description>Cortex-M7</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARM946ES</name>
                  <description>ARM946ES</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARM7TDMI</name>
                  <description>ARM7TDMI</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM3</name>
                  <description>Cortex-M3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARM920T</name>
                  <description>ARM920T</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARM926EJS</name>
                  <description>ARM926EJS</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CA5</name>
                  <description>Cortex-A5</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM4</name>
                  <description>Cortex-M4</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NVPSIZ</name>
              <description>Nonvolatile Program Memory Size</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>None</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_8K</name>
                  <description>8 Kbytes</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16K</name>
                  <description>16 Kbytes</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_32K</name>
                  <description>32 Kbytes</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_64K</name>
                  <description>64 Kbytes</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_128K</name>
                  <description>128 Kbytes</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_160K</name>
                  <description>160 Kbytes</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_256K</name>
                  <description>256 Kbytes</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_512K</name>
                  <description>512 Kbytes</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1024K</name>
                  <description>1024 Kbytes</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_2048K</name>
                  <description>2048 Kbytes</description>
                  <value>14</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NVPSIZ2</name>
              <description>Second Nonvolatile Program Memory Size</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>None</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_8K</name>
                  <description>8 Kbytes</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16K</name>
                  <description>16 Kbytes</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_32K</name>
                  <description>32 Kbytes</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_64K</name>
                  <description>64 Kbytes</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_128K</name>
                  <description>128 Kbytes</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_256K</name>
                  <description>256 Kbytes</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_512K</name>
                  <description>512 Kbytes</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1024K</name>
                  <description>1024 Kbytes</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_2048K</name>
                  <description>2048 Kbytes</description>
                  <value>14</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAMSIZ</name>
              <description>Internal SRAM Size</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_48K</name>
                  <description>48 Kbytes</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_192K</name>
                  <description>192 Kbytes</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_384K</name>
                  <description>384 Kbytes</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_6K</name>
                  <description>6 Kbytes</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_24K</name>
                  <description>24 Kbytes</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_4K</name>
                  <description>4 Kbytes</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_80K</name>
                  <description>80 Kbytes</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_160K</name>
                  <description>160 Kbytes</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_8K</name>
                  <description>8 Kbytes</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16K</name>
                  <description>16 Kbytes</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_32K</name>
                  <description>32 Kbytes</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_64K</name>
                  <description>64 Kbytes</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_128K</name>
                  <description>128 Kbytes</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_256K</name>
                  <description>256 Kbytes</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_96K</name>
                  <description>96 Kbytes</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_512K</name>
                  <description>512 Kbytes</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ARCH</name>
              <description>Architecture Identifier</description>
              <bitRange>[27:20]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SAMA5</name>
                  <description>SAMA5</description>
                  <value>165</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NVPTYP</name>
              <description>Nonvolatile Program Memory Type</description>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ROM</name>
                  <description>ROM</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ROMLESS</name>
                  <description>ROMless or on-chip Flash</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH</name>
                  <description>Embedded Flash Memory</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ROM_FLASH</name>
                  <description>ROM and Embedded Flash Memory- NVPSIZ is ROM size- NVPSIZ2 is Flash size</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM</name>
                  <description>SRAM emulating ROM</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXT</name>
              <description>Extension Flag</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXID</name>
          <description>Chip ID Extension Register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>EXID</name>
              <description>Chip ID Extension</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
