betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CLASSD</name>
      <description>Audio Class D Amplifier (CLASSD)</description>
      <baseAddress>0xFC048000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x24</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xE4</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR</name>
          <description>Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>SWRST</name>
              <description>Software Reset</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDR</name>
          <description>Interrupt Disable Register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>DATRDY</name>
              <description>Data Ready</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <description>Interrupt Enable Register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>DATRDY</name>
              <description>Data Ready</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMR</name>
          <description>Interrupt Mask Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DATRDY</name>
              <description>Data Ready</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTPMR</name>
          <description>Interpolator Mode Register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ATTL</name>
              <description>Left Channel Attenuation</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ATTR</name>
              <description>Right Channel Attenuation</description>
              <bitRange>[14:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DSPCLKFREQ</name>
              <description>DSP Clock Frequency</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_12M288</name>
                  <description>DSP Clock (DSPCLK) is 12.288 MHz.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_11M2896</name>
                  <description>DSP Clock (DSPCLK) is 11.2896 MHz.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DEEMP</name>
              <description>Enable De-emphasis Filter</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>De-emphasis filter is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>De-emphasis filter is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWAP</name>
              <description>Swap Left and Right Channels</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEFT_ON_LSB</name>
                  <description>Left channel is on CLASSD_THR[15:0], right channel is on CLASSD_THR[31:16].</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RIGHT_ON_LSB</name>
                  <description>Right channel is on CLASSD_THR[15:0], left channel is on CLASSD_THR[31:16].</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRAME</name>
              <description>CLASSD Incoming Data Sampling Frequency</description>
              <bitRange>[22:20]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FRAME_8K</name>
                  <description>8 kHz</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRAME_16K</name>
                  <description>16 kHz</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRAME_32K</name>
                  <description>32 kHz</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRAME_48K</name>
                  <description>48 kHz</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRAME_96K</name>
                  <description>96 kHz</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRAME_22K</name>
                  <description>22.05 kHz</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRAME_44K</name>
                  <description>44.1 kHz</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRAME_88K</name>
                  <description>88.2 kHz</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EQCFG</name>
              <description>Equalization Selection</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLAT</name>
                  <description>Flat Response</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BBOOST12</name>
                  <description>Bass boost +12 dB</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BBOOST6</name>
                  <description>Bass boost +6 dB</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BCUT12</name>
                  <description>Bass cut -12 dB</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BCUT6</name>
                  <description>Bass cut -6 dB</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MBOOST3</name>
                  <description>Medium boost +3 dB</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MBOOST8</name>
                  <description>Medium boost +8 dB</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCUT3</name>
                  <description>Medium cut -3 dB</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCUT8</name>
                  <description>Medium cut -8 dB</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBOOST12</name>
                  <description>Treble boost +12 dB</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBOOST6</name>
                  <description>Treble boost +6 dB</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCUT12</name>
                  <description>Treble cut -12 dB</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCUT6</name>
                  <description>Treble cut -6 dB</description>
                  <value>12</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MONO</name>
              <description>Mono Signal</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>The signal is sent stereo to the left and right channels.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>The same signal is sent on both left and right channels. The sent signal is defined by the MONOMODE field value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MONOMODE</name>
              <description>Mono Mode Selection</description>
              <bitRange>[30:29]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MONOMIX</name>
                  <description>(left + right) / 2 is sent on both channels</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MONOSAT</name>
                  <description>(left + right) is sent to both channels. If the sum is too high, the result is saturated.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MONOLEFT</name>
                  <description>THR[15:0] is sent on both left and right channels</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MONORIGHT</name>
                  <description>THR[31:16] is sent on both left and right channels</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTSR</name>
          <description>Interpolator Status Register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>CFGERR</name>
              <description>Configuration Error</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ISR</name>
          <description>Interrupt Status Register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>DATRDY</name>
              <description>Data Ready</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MR</name>
          <description>Mode Register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LEN</name>
              <description>Left Channel Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LMUTE</name>
              <description>Left Channel Mute</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REN</name>
              <description>Right Channel Enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RMUTE</name>
              <description>Right Channel Mute</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PWMTYP</name>
              <description>PWM Modulation Type</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NON_OVERLAP</name>
              <description>Non-Overlapping Enable</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NOVRVAL</name>
              <description>Non-Overlapping Value</description>
              <bitRange>[21:20]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_5NS</name>
                  <description>Non-overlapping time is 5 ns</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_10NS</name>
                  <description>Non-overlapping time is 10 ns</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_15NS</name>
                  <description>Non-overlapping time is 15 ns</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_20NS</name>
                  <description>Non-overlapping time is 20 ns</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>THR</name>
          <description>Transmit Holding Register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LDATA</name>
              <description>Left Channel Data</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RDATA</name>
              <description>Right Channel Data</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>WPMR</name>
          <description>Write Protection Mode Register</description>
          <addressOffset>0xE4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WPEN</name>
              <description>Write Protection Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WPKEY</name>
              <description>Write Protection Key</description>
              <bitRange>[31:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PASSWD</name>
                  <description>Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0.</description>
                  <value>4410436</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
