betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>FLEXCOM0</name>
      <description>Flexible Serial Communication</description>
      <baseAddress>0xF8034000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x20</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x200</offset>
        <size>0x2C</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x240</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x24C</offset>
        <size>0x14</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x290</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2A0</offset>
        <size>0x18</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2E4</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x400</offset>
        <size>0x20</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x430</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x440</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4E4</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x600</offset>
        <size>0x14</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x620</offset>
        <size>0x1C</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x640</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x64C</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x660</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x6D0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x6E4</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>MR</name>
          <description>FLEXCOM Mode Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OPMODE</name>
              <description>FLEXCOM Operating Mode</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_COM</name>
                  <description>No communication</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART</name>
                  <description>All UART related protocols are selected (RS232, RS485, IrDA, ISO7816, LIN,)SPI/TWI related registers are not accessible and have no impact on IOs.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI</name>
                  <description>SPI operating mode is selected.USART/TWI related registers are not accessible and have no impact on IOs.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWI</name>
                  <description>All TWI related protocols are selected (TWI, SMBus).USART/SPI related registers are not accessible and have no impact on IOs.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RHR</name>
          <description>FLEXCOM Receive Holding Register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RXDATA</name>
              <description>Receive Data</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_CMPR</name>
          <description>SPI Comparison Register</description>
          <addressOffset>0x448</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VAL1</name>
              <description>First Comparison Value for Received Character</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>VAL2</name>
              <description>Second Comparison Value for Received Character</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_CR</name>
          <description>SPI Control Register</description>
          <addressOffset>0x400</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>SPIEN</name>
              <description>SPI Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SPIDIS</name>
              <description>SPI Disable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWRST</name>
              <description>SPI Software Reset</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REQCLR</name>
              <description>Request to Clear the Comparison Trigger</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFCLR</name>
              <description>Transmit FIFO Clear</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFCLR</name>
              <description>Receive FIFO Clear</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LASTXFER</name>
              <description>Last Transfer</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FIFOEN</name>
              <description>FIFO Enable</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FIFODIS</name>
              <description>FIFO Disable</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_CSR</name>
          <description>SPI Chip Select Register</description>
          <addressOffset>0x430</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CPOL</name>
              <description>Clock Polarity</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NCPHA</name>
              <description>Clock Phase</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CSNAAT</name>
              <description>Chip Select Not Active After Transfer (Ignored if CSAAT = 1)</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CSAAT</name>
              <description>Chip Select Active After Transfer</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BITS</name>
              <description>Bits Per Transfer</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>8_BIT</name>
                  <description>8 bits for transfer</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>9_BIT</name>
                  <description>9 bits for transfer</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10_BIT</name>
                  <description>10 bits for transfer</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11_BIT</name>
                  <description>11 bits for transfer</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12_BIT</name>
                  <description>12 bits for transfer</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>13_BIT</name>
                  <description>13 bits for transfer</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14_BIT</name>
                  <description>14 bits for transfer</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>15_BIT</name>
                  <description>15 bits for transfer</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16_BIT</name>
                  <description>16 bits for transfer</description>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCBR</name>
              <description>Serial Clock Bit Rate</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DLYBS</name>
              <description>Delay Before SPCK</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DLYBCT</name>
              <description>Delay Between Consecutive Transfers</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_FLR</name>
          <description>SPI FIFO Level Register</description>
          <addressOffset>0x444</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>TXFL</name>
              <description>Transmit FIFO Level</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RXFL</name>
              <description>Receive FIFO Level</description>
              <bitRange>[21:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_FMR</name>
          <description>SPI FIFO Mode Register</description>
          <addressOffset>0x440</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TXRDYM</name>
              <description>Transmit Data Register Empty Mode</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ONE_DATA</name>
                  <description>TDRE will be at level '1' when at least one data can be written in the Transmit FIFO.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWO_DATA</name>
                  <description>TDRE will be at level '1' when at least two data can be written in the Transmit FIFO.Cannot be used if FLEX_SPI_MR.PS =1.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXRDYM</name>
              <description>Receive Data Register Full Mode</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ONE_DATA</name>
                  <description>RDRF will be at level '1' when at least one unread data is in the Receive FIFO.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWO_DATA</name>
                  <description>RDRF will be at level '1' when at least two unread data are in the Receive FIFO.Cannot be used if FLEX_SPI_MR.PS =1.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOUR_DATA</name>
                  <description>RDRF will be at level '1' when at least four unread data are in the Receive FIFO.Cannot be used when FLEX_SPI_CSRx.BITS is greater than 0, or if FLEX_SPI_MR.MSTR =1, or if FLEX_SPI_MR.PS =1.</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXFTHRES</name>
              <description>Transmit FIFO Threshold</description>
              <bitRange>[21:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RXFTHRES</name>
              <description>Receive FIFO Threshold</description>
              <bitRange>[29:24]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_IDR</name>
          <description>SPI Interrupt Disable Register</description>
          <addressOffset>0x418</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>RDRF</name>
              <description>Receive Data Register Full Interrupt Disable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TDRE</name>
              <description>SPI Transmit Data Register Empty Interrupt Disable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MODF</name>
              <description>Mode Fault Error Interrupt Disable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OVRES</name>
              <description>Overrun Error Interrupt Disable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NSSR</name>
              <description>NSS Rising Interrupt Disable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXEMPTY</name>
              <description>Transmission Registers Empty Disable</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UNDES</name>
              <description>Underrun Error Interrupt Disable</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP</name>
              <description>Comparison Interrupt Disable</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFEF</name>
              <description>TXFEF Interrupt Disable</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFFF</name>
              <description>TXFFF Interrupt Disable</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFTHF</name>
              <description>TXFTHF Interrupt Disable</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFEF</name>
              <description>RXFEF Interrupt Disable</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFFF</name>
              <description>RXFFF Interrupt Disable</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFTHF</name>
              <description>RXFTHF Interrupt Disable</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFPTEF</name>
              <description>TXFPTEF Interrupt Disable</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFPTEF</name>
              <description>RXFPTEF Interrupt Disable</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
