betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
        <register>
          <name>SPI_IER</name>
          <description>SPI Interrupt Enable Register</description>
          <addressOffset>0x414</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>RDRF</name>
              <description>Receive Data Register Full Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TDRE</name>
              <description>SPI Transmit Data Register Empty Interrupt Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MODF</name>
              <description>Mode Fault Error Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OVRES</name>
              <description>Overrun Error Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NSSR</name>
              <description>NSS Rising Interrupt Enable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXEMPTY</name>
              <description>Transmission Registers Empty Enable</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UNDES</name>
              <description>Underrun Error Interrupt Enable</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP</name>
              <description>Comparison Interrupt Enable</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFEF</name>
              <description>TXFEF Interrupt Enable</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFFF</name>
              <description>TXFFF Interrupt Enable</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFTHF</name>
              <description>TXFTHF Interrupt Enable</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFEF</name>
              <description>RXFEF Interrupt Enable</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFFF</name>
              <description>RXFFF Interrupt Enable</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFTHF</name>
              <description>RXFTHF Interrupt Enable</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFPTEF</name>
              <description>TXFPTEF Interrupt Enable</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFPTEF</name>
              <description>RXFPTEF Interrupt Enable</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_IMR</name>
          <description>SPI Interrupt Mask Register</description>
          <addressOffset>0x41C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RDRF</name>
              <description>Receive Data Register Full Interrupt Mask</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TDRE</name>
              <description>SPI Transmit Data Register Empty Interrupt Mask</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MODF</name>
              <description>Mode Fault Error Interrupt Mask</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OVRES</name>
              <description>Overrun Error Interrupt Mask</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NSSR</name>
              <description>NSS Rising Interrupt Mask</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXEMPTY</name>
              <description>Transmission Registers Empty Mask</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UNDES</name>
              <description>Underrun Error Interrupt Mask</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP</name>
              <description>Comparison Interrupt Mask</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFEF</name>
              <description>TXFEF Interrupt Mask</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFFF</name>
              <description>TXFFF Interrupt Mask</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFTHF</name>
              <description>TXFTHF Interrupt Mask</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFEF</name>
              <description>RXFEF Interrupt Mask</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFFF</name>
              <description>RXFFF Interrupt Mask</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFTHF</name>
              <description>RXFTHF Interrupt Mask</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFPTEF</name>
              <description>TXFPTEF Interrupt Mask</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFPTEF</name>
              <description>RXFPTEF Interrupt Mask</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MR</name>
          <description>SPI Mode Register</description>
          <addressOffset>0x404</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MSTR</name>
              <description>Master/Slave Mode</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PS</name>
              <description>Peripheral Select</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PCSDEC</name>
              <description>Chip Select Decode</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BRSRCCLK</name>
              <description>Bit Rate Source Clock</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PERIPH_CLK</name>
                  <description>The peripheral clock is the source clock for the bit rate generation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK</name>
                  <description>GCLK is the source clock for the bit rate generation, thus the bit rate can be independent of the core/peripheral clock.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODFDIS</name>
              <description>Mode Fault Detection</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WDRBT</name>
              <description>Wait Data Read Before Transfer</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LLB</name>
              <description>Local Loopback Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LBHPC</name>
              <description>Last Bit Half Period Compatibility</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPMODE</name>
              <description>Comparison Mode</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLAG_ONLY</name>
                  <description>Any character is received and comparison function drives CMP flag.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>START_CONDITION</name>
                  <description>Comparison condition must be met to start reception of all incoming characters until REQCLR is set.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PCS</name>
              <description>Peripheral Chip Select</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DLYBCS</name>
              <description>Delay Between Chip Selects</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_RDR</name>
          <description>SPI Receive Data Register</description>
          <addressOffset>0x408</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RD</name>
              <description>Receive Data</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RD16_0</name>
              <description>Receive Data</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RD8_0</name>
              <description>Receive Data</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RD8_1</name>
              <description>Receive Data</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PCS</name>
              <description>Peripheral Chip Select</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RD16_1</name>
              <description>Receive Data</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RD8_2</name>
              <description>Receive Data</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RD8_3</name>
              <description>Receive Data</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_SR</name>
          <description>SPI Status Register</description>
          <addressOffset>0x410</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RDRF</name>
              <description>Receive Data Register Full (cleared by reading FLEX_SPI_RDR)</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TDRE</name>
              <description>Transmit Data Register Empty (cleared by writing FLEX_SPI_TDR)</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MODF</name>
              <description>Mode Fault Error (cleared on read)</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OVRES</name>
              <description>Overrun Error Status (cleared on read)</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NSSR</name>
              <description>NSS Rising (cleared on read)</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXEMPTY</name>
              <description>Transmission Registers Empty (cleared by writing FLEX_SPI_TDR)</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UNDES</name>
              <description>Underrun Error Status (Slave mode only) (cleared on read)</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP</name>
              <description>Comparison Status (cleared on read)</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SPIENS</name>
              <description>SPI Enable Status</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFEF</name>
              <description>Transmit FIFO Empty Flag (cleared on read)</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFFF</name>
              <description>Transmit FIFO Full Flag (cleared on read)</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFTHF</name>
              <description>Transmit FIFO Threshold Flag (cleared on read)</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFEF</name>
              <description>Receive FIFO Empty Flag</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFFF</name>
              <description>Receive FIFO Full Flag</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFTHF</name>
              <description>Receive FIFO Threshold Flag</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFPTEF</name>
              <description>Transmit FIFO Pointer Error Flag</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFPTEF</name>
              <description>Receive FIFO Pointer Error Flag</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_TDR</name>
          <description>SPI Transmit Data Register</description>
          <addressOffset>0x40C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>TD</name>
              <description>Transmit Data</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TD0</name>
              <description>Transmit Data</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PCS</name>
              <description>Peripheral Chip Select</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TD1</name>
              <description>Transmit Data</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>LASTXFER</name>
              <description>Last Transfer</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_WPMR</name>
          <description>SPI Write Protection Mode Register</description>
          <addressOffset>0x4E4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WPEN</name>
              <description>Write Protection Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WPKEY</name>
              <description>Write Protection Key</description>
              <bitRange>[31:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PASSWD</name>
                  <description>Writing any other value in this field aborts the write operation of bit WPEN.Always reads as 0</description>
                  <value>5460041</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
