betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
        <register>
          <name>TWI_FMR</name>
          <description>TWI FIFO Mode Register</description>
          <addressOffset>0x650</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TXRDYM</name>
              <description>Transmitter Ready Mode</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ONE_DATA</name>
                  <description>TXRDY will be at level '1' when at least one data can be written in the Transmit FIFO</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWO_DATA</name>
                  <description>TXRDY will be at level '1' when at least two data can be written in the Transmit FIFO</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOUR_DATA</name>
                  <description>TXRDY will be at level '1' when at least four data can be written in the Transmit FIFO</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXRDYM</name>
              <description>Receiver Ready Mode</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ONE_DATA</name>
                  <description>RXRDY will be at level '1' when at least one unread data is in the Receive FIFO</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWO_DATA</name>
                  <description>RXRDY will be at level '1' when at least two unread data are in the Receive FIFO</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOUR_DATA</name>
                  <description>RXRDY will be at level '1' when at least four unread data are in the Receive FIFO</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXFTHRES</name>
              <description>Transmit FIFO Threshold</description>
              <bitRange>[21:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RXFTHRES</name>
              <description>Receive FIFO Threshold</description>
              <bitRange>[29:24]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TWI_FSR</name>
          <description>TWI FIFO Status Register</description>
          <addressOffset>0x660</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>TXFEF</name>
              <description>Transmit FIFO Empty Flag (cleared on read)</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFFF</name>
              <description>Transmit FIFO Full Flag (cleared on read)</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFTHF</name>
              <description>Transmit FIFO Threshold Flag (cleared on read)</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFEF</name>
              <description>Receive FIFO Empty Flag</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFFF</name>
              <description>Receive FIFO Full Flag</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFTHF</name>
              <description>Receive FIFO Threshold Flag</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFPTEF</name>
              <description>Transmit FIFO Pointer Error Flag</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFPTEF</name>
              <description>Receive FIFO Pointer Error Flag</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TWI_IADR</name>
          <description>TWI Internal Address Register</description>
          <addressOffset>0x60C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IADR</name>
              <description>Internal Address</description>
              <bitRange>[23:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>16777215</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TWI_IDR</name>
          <description>TWI Interrupt Disable Register</description>
          <addressOffset>0x628</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>TXCOMP</name>
              <description>Transmission Completed Interrupt Disable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXRDY</name>
              <description>Receive Holding Register Ready Interrupt Disable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXRDY</name>
              <description>Transmit Holding Register Ready Interrupt Disable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SVACC</name>
              <description>Slave Access Interrupt Disable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GACC</name>
              <description>General Call Access Interrupt Disable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OVRE</name>
              <description>Overrun Error Interrupt Disable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UNRE</name>
              <description>Underrun Error Interrupt Disable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NACK</name>
              <description>Not Acknowledge Interrupt Disable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ARBLST</name>
              <description>Arbitration Lost Interrupt Disable</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCL_WS</name>
              <description>Clock Wait State Interrupt Disable</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EOSACC</name>
              <description>End Of Slave Access Interrupt Disable</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENDRX</name>
              <description>End of Receive Buffer Interrupt Disable</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENDTX</name>
              <description>End of Transmit Buffer Interrupt Disable</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXBUFF</name>
              <description>Receive Buffer Full Interrupt Disable</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXBUFE</name>
              <description>Transmit Buffer Empty Interrupt Disable</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MCACK</name>
              <description>Master Code Acknowledge Interrupt Disable</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TOUT</name>
              <description>Timeout Error Interrupt Disable</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PECERR</name>
              <description>PEC Error Interrupt Disable</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMBDAM</name>
              <description>SMBus Default Address Match Interrupt Disable</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMBHHM</name>
              <description>SMBus Host Header Address Match Interrupt Disable</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TWI_IER</name>
          <description>TWI Interrupt Enable Register</description>
          <addressOffset>0x624</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>TXCOMP</name>
              <description>Transmission Completed Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXRDY</name>
              <description>Receive Holding Register Ready Interrupt Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXRDY</name>
              <description>Transmit Holding Register Ready Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SVACC</name>
              <description>Slave Access Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GACC</name>
              <description>General Call Access Interrupt Enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OVRE</name>
              <description>Overrun Error Interrupt Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UNRE</name>
              <description>Underrun Error Interrupt Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NACK</name>
              <description>Not Acknowledge Interrupt Enable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ARBLST</name>
              <description>Arbitration Lost Interrupt Enable</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCL_WS</name>
              <description>Clock Wait State Interrupt Enable</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EOSACC</name>
              <description>End Of Slave Access Interrupt Enable</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENDRX</name>
              <description>End of Receive Buffer Interrupt Enable</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENDTX</name>
              <description>End of Transmit Buffer Interrupt Enable</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXBUFF</name>
              <description>Receive Buffer Full Interrupt Enable</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXBUFE</name>
              <description>Transmit Buffer Empty Interrupt Enable</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MCACK</name>
              <description>Master Code Acknowledge Interrupt Enable</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TOUT</name>
              <description>Timeout Error Interrupt Enable</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PECERR</name>
              <description>PEC Error Interrupt Enable</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMBDAM</name>
              <description>SMBus Default Address Match Interrupt Enable</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMBHHM</name>
              <description>SMBus Host Header Address Match Interrupt Enable</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TWI_IMR</name>
          <description>TWI Interrupt Mask Register</description>
          <addressOffset>0x62C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>TXCOMP</name>
              <description>Transmission Completed Interrupt Mask</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXRDY</name>
              <description>Receive Holding Register Ready Interrupt Mask</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXRDY</name>
              <description>Transmit Holding Register Ready Interrupt Mask</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SVACC</name>
              <description>Slave Access Interrupt Mask</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GACC</name>
              <description>General Call Access Interrupt Mask</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OVRE</name>
              <description>Overrun Error Interrupt Mask</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UNRE</name>
              <description>Underrun Error Interrupt Mask</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NACK</name>
              <description>Not Acknowledge Interrupt Mask</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ARBLST</name>
              <description>Arbitration Lost Interrupt Mask</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCL_WS</name>
              <description>Clock Wait State Interrupt Mask</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EOSACC</name>
              <description>End Of Slave Access Interrupt Mask</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENDRX</name>
              <description>End of Receive Buffer Interrupt Mask</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENDTX</name>
              <description>End of Transmit Buffer Interrupt Mask</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXBUFF</name>
              <description>Receive Buffer Full Interrupt Mask</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXBUFE</name>
              <description>Transmit Buffer Empty Interrupt Mask</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MCACK</name>
              <description>Master Code Acknowledge Interrupt Mask</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TOUT</name>
              <description>Timeout Error Interrupt Mask</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PECERR</name>
              <description>PEC Error Interrupt Mask</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMBDAM</name>
              <description>SMBus Default Address Match Interrupt Mask</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMBHHM</name>
              <description>SMBus Host Header Address Match Interrupt Mask</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TWI_MMR</name>
          <description>TWI Master Mode Register</description>
          <addressOffset>0x604</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IADRSZ</name>
              <description>Internal Device Address Size</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No internal device address</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1_BYTE</name>
                  <description>One-byte internal device address</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2_BYTE</name>
                  <description>Two-byte internal device address</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3_BYTE</name>
                  <description>Three-byte internal device address</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MREAD</name>
              <description>Master Read Direction</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DADR</name>
              <description>Device Address</description>
              <bitRange>[22:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
