betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
        <register>
          <name>US_IMR</name>
          <description>USART Interrupt Mask Register</description>
          <addressOffset>0x210</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RXRDY</name>
              <description>RXRDY Interrupt Mask</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXRDY</name>
              <description>TXRDY Interrupt Mask</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXBRK</name>
              <description>Receiver Break Interrupt Mask</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OVRE</name>
              <description>Overrun Error Interrupt Mask</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FRAME</name>
              <description>Framing Error Interrupt Mask</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PARE</name>
              <description>Parity Error Interrupt Mask</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMEOUT</name>
              <description>Timeout Interrupt Mask</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXEMPTY</name>
              <description>TXEMPTY Interrupt Mask</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ITER</name>
              <description>Max Number of Repetitions Reached Interrupt Mask</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UNRE</name>
              <description>SPI Underrun Error Interrupt Mask</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LINBK</name>
              <description>LIN Break Sent or LIN Break Received Interrupt Mask</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NACK</name>
              <description>Non Acknowledge Interrupt Mask</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LINID</name>
              <description>LIN Identifier Sent or LIN Identifier Received Interrupt Mask</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LINTC</name>
              <description>LIN Transfer Completed Interrupt Mask</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CTSIC</name>
              <description>Clear to Send Input Change Interrupt Mask</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NSSE</name>
              <description>NSS Line (Driving CTS Pin) Rising or Falling Edge Event</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP</name>
              <description>Comparison Interrupt Mask</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MANE</name>
              <description>Manchester Error Interrupt Mask</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LINBE</name>
              <description>LIN Bus Error Interrupt Mask</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LINISFE</name>
              <description>LIN Inconsistent Synch Field Error Interrupt Mask</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LINIPE</name>
              <description>LIN Identifier Parity Interrupt Mask</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LINCE</name>
              <description>LIN Checksum Error Interrupt Mask</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LINSNRE</name>
              <description>LIN Slave Not Responding Error Interrupt Mask</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LINSTE</name>
              <description>LIN Synch Tolerance Error Interrupt Mask</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LINHTE</name>
              <description>LIN Header Timeout Error Interrupt Mask</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>US_LINBRR</name>
          <description>USART LIN Baud Rate Register</description>
          <addressOffset>0x25C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>LINCD</name>
              <description>Clock Divider after Synchronization</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>LINFP</name>
              <description>Fractional Part after Synchronization</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>US_LINIR</name>
          <description>USART LIN Identifier Register</description>
          <addressOffset>0x258</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IDCHR</name>
              <description>Identifier Character</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>US_LINMR</name>
          <description>USART LIN Mode Register</description>
          <addressOffset>0x254</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>NACT</name>
              <description>LIN Node Action</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PUBLISH</name>
                  <description>The USART transmits the response.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUBSCRIBE</name>
                  <description>The USART receives the response.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IGNORE</name>
                  <description>The USART does not transmit and does not receive the response.</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PARDIS</name>
              <description>Parity Disable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHKDIS</name>
              <description>Checksum Disable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHKTYP</name>
              <description>Checksum Type</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DLM</name>
              <description>Data Length Mode</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FSDIS</name>
              <description>Frame Slot Mode Disable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WKUPTYP</name>
              <description>Wakeup Signal Type</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DLC</name>
              <description>Data Length Control</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PDCM</name>
              <description>DMAC Mode</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNCDIS</name>
              <description>Synchronization Disable</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>US_MAN</name>
          <description>USART Manchester Configuration Register</description>
          <addressOffset>0x250</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TX_PL</name>
              <description>Transmitter Preamble Length</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TX_PP</name>
              <description>Transmitter Preamble Pattern</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALL_ONE</name>
                  <description>The preamble is composed of '1's</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALL_ZERO</name>
                  <description>The preamble is composed of '0's</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZERO_ONE</name>
                  <description>The preamble is composed of '01's</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE_ZERO</name>
                  <description>The preamble is composed of '10's</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX_MPOL</name>
              <description>Transmitter Manchester Polarity</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_PL</name>
              <description>Receiver Preamble Length</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RX_PP</name>
              <description>Receiver Preamble Pattern detected</description>
              <bitRange>[25:24]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALL_ONE</name>
                  <description>The preamble is composed of '1's</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALL_ZERO</name>
                  <description>The preamble is composed of '0's</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZERO_ONE</name>
                  <description>The preamble is composed of '01's</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE_ZERO</name>
                  <description>The preamble is composed of '10's</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_MPOL</name>
              <description>Receiver Manchester Polarity</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ONE</name>
              <description>Must Be Set to 1</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DRIFT</name>
              <description>Drift Compensation</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXIDLEV</name>
              <description>Receiver Idle Value</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
