betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
        <register>
          <name>US_MR</name>
          <description>USART Mode Register</description>
          <addressOffset>0x204</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>USART_MODE</name>
              <description>USART Mode of Operation</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SPI_MASTER</name>
                  <description>SPI master</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI_SLAVE</name>
                  <description>SPI slave</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USCLKS</name>
              <description>Clock Selection</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MCK</name>
                  <description>Peripheral clock is selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV</name>
                  <description>Peripheral clock Divided (DIV= 8) is selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK</name>
                  <description>A PMC generic clock is selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCK</name>
                  <description>External pin SCK is selected</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHRL</name>
              <description>Character Length</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>8_BIT</name>
                  <description>Character length is 8 bits</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPHA</name>
              <description>SPI Clock Phase</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNC</name>
              <description>Synchronous Mode Select</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PAR</name>
              <description>Parity Type</description>
              <bitRange>[11:9]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EVEN</name>
                  <description>Even parity</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ODD</name>
                  <description>Odd parity</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPACE</name>
                  <description>Parity forced to 0 (Space)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MARK</name>
                  <description>Parity forced to 1 (Mark)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No parity</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MULTIDROP</name>
                  <description>Multidrop mode</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NBSTOP</name>
              <description>Number of Stop Bits</description>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1_BIT</name>
                  <description>1 stop bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1_5_BIT</name>
                  <description>1.5 stop bit (SYNC = 0) or reserved (SYNC = 1)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2_BIT</name>
                  <description>2 stop bits</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHMODE</name>
              <description>Channel Mode</description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Normal mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUTOMATIC</name>
                  <description>Automatic Echo. Receiver input is connected to the TXD pin.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCAL_LOOPBACK</name>
                  <description>Local Loopback. Transmitter output is connected to the Receiver Input.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REMOTE_LOOPBACK</name>
                  <description>Remote Loopback. RXD pin is internally connected to the TXD pin.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPOL</name>
              <description>SPI Clock Polarity</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MSBF</name>
              <description>Bit Order</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE9</name>
              <description>9-bit Character Length</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKO</name>
              <description>Clock Output Select</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OVER</name>
              <description>Oversampling Mode</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INACK</name>
              <description>Inhibit Non Acknowledge</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WRDBT</name>
              <description>Wait Read Data Before Transfer</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DSNACK</name>
              <description>Disable Successive NACK</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VAR_SYNC</name>
              <description>Variable Synchronization of Command/Data Sync Start Frame Delimiter</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INVDATA</name>
              <description>Inverted Data</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MAX_ITERATION</name>
              <description>Maximum Number of Automatic Iteration</description>
              <bitRange>[26:24]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FILTER</name>
              <description>Receive Line Filter</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MAN</name>
              <description>Manchester Encoder/Decoder Enable</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MODSYNC</name>
              <description>Manchester Synchronization Mode</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ONEBIT</name>
              <description>Start Frame Delimiter Selector</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>US_NER</name>
          <description>USART Number of Errors Register</description>
          <addressOffset>0x244</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>NB_ERRORS</name>
              <description>Number of Errors</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>US_RHR</name>
          <description>USART Receive Holding Register</description>
          <addressOffset>0x218</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RXCHR</name>
              <description>Received Character</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>511</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RXCHR0</name>
              <description>Received Character</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RXCHR1</name>
              <description>Received Character</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RXSYNH</name>
              <description>Received Sync</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXCHR2</name>
              <description>Received Character</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RXCHR3</name>
              <description>Received Character</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>US_RTOR</name>
          <description>USART Receiver Timeout Register</description>
          <addressOffset>0x224</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TO</name>
              <description>Timeout Value</description>
              <bitRange>[16:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>131071</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>US_THR</name>
          <description>USART Transmit Holding Register</description>
          <addressOffset>0x21C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>TXCHR</name>
              <description>Character to be Transmitted</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>511</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TXCHR0</name>
              <description>Character to be Transmitted</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TXCHR1</name>
              <description>Character to be Transmitted</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TXSYNH</name>
              <description>Sync Field to be Transmitted</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXCHR2</name>
              <description>Character to be Transmitted</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TXCHR3</name>
              <description>Character to be Transmitted</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>US_TTGR</name>
          <description>USART Transmitter Timeguard Register</description>
          <addressOffset>0x228</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TG</name>
              <description>Timeguard Value</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>US_WPMR</name>
          <description>USART Write Protection Mode Register</description>
          <addressOffset>0x2E4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WPEN</name>
              <description>Write Protection Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WPKEY</name>
              <description>Write Protection Key</description>
              <bitRange>[31:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PASSWD</name>
                  <description>Writing any other value in this field aborts the write operation of bit WPEN. Always reads as 0.</description>
                  <value>5591873</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>US_WPSR</name>
          <description>USART Write Protection Status Register</description>
          <addressOffset>0x2E8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>WPVS</name>
              <description>Write Protection Violation Status</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WPVSRC</name>
              <description>Write Protection Violation Source</description>
              <bitRange>[23:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
