betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="FLEXCOM0">
      <name>FLEXCOM1</name>
      <description>Flexible Serial Communication</description>
      <baseAddress>0xF8038000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="FLEXCOM0">
      <name>FLEXCOM2</name>
      <description>Flexible Serial Communication</description>
      <baseAddress>0xFC010000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="FLEXCOM0">
      <name>FLEXCOM3</name>
      <description>Flexible Serial Communication</description>
      <baseAddress>0xFC014000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="FLEXCOM0">
      <name>FLEXCOM4</name>
      <description>Flexible Serial Communication</description>
      <baseAddress>0xFC018000</baseAddress>
    </peripheral>
    <peripheral>
      <name>GMAC</name>
      <description>Gigabit Ethernet MAC</description>
      <baseAddress>0xF8008000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4C</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x80</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xA8</offset>
        <size>0x28</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xDC</offset>
        <size>0x1C</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x100</offset>
        <size>0xB4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1BC</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1D0</offset>
        <size>0x30</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x270</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x400</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x440</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x480</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4A0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4BC</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x500</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x540</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x600</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x620</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x640</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x6E0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>AE</name>
          <description>Alignment Errors Register</description>
          <addressOffset>0x19C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>AER</name>
              <description>Alignment Errors</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1023</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>BCFR</name>
          <description>Broadcast Frames Received Register</description>
          <addressOffset>0x15C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>BFRX</name>
              <description>Broadcast Frames Received without Error</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>BCFT</name>
          <description>Broadcast Frames Transmitted Register</description>
          <addressOffset>0x10C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>BFTX</name>
              <description>Broadcast Frames Transmitted without Error</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>BFR64</name>
          <description>64 Byte Frames Received Register</description>
          <addressOffset>0x168</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>NFRX</name>
              <description>64 Byte Frames Received without Error</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>BFT64</name>
          <description>64 Byte Frames Transmitted Register</description>
          <addressOffset>0x118</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>NFTX</name>
              <description>64 Byte Frames Transmitted without Error</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CBSCR</name>
          <description>Credit-Based Shaping Control Register</description>
          <addressOffset>0x4BC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>QBE</name>
              <description>Queue B CBS Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>QAE</name>
              <description>Queue A CBS Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CBSISQA</name>
          <description>Credit-Based Shaping IdleSlope Register for Queue A</description>
          <addressOffset>0x4C0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IS</name>
              <description>IdleSlope</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CBSISQB</name>
          <description>Credit-Based Shaping IdleSlope Register for Queue B</description>
          <addressOffset>0x4C4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IS</name>
              <description>IdleSlope</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CSE</name>
          <description>Carrier Sense Errors Register</description>
          <addressOffset>0x14C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>CSR</name>
              <description>Carrier Sense Error</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1023</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DCFGR</name>
          <description>DMA Configuration Register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FBLDO</name>
              <description>Fixed Burst Length for DMA Data Operations:</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SINGLE</name>
                  <description>00001: Always use SINGLE AHB bursts</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCR4</name>
                  <description>001xx: Attempt to use INCR4 AHB bursts (Default)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCR8</name>
                  <description>01xxx: Attempt to use INCR8 AHB bursts</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCR16</name>
                  <description>1xxxx: Attempt to use INCR16 AHB bursts</description>
                  <value>16</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ESMA</name>
              <description>Endian Swap Mode Enable for Management Descriptor Accesses</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ESPA</name>
              <description>Endian Swap Mode Enable for Packet Data Accesses</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXBMS</name>
              <description>Receiver Packet Buffer Memory Size Select</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EIGHTH</name>
                  <description>4/8 Kbyte Memory Size</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUARTER</name>
                  <description>4/4 Kbytes Memory Size</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HALF</name>
                  <description>4/2 Kbytes Memory Size</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FULL</name>
                  <description>4 Kbytes Memory Size</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXPBMS</name>
              <description>Transmitter Packet Buffer Memory Size Select</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXCOEN</name>
              <description>Transmitter Checksum Generation Offload Enable</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DRBS</name>
              <description>DMA Receive Buffer Size</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DDRP</name>
              <description>DMA Discard Receive Packets</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DTF</name>
          <description>Deferred Transmission Frames Register</description>
          <addressOffset>0x148</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>DEFT</name>
              <description>Deferred Transmission</description>
              <bitRange>[17:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>262143</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>EC</name>
          <description>Excessive Collisions Register</description>
          <addressOffset>0x140</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>XCOL</name>
              <description>Excessive Collisions</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1023</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>EFRN</name>
          <description>PTP Event Frame Received Nanoseconds Register</description>
          <addressOffset>0x1EC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RUD</name>
              <description>Register Update</description>
              <bitRange>[29:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1073741823</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>EFRSH</name>
          <description>PTP Event Frame Received Seconds High Register</description>
          <addressOffset>0xEC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RUD</name>
              <description>Register Update</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>EFRSL</name>
          <description>PTP Event Frame Received Seconds Low Register</description>
          <addressOffset>0x1E8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RUD</name>
              <description>Register Update</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>EFTN</name>
          <description>PTP Event Frame Transmitted Nanoseconds Register</description>
          <addressOffset>0x1E4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RUD</name>
              <description>Register Update</description>
              <bitRange>[29:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1073741823</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>EFTSH</name>
          <description>PTP Event Frame Transmitted Seconds High Register</description>
          <addressOffset>0xE8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RUD</name>
              <description>Register Update</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>EFTSL</name>
          <description>PTP Event Frame Transmitted Seconds Low Register</description>
          <addressOffset>0x1E0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RUD</name>
              <description>Register Update</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>FCSE</name>
          <description>Frame Check Sequence Errors Register</description>
          <addressOffset>0x190</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>FCKR</name>
              <description>Frame Check Sequence Errors</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1023</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>FR</name>
          <description>Frames Received Register</description>
          <addressOffset>0x158</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>FRX</name>
              <description>Frames Received without Error</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>FT</name>
          <description>Frames Transmitted Register</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>FTX</name>
              <description>Frames Transmitted without Error</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>GTBFT1518</name>
          <description>Greater Than 1518 Byte Frames Transmitted Register</description>
          <addressOffset>0x130</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>NFTX</name>
              <description>Greater than 1518 Byte Frames Transmitted without Error</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>HRB</name>
          <description>Hash Register Bottom</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Hash Address</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
