betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
        <register>
          <name>NCFGR</name>
          <description>Network Configuration Register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SPD</name>
              <description>Speed</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FD</name>
              <description>Full Duplex</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DNVLAN</name>
              <description>Discard Non-VLAN FRAMES</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>JFRAME</name>
              <description>Jumbo Frame Size</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CAF</name>
              <description>Copy All Frames</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NBC</name>
              <description>No Broadcast</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MTIHEN</name>
              <description>Multicast Hash Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UNIHEN</name>
              <description>Unicast Hash Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MAXFS</name>
              <description>1536 Maximum Frame Size</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RTY</name>
              <description>Retry Test</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PEN</name>
              <description>Pause Enable</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXBUFO</name>
              <description>Receive Buffer Offset</description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>LFERD</name>
              <description>Length Field Error Frame Discard</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RFCS</name>
              <description>Remove FCS</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK</name>
              <description>MDC CLock Division</description>
              <bitRange>[20:18]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MCK_8</name>
                  <description>MCK divided by 8 (MCK up to 20 MHz)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK_16</name>
                  <description>MCK divided by 16 (MCK up to 40 MHz)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK_32</name>
                  <description>MCK divided by 32 (MCK up to 80 MHz)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK_48</name>
                  <description>MCK divided by 48 (MCK up to 120 MHz)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK_64</name>
                  <description>MCK divided by 64 (MCK up to 160 MHz)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK_96</name>
                  <description>MCK divided by 96 (MCK up to 240 MHz)</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBW</name>
              <description>Data Bus Width</description>
              <bitRange>[22:21]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DCPF</name>
              <description>Disable Copy of Pause Frames</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXCOEN</name>
              <description>Receive Checksum Offload Enable</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EFRHD</name>
              <description>Enable Frames Received in Half Duplex</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IRXFCS</name>
              <description>Ignore RX FCS</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IPGSEN</name>
              <description>IP Stretch Enable</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXBP</name>
              <description>Receive Bad Preamble</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IRXER</name>
              <description>Ignore IPG GRXER</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NCR</name>
          <description>Network Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LBL</name>
              <description>Loop Back Local</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXEN</name>
              <description>Receive Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXEN</name>
              <description>Transmit Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MPE</name>
              <description>Management Port Enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRSTAT</name>
              <description>Clear Statistics Registers</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INCSTAT</name>
              <description>Increment Statistics Registers</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WESTAT</name>
              <description>Write Enable for Statistics Registers</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BP</name>
              <description>Back pressure</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TSTART</name>
              <description>Start Transmission</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>THALT</name>
              <description>Transmit Halt</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXPF</name>
              <description>Transmit Pause Frame</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXZQPF</name>
              <description>Transmit Zero Quantum Pause Frame</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SRTSM</name>
              <description>Store Receive Timestamp to Memory</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENPBPR</name>
              <description>Enable PFC Priority-based Pause Reception</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXPBPF</name>
              <description>Transmit PFC Priority-based Pause Frame</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FNP</name>
              <description>Flush Next Packet</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXLPIEN</name>
              <description>Enable LPI Transmission</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NSC</name>
          <description>1588 Timer Nanosecond Comparison Register</description>
          <addressOffset>0xDC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>NANOSEC</name>
              <description>1588 Timer Nanosecond Comparison Value</description>
              <bitRange>[21:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4194303</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>NSR</name>
          <description>Network Status Register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>MDIO</name>
              <description>MDIO Input Status</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IDLE</name>
              <description>PHY Management Logic Idle</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXLPIS</name>
              <description>LPI Indication</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OFR</name>
          <description>Oversize Frames Received Register</description>
          <addressOffset>0x188</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>OFRX</name>
              <description>Oversized Frames Received</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1023</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ORHI</name>
          <description>Octets Received High Received Register</description>
          <addressOffset>0x154</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RXO</name>
              <description>Received Octets</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ORLO</name>
          <description>Octets Received Low Received Register</description>
          <addressOffset>0x150</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RXO</name>
              <description>Received Octets</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>OTHI</name>
          <description>Octets Transmitted High Register</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>TXO</name>
              <description>Transmitted Octets</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>OTLO</name>
          <description>Octets Transmitted Low Register</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>TXO</name>
              <description>Transmitted Octets</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PEFRN</name>
          <description>PTP Peer Event Frame Received Nanoseconds Register</description>
          <addressOffset>0x1FC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RUD</name>
              <description>Register Update</description>
              <bitRange>[29:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1073741823</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PEFRSH</name>
          <description>PTP Peer Event Frame Received Seconds High Register</description>
          <addressOffset>0xF4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RUD</name>
              <description>Register Update</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PEFRSL</name>
          <description>PTP Peer Event Frame Received Seconds Low Register</description>
          <addressOffset>0x1F8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RUD</name>
              <description>Register Update</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PEFTN</name>
          <description>PTP Peer Event Frame Transmitted Nanoseconds Register</description>
          <addressOffset>0x1F4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RUD</name>
              <description>Register Update</description>
              <bitRange>[29:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1073741823</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PEFTSH</name>
          <description>PTP Peer Event Frame Transmitted Seconds High Register</description>
          <addressOffset>0xF0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RUD</name>
              <description>Register Update</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PEFTSL</name>
          <description>PTP Peer Event Frame Transmitted Seconds Low Register</description>
          <addressOffset>0x1F0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RUD</name>
              <description>Register Update</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PFR</name>
          <description>Pause Frames Received Register</description>
          <addressOffset>0x164</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>PFRX</name>
              <description>Pause Frames Received Register</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PFT</name>
          <description>Pause Frames Transmitted Register</description>
          <addressOffset>0x114</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>PFTX</name>
              <description>Pause Frames Transmitted Register</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RBQB</name>
          <description>Receive Buffer Queue Base Address Register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Receive Buffer Queue Base Address</description>
              <bitRange>[31:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1073741823</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RBQBAPQ</name>
          <description>Receive Buffer Queue Base Address Register Priority Queue (1..2)</description>
          <addressOffset>0x480</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RXBQBA</name>
              <description>Receive Buffer Queue Base Address</description>
              <bitRange>[31:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1073741823</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
