betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
        <register>
          <name>WOL</name>
          <description>Wake on LAN Register</description>
          <addressOffset>0xB8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IP</name>
              <description>ARP Request IP Address</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MAG</name>
              <description>Magic Packet Event Enable</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ARP</name>
              <description>ARP Request IP Address</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SA1</name>
              <description>Specific Address Register 1 Event Enable</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MTI</name>
              <description>Multicast Hash Event Enable</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>I2SC0</name>
      <description>Inter-IC Sound Controller</description>
      <baseAddress>0xF8050000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x28</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR</name>
          <description>Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>RXEN</name>
              <description>Receiver Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXDIS</name>
              <description>Receiver Disable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CKEN</name>
              <description>Clocks Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CKDIS</name>
              <description>Clocks Disable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXEN</name>
              <description>Transmitter Enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXDIS</name>
              <description>Transmitter Disable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWRST</name>
              <description>Software Reset</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDR</name>
          <description>Interrupt Disable Register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>RXRDY</name>
              <description>Receiver Ready Interrupt Disable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXOR</name>
              <description>Receiver Overrun Interrupt Disable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXRDY</name>
              <description>Transmit Ready Interrupt Disable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXUR</name>
              <description>Transmit Underflow Interrupt Disable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <description>Interrupt Enable Register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>RXRDY</name>
              <description>Receiver Ready Interrupt Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXOR</name>
              <description>Receiver Overrun Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXRDY</name>
              <description>Transmit Ready Interrupt Enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXUR</name>
              <description>Transmit Underflow Interrupt Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMR</name>
          <description>Interrupt Mask Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RXRDY</name>
              <description>Receiver Ready Interrupt Disable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXOR</name>
              <description>Receiver Overrun Interrupt Disable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXRDY</name>
              <description>Transmit Ready Interrupt Disable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXUR</name>
              <description>Transmit Underflow Interrupt Disable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MR</name>
          <description>Mode Register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MODE</name>
              <description>Inter-IC Sound Controller Mode</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SLAVE</name>
                  <description>I2SC_CK and I2SC_WS pin inputs used as bit clock and word select/frame synchronization.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASTER</name>
                  <description>Bit clock and word select/frame synchronization generated by I2SC from MCK and output to I2SC_CK and I2SC_WS pins. Peripheral clock or GCLK is output as master clock on I2SC_MCK if I2SC_MR.IMCKMODE is set.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATALENGTH</name>
              <description>Data Word Length</description>
              <bitRange>[4:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_32_BITS</name>
                  <description>Data length is set to 32 bits</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_24_BITS</name>
                  <description>Data length is set to 24 bits</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_20_BITS</name>
                  <description>Data length is set to 20 bits</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_18_BITS</name>
                  <description>Data length is set to 18 bits</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16_BITS</name>
                  <description>Data length is set to 16 bits</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16_BITS_COMPACT</name>
                  <description>Data length is set to 16-bit compact stereo. Left sample in bits 15:0 and right sample in bits 31:16 of same word.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_8_BITS</name>
                  <description>Data length is set to 8 bits</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_8_BITS_COMPACT</name>
                  <description>Data length is set to 8-bit compact stereo. Left sample in bits 7:0 and right sample in bits 15:8 of the same word.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FORMAT</name>
              <description>Data Format</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>I2S</name>
                  <description>I2S format, stereo with I2SC_WS low for left channel, and MSB of sample starting one I2SC_CK period after I2SC_WS edge</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LJ</name>
                  <description>Left-justified format, stereo with I2SC_WS high for left channel, and MSB of sample starting on I2SC_WS edge</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXMONO</name>
              <description>Receive Mono</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXLOOP</name>
              <description>Loopback Test Mode</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXMONO</name>
              <description>Transmit Mono</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXSAME</name>
              <description>Transmit Data when Underrun</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IMCKDIV</name>
              <description>Selected Clock to I2SC Master Clock Ratio</description>
              <bitRange>[21:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>IMCKFS</name>
              <description>Master Clock to fs Ratio</description>
              <bitRange>[29:24]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M2SF32</name>
                  <description>Sample frequency ratio set to 32</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M2SF64</name>
                  <description>Sample frequency ratio set to 64</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M2SF96</name>
                  <description>Sample frequency ratio set to 96</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M2SF128</name>
                  <description>Sample frequency ratio set to 128</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M2SF192</name>
                  <description>Sample frequency ratio set to 192</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M2SF256</name>
                  <description>Sample frequency ratio set to 256</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M2SF384</name>
                  <description>Sample frequency ratio set to 384</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M2SF512</name>
                  <description>Sample frequency ratio set to 512</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M2SF768</name>
                  <description>Sample frequency ratio set to 768</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M2SF1024</name>
                  <description>Sample frequency ratio set to 1024</description>
                  <value>31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M2SF1536</name>
                  <description>Sample frequency ratio set to 1536</description>
                  <value>47</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M2SF2048</name>
                  <description>Sample frequency ratio set to 2048</description>
                  <value>63</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IMCKMODE</name>
              <description>Master Clock Mode</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IWS</name>
              <description>I2SC_WS Slot Width</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RHR</name>
          <description>Receiver Holding Register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RHR</name>
              <description>Receiver Holding Register</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SCR</name>
          <description>Status Clear Register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>RXOR</name>
              <description>Receive Overrun Status Clear</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXUR</name>
              <description>Transmit Underrun Status Clear</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXORCH</name>
              <description>Receive Overrun Per Channel Status Clear</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TXURCH</name>
              <description>Transmit Underrun Per Channel Status Clear</description>
              <bitRange>[21:20]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>Status Register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RXEN</name>
              <description>Receiver Enabled</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXRDY</name>
              <description>Receive Ready</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXOR</name>
              <description>Receive Overrun</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXEN</name>
              <description>Transmitter Enabled</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXRDY</name>
              <description>Transmit Ready</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXUR</name>
              <description>Transmit Underrun</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXORCH</name>
              <description>Receive Overrun Channel</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TXURCH</name>
              <description>Transmit Underrun Channel</description>
              <bitRange>[21:20]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SSR</name>
          <description>Status Set Register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>RXOR</name>
              <description>Receive Overrun Status Set</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXUR</name>
              <description>Transmit Underrun Status Set</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXORCH</name>
              <description>Receive Overrun Per Channel Status Set</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TXURCH</name>
              <description>Transmit Underrun Per Channel Status Set</description>
              <bitRange>[21:20]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>THR</name>
          <description>Transmitter Holding Register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>THR</name>
              <description>Transmitter Holding Register</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
