betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
        <register>
          <name>UIHVAL</name>
          <description>User Initial Hash Value 0 Register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>VAL</name>
              <description>Initial Hash Value</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>ISC</name>
      <description>Image Sensor Controller</description>
      <baseAddress>0xF0008000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x38</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x58</offset>
        <size>0x44</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x198</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x298</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x398</offset>
        <size>0x44</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x3E0</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x410</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CBC_BRIGHT</name>
          <description>Contrast and Brightness, Brightness Register</description>
          <addressOffset>0x3BC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BRIGHT</name>
              <description>Brightness Control (signed 11 bits 1:10:0)</description>
              <bitRange>[10:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>2047</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CBC_CFG</name>
          <description>Contrast and Brightness Configuration Register</description>
          <addressOffset>0x3B8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CCIR</name>
              <description>CCIR656 Stream Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CCIRMODE</name>
              <description>CCIR656 Byte Ordering</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CBY</name>
                  <description>Byte ordering Cb0, Y0, Cr0, Y1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRY</name>
                  <description>Byte ordering Cr0, Y0, Cb0, Y1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YCB</name>
                  <description>Byte ordering Y0, Cb0, Y1, Cr0</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YCR</name>
                  <description>Byte ordering Y0, Cr0, Y1, Cb0</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CBC_CONTRAST</name>
          <description>Contrast and Brightness, Contrast Register</description>
          <addressOffset>0x3C0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CONTRAST</name>
              <description>Contrast (unsigned 12 bits 0:4:8)</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CBC_CTRL</name>
          <description>Contrast and Brightness Control Register</description>
          <addressOffset>0x3B4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Contrast and Brightness Control Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CC_BB_OB</name>
          <description>Color Correction BB OB Register</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BBGAIN</name>
              <description>Blue Gain for Blue Component (signed 12 bits, 1:3:8)</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BOFST</name>
              <description>Blue Component Offset (signed 13 bits, 1:12:0)</description>
              <bitRange>[28:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>8191</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CC_BR_BG</name>
          <description>Color Correction BR BG Register</description>
          <addressOffset>0x8C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BRGAIN</name>
              <description>Red Gain for Blue Component (signed 12 bits, 1:3:8)</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BGGAIN</name>
              <description>Green Gain for Blue Component (signed 12 bits, 1:3:8)</description>
              <bitRange>[27:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CC_CTRL</name>
          <description>Color Correction Control Register</description>
          <addressOffset>0x78</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Color Correction Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CC_GB_OG</name>
          <description>Color Correction GB OG Register</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>GBGAIN</name>
              <description>Blue Gain for Green Component (signed 12 bits, 1:3:8)</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ROFST</name>
              <description>Green Component Offset (signed 13 bits, 1:12:0)</description>
              <bitRange>[28:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>8191</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CC_GR_GG</name>
          <description>Color Correction GR GG Register</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>GRGAIN</name>
              <description>Red Gain for Green Component (signed 12 bits, 1:3:8)</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>GGGAIN</name>
              <description>Green Gain for Green Component (signed 12 bits, 1:3:8)</description>
              <bitRange>[27:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CC_RB_OR</name>
          <description>Color Correction RB OR Register</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RBGAIN</name>
              <description>Blue Gain for Red Component (signed 12 bits, 1:3:8)</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ROFST</name>
              <description>Red Component Offset (signed 13 bits, 1:12:0)</description>
              <bitRange>[28:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>8191</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CC_RR_RG</name>
          <description>Color Correction RR RG Register</description>
          <addressOffset>0x7C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RRGAIN</name>
              <description>Red Gain for Red Component (signed 12 bits, 1:3:8)</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RGGAIN</name>
              <description>Green Gain for Red Component (signed 12 bits, 1:3:8)</description>
              <bitRange>[27:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CFA_CFG</name>
          <description>Color Filter Array Configuration Register</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BAYCFG</name>
              <description>Color Filter Array Pattern</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GRGR</name>
                  <description>Starting row configuration is G R G R (red row)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RGRG</name>
                  <description>Starting row configuration is R G R G (red row</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GBGB</name>
                  <description>Starting row configuration is G B G B (blue row)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BGBG</name>
                  <description>Starting row configuration is B G B G (blue row)</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EITPOL</name>
              <description>Edge Interpolation</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFA_CTRL</name>
          <description>Color Filter Array Control Register</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Color Filter Array Interpolation Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKCFG</name>
          <description>Clock Configuration Register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ICDIV</name>
              <description>ISP Clock Divider</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ICSEL</name>
              <description>ISP Clock Selection</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MCDIV</name>
              <description>Master Clock Divider</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MCSEL</name>
              <description>Master Clock Reference Clock Selection</description>
              <bitRange>[25:24]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKDIS</name>
          <description>Clock Disable Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>ICDIS</name>
              <description>ISP Clock Disable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MCDIS</name>
              <description>Master Clock Disable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ICSWRST</name>
              <description>ISP Clock Software Reset</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MCSWRST</name>
              <description>Master Clock Software Reset</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKEN</name>
          <description>Clock Enable Register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>ICEN</name>
              <description>ISP Clock Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MCEN</name>
              <description>Master Clock Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKSR</name>
          <description>Clock Status Register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>ICSR</name>
              <description>ISP Clock Status Register</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MCSR</name>
              <description>Master Clock Status Register</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SIP</name>
              <description>Synchronization In Progress</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSC_CBB_OCB</name>
          <description>Color Space Conversion CBB OCB Register</description>
          <addressOffset>0x3A8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CBBGAIN</name>
              <description>Blue Gain for Blue Chrominance (signed 12 bits 1:3:8)</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CBOFST</name>
              <description>Blue Chrominance Offset (signed 11 bits 1:10:0)</description>
              <bitRange>[26:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>2047</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CSC_CBR_CBG</name>
          <description>Color Space Conversion CBR CBG Register</description>
          <addressOffset>0x3A4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CBRGAIN</name>
              <description>Red Gain for Blue Chrominance (signed 12 bits, 1:3:8)</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CBGGAIN</name>
              <description>Green Gain for Blue Chrominance (signed 12 bits 1:3:8)</description>
              <bitRange>[27:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CSC_CRB_OCR</name>
          <description>Color Space Conversion CRB OCR Register</description>
          <addressOffset>0x3B0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CRBGAIN</name>
              <description>Blue Gain for Red Chrominance (signed 12 bits 1:3:8)</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CROFST</name>
              <description>Red Chrominance Offset (signed 11 bits 1:10:0)</description>
              <bitRange>[26:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>2047</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
