betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
        <register>
          <name>CSC_CRR_CRG</name>
          <description>Color Space Conversion CRR CRG Register</description>
          <addressOffset>0x3AC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CRRGAIN</name>
              <description>Red Gain for Red Chrominance (signed 12 bits 1:3:8)</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CRGGAIN</name>
              <description>Green Gain for Red Chrominance (signed 12 bits 1:3:8)</description>
              <bitRange>[27:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CSC_CTRL</name>
          <description>Color Space Conversion Control Register</description>
          <addressOffset>0x398</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>RGB to YCbCr Color Space Conversion Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSC_YB_OY</name>
          <description>Color Space Conversion YB, OY Register</description>
          <addressOffset>0x3A0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>YBGAIN</name>
              <description>Blue Gain for Luminance Component (12 bits signed 1:3:8)</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>YOFST</name>
              <description>Luminance Offset (11 bits signed 1:10:0)</description>
              <bitRange>[26:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>2047</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CSC_YR_YG</name>
          <description>Color Space Conversion YR, YG Register</description>
          <addressOffset>0x39C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>YRGAIN</name>
              <description>Reg Gain for Luminance (signed 12 bits 1:3:8)</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>YGGAIN</name>
              <description>Green Gain for Luminance (signed 12 bits 1:3:8)</description>
              <bitRange>[27:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLDIS</name>
          <description>Control Disable Register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>DISABLE</name>
              <description>Capture Disable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWRST</name>
              <description>Software Reset</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLEN</name>
          <description>Control Enable Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CAPTURE</name>
              <description>Capture Input Stream Command</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UPPRO</name>
              <description>Update Profile</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HISREQ</name>
              <description>Histogram Request</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HISCLR</name>
              <description>Histogram Clear</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLSR</name>
          <description>Control Status Register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>CAPTURE</name>
              <description>Capture pending</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UPPRO</name>
              <description>Profile Update Pending</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HISREQ</name>
              <description>Histogram Request Pending</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FIELD</name>
              <description>Field Status (only relevant when the video stream is interlaced)</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SIP</name>
              <description>Synchronization In Progress</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCFG</name>
          <description>DMA Configuration Register</description>
          <addressOffset>0x3E0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IMODE</name>
              <description>DMA Input Mode Selection</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PACKED8</name>
                  <description>8 bits, single channel packed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PACKED16</name>
                  <description>16 bits, single channel packed</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PACKED32</name>
                  <description>32 bits, single channel packed</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YC422SP</name>
                  <description>32 bits, dual channel</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YC422P</name>
                  <description>32 bits, triple channel</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YC420SP</name>
                  <description>32 bits, dual channel</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YC420P</name>
                  <description>32 bits, triple channel</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>YMBSIZE</name>
              <description>DMA Memory Burst Size Y channel</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SINGLE</name>
                  <description>DMA single access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BEATS4</name>
                  <description>4-beat burst access</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BEATS8</name>
                  <description>8-beat burst access</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BEATS16</name>
                  <description>16-beat burst access</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMBSIZE</name>
              <description>DMA Memory Burst Size C channel</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SINGLE</name>
                  <description>DMA single access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BEATS4</name>
                  <description>4-beat burst access</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BEATS8</name>
                  <description>8-beat burst access</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BEATS16</name>
                  <description>16-beat burst access</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCTRL</name>
          <description>DMA Control Register</description>
          <addressOffset>0x3E4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DE</name>
              <description>Descriptor Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DVIEW</name>
              <description>Descriptor View</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PACKED</name>
                  <description>Address {0} Stride {0} are updated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEMIPLANAR</name>
                  <description>Address {0,1} Stride {0,1} are updated</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLANAR</name>
                  <description>Address {0,1,2} Stride {0,1,2} are updated</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IE</name>
              <description>Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WB</name>
              <description>Write Back Operation Enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FIELD</name>
              <description>Value of Captured Frame Field Signal(1)(2)</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DONE</name>
              <description>Descriptor Processing Status(2)</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DNDA</name>
          <description>DMA Descriptor Address Register</description>
          <addressOffset>0x3E8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>NDA</name>
              <description>Next Descriptor Address Register</description>
              <bitRange>[31:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1073741823</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>GAM_BENTRY</name>
          <description>Gamma Correction Blue Entry</description>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BSLOPE</name>
              <description>Blue Color Slope for Piecewise Interpolation (signed 10 bits 1:3:6)</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1023</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BCONSTANT</name>
              <description>Blue Color Constant for Piecewise Interpolation (unsigned 10 bits 0:10:0)</description>
              <bitRange>[25:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1023</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>GAM_CTRL</name>
          <description>Gamma Correction Control Register</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Gamma Correction Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BENABLE</name>
              <description>Gamma Correction Enable for B Channel</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GENABLE</name>
              <description>Gamma Correction Enable for G Channel</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RENABLE</name>
              <description>Gamma Correction Enable for R Channel</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GAM_GENTRY</name>
          <description>Gamma Correction Green Entry</description>
          <addressOffset>0x198</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>GSLOPE</name>
              <description>Green Color Slope for Piecewise Interpolation (signed 10 bits 1:3:6)</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1023</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>GCONSTANT</name>
              <description>Green Color Constant for Piecewise Interpolation (unsigned 10 bits 0:10:0)</description>
              <bitRange>[25:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1023</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>GAM_RENTRY</name>
          <description>Gamma Correction Red Entry</description>
          <addressOffset>0x298</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RSLOPE</name>
              <description>Red Color Slope for Piecewise Interpolation (signed 10 bits 1:3:6)</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1023</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RCONSTANT</name>
              <description>Red Color Constant for Piecewise Interpolation (unsigned 10 bits 0:10:0)</description>
              <bitRange>[25:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1023</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>HIS_CFG</name>
          <description>Histogram Configuration Register</description>
          <addressOffset>0x3D8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MODE</name>
              <description>Histogram Operating Mode</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Gr</name>
                  <description>Gr sampling</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R</name>
                  <description>R sampling</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Gb</name>
                  <description>Gb sampling</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B</name>
                  <description>B sampling</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Y</name>
                  <description>Luminance-only mode</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RAW</name>
                  <description>Raw sampling</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YCCIR656</name>
                  <description>Luminance only with CCIR656 10-bit or 8-bit mode</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BAYSEL</name>
              <description>Bayer Color Component Selection</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GRGR</name>
                  <description>Starting row configuration is G R G R (red row)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RGRG</name>
                  <description>Starting row configuration is R G R G (red row)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GBGB</name>
                  <description>Starting row configuration is G B G B (blue row</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BGBG</name>
                  <description>Starting row configuration is B G B G (blue row)</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAR</name>
              <description>Histogram Reset After Read</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
