betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
        <register>
          <name>HIS_CTRL</name>
          <description>Histogram Control Register</description>
          <addressOffset>0x3D4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Histogram Sub Module Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIS_ENTRY</name>
          <description>Histogram Entry</description>
          <addressOffset>0x410</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>COUNT</name>
              <description>Entry Counter</description>
              <bitRange>[19:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1048575</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>INTDIS</name>
          <description>Interrupt Disable Register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>VD</name>
              <description>Vertical Synchronization Detection Interrupt Disable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HD</name>
              <description>Horizontal Synchronization Detection Interrupt Disable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWRST</name>
              <description>Software Reset Completed Interrupt Disable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DIS</name>
              <description>Disable Completed Interrupt Disable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DDONE</name>
              <description>DMA Done Interrupt Disable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LDONE</name>
              <description>DMA List Done Interrupt Disable</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HISDONE</name>
              <description>Histogram Completed Interrupt Disable</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HISCLR</name>
              <description>Histogram Clear Interrupt Disable</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WERR</name>
              <description>Write Channel Error Interrupt Disable</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RERR</name>
              <description>Read Channel Error Interrupt Disable</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VFPOV</name>
              <description>Vertical Front Porch Overflow Interrupt Disable</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DAOV</name>
              <description>Data Overflow Interrupt Disable</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VDTO</name>
              <description>Vertical Synchronization Timeout Interrupt Disable</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HDTO</name>
              <description>Horizontal Synchronization Timeout Interrupt Disable</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CCIRERR</name>
              <description>CCIR Decoder Error Interrupt Disable</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTEN</name>
          <description>Interrupt Enable Register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>VD</name>
              <description>Vertical Synchronization Detection Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HD</name>
              <description>Horizontal Synchronization Detection Interrupt Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWRST</name>
              <description>Software Reset Completed Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DIS</name>
              <description>Disable Completed Interrupt Enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DDONE</name>
              <description>DMA Done Interrupt Enable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LDONE</name>
              <description>DMA List Done Interrupt Enable</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HISDONE</name>
              <description>Histogram Completed Interrupt Enable</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HISCLR</name>
              <description>Histogram Clear Interrupt Enable</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WERR</name>
              <description>Write Channel Error Interrupt Enable</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RERR</name>
              <description>Read Channel Error Interrupt Enable</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VFPOV</name>
              <description>Vertical Front Porch Overflow Interrupt Enable</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DAOV</name>
              <description>Data Overflow Interrupt Enable</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VDTO</name>
              <description>Vertical Synchronization Timeout Interrupt Enable</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HDTO</name>
              <description>Horizontal Synchronization Timeout Interrupt Enable</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CCIRERR</name>
              <description>CCIR Decoder Error Interrupt Enable</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTMASK</name>
          <description>Interrupt Mask Register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>VD</name>
              <description>Vertical Synchronization Detection Interrupt Mask</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HD</name>
              <description>Horizontal Synchronization Detection Interrupt Mask</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWRST</name>
              <description>Software Reset Completed Interrupt Mask</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DIS</name>
              <description>Disable Completed Interrupt Mask</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DDONE</name>
              <description>DMA Done Interrupt Mask</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LDONE</name>
              <description>DMA List Done Interrupt Mask</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HISDONE</name>
              <description>Histogram Completed Interrupt Mask</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HISCLR</name>
              <description>Histogram Clear Interrupt Mask</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WERR</name>
              <description>Write Channel Error Interrupt Mask</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RERR</name>
              <description>Read Channel Error Interrupt Mask</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VFPOV</name>
              <description>Vertical Front Porch Overflow Interrupt Mask</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DAOV</name>
              <description>Data Overflow Interrupt Mask</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VDTO</name>
              <description>Vertical Synchronization Timeout Interrupt Mask</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HDTO</name>
              <description>Horizontal Synchronization Timeout Interrupt Mask</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CCIRERR</name>
              <description>CCIR Decoder Error Interrupt Mask</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTSR</name>
          <description>Interrupt Status Register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>VD</name>
              <description>Vertical Synchronization Detected Interrupt</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HD</name>
              <description>Horizontal Synchronization Detected Interrupt</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWRST</name>
              <description>Software Reset Completed Interrupt</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DIS</name>
              <description>Disable Completed Interrupt</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DDONE</name>
              <description>DMA Done Interrupt</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LDONE</name>
              <description>DMA List Done Interrupt</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HISDONE</name>
              <description>Histogram Completed Interrupt</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HISCLR</name>
              <description>Histogram Clear Interrupt</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WERR</name>
              <description>Write Channel Error Interrupt</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WERRID</name>
              <description>Write Channel Error Identifier</description>
              <bitRange>[18:17]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH0</name>
                  <description>An error occurred for Channel 0 (RAW/RGB/Y)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH1</name>
                  <description>An error occurred for Channel 1 (CbCr/Cb)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH2</name>
                  <description>An error occurred for Channel 2 (Cr)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WB</name>
                  <description>Write back channel error</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RERR</name>
              <description>Read Channel Error Interrupt</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VFPOV</name>
              <description>Vertical Front Porch Overflow Interrupt</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DAOV</name>
              <description>Data Overflow Interrupt</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VDTO</name>
              <description>Vertical Synchronization Timeout Interrupt</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HDTO</name>
              <description>Horizontal Synchronization Timeout Interrupt</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CCIRERR</name>
              <description>CCIR Decoder Error Interrupt</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
