betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
        <register>
          <name>PFE_CFG0</name>
          <description>Parallel Front End Configuration 0 Register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>HPOL</name>
              <description>Horizontal Synchronization Polarity</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VPOL</name>
              <description>Vertical Synchronization Polarity</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PPOL</name>
              <description>Pixel Clock Polarity</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FPOL</name>
              <description>Field Polarity</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE</name>
              <description>Parallel Front End Mode</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PROGRESSIVE</name>
                  <description>Video source is progressive.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DF_TOP</name>
                  <description>Video source is interlaced, two fields are captured starting with top field.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DF_BOTTOM</name>
                  <description>Video source is interlaced, two fields are captured starting with bottom field.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DF_IMMEDIATE</name>
                  <description>Video source is interlaced, two fields are captured immediately.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SF_TOP</name>
                  <description>Video source is interlaced, one field is captured starting with the top field.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SF_BOTTOM</name>
                  <description>Video source is interlaced, one field is captured starting with the bottom field.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SF_IMMEDIATE</name>
                  <description>Video source is interlaced, one field is captured starting immediately.</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CONT</name>
              <description>Continuous Acquisition</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GATED</name>
              <description>Gated input clock</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CCIR656</name>
              <description>CCIR656 input mode</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CCIR_CRC</name>
              <description>CCIR656 CRC Decoder</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CCIR10_8N</name>
              <description>CCIR 10 bits or 8 bits</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COLEN</name>
              <description>Column Cropping Enable</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ROWEN</name>
              <description>Row Cropping Enable</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SKIPCNT</name>
              <description>Frame Skipping Counter</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CCIR_REP</name>
              <description>CCIR Replication</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BPS</name>
              <description>Bits Per Sample</description>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TWELVE</name>
                  <description>12-bit input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ELEVEN</name>
                  <description>11-bit input</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEN</name>
                  <description>10-bit input</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NINE</name>
                  <description>9-bit input</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIGHT</name>
                  <description>8-bit input</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REP</name>
              <description>Up Multiply with Replication</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PFE_CFG1</name>
          <description>Parallel Front End Configuration 1 Register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>COLMIN</name>
              <description>Column Minimum Limit</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>COLMAX</name>
              <description>Column Maximum Limit</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PFE_CFG2</name>
          <description>Parallel Front End Configuration 2 Register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ROWMIN</name>
              <description>Row Minimum Limit</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ROWMAX</name>
              <description>Row Maximum Limit</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RLP_CFG</name>
          <description>Rounding, Limiting and Packing Configuration Register</description>
          <addressOffset>0x3D0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MODE</name>
              <description>Rounding, Limiting and Packing Mode</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DAT8</name>
                  <description>8-bit data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAT9</name>
                  <description>9-bit data</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAT10</name>
                  <description>10-bit data</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAT11</name>
                  <description>11-bit data</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAT12</name>
                  <description>12-bit data</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATY8</name>
                  <description>8-bit luminance only</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATY10</name>
                  <description>10-bit luminance only</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARGB444</name>
                  <description>12-bit RGB+4-bit Alpha (MSB)</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARGB555</name>
                  <description>15-bit RGB+1-bit Alpha (MSB)</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RGB565</name>
                  <description>16-bit RGB</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARGB32</name>
                  <description>24-bits RGB mode+8-bit Alpha</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YYCC</name>
                  <description>YCbCr mode (full range, [0-255])</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YYCC_LIMITED</name>
                  <description>YCbCr mode (limited range)</description>
                  <value>12</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALPHA</name>
              <description>Alpha Value for Alpha-enabled RGB Mode</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SUB420_CTRL</name>
          <description>Subsampling 4:2:2 to 4:2:0 Control Register</description>
          <addressOffset>0x3CC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>4:2:2 to 4:2:0 Vertical Subsampling Filter Enable (Center Aligned)</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FILTER</name>
              <description>Interlaced or Progressive Chrominance Filter</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SUB422_CFG</name>
          <description>Subsampling 4:4:4 to 4:2:2 Configuration Register</description>
          <addressOffset>0x3C8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CCIR</name>
              <description>CCIR656 Input Stream</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CCIRMODE</name>
              <description>CCIR656 Byte Ordering</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CBY</name>
                  <description>Byte ordering Cb0, Y0, Cr0, Y1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRY</name>
                  <description>Byte ordering Cr0, Y0, Cb0, Y1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YCB</name>
                  <description>Byte ordering Y0, Cb0, Y1, Cr0</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YCR</name>
                  <description>Byte ordering Y0, Cr0, Y1, Cb0</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FILTER</name>
              <description>Low Pass Filter Selection</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FILT0CO</name>
                  <description>Cosited, {1}</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FILT1CE</name>
                  <description>Centered {1, 1}</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FILT2CO</name>
                  <description>Cosited {1,2,1}</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FILT3CE</name>
                  <description>Centered {1, 3, 3, 1}</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUB422_CTRL</name>
          <description>Subsampling 4:4:4 to 4:2:2 Control Register</description>
          <addressOffset>0x3C4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>4:4:4 to 4:2:2 Chrominance Horizontal Subsampling Filter Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WB_CFG</name>
          <description>White Balance Configuration Register</description>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BAYCFG</name>
              <description>White Balance Bayer Configuration (Pixel Color Pattern)</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GRGR</name>
                  <description>Starting Row configuration is G R G R (Red Row)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RGRG</name>
                  <description>Starting Row configuration is R G R G (Red Row)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GBGB</name>
                  <description>Starting Row configuration is G B G B (Blue Row)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BGBG</name>
                  <description>Starting Row configuration is B G B G (Blue Row)</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WB_CTRL</name>
          <description>White Balance Control Register</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>White Balance Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WB_G_BGB</name>
          <description>White Balance Gain for B, GB Register</description>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BGAIN</name>
              <description>Blue Component Gain (unsigned 13 bits, 0:4:9)</description>
              <bitRange>[12:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>8191</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>GBGAIN</name>
              <description>Green Component (Blue row) Gain (unsigned 13 bits, 0:4:9)</description>
              <bitRange>[28:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>8191</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>WB_G_RGR</name>
          <description>White Balance Gain for R, GR Register</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RGAIN</name>
              <description>Red Component Gain (unsigned 13 bits, 0:4:9)</description>
              <bitRange>[12:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>8191</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>GRGAIN</name>
              <description>Green Component (Red row) Gain (unsigned 13 bits, 0:4:9)</description>
              <bitRange>[28:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>8191</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>WB_O_BGB</name>
          <description>White Balance Offset for B, GB Register</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BOFST</name>
              <description>Offset Blue Component (signed 13 bits, 1:12:0)</description>
              <bitRange>[12:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>8191</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>GBOFST</name>
              <description>Offset Green Component for Blue Row (signed 13 bits, 1:12:0)</description>
              <bitRange>[28:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>8191</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
