betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
        <register>
          <name>ECFGR0</name>
          <description>Event Counter 0 Configuration Register</description>
          <addressOffset>0x208</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EIGEN</name>
              <description>Event Counter Interrupt Generation</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT_DIS</name>
                  <description>Disables (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT_EN_INCR</name>
                  <description>Enables with Increment condition</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT_EN_OVER</name>
                  <description>Enables with Overflow condition</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT_GEN_DIS</name>
                  <description>Disables Interrupt generation</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ESRC</name>
              <description>Event Counter Source</description>
              <bitRange>[5:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CNT_DIS</name>
                  <description>Counter Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRC_CO</name>
                  <description>Source is CO</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRC_DRHIT</name>
                  <description>Source is DRHIT</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRC_DRREQ</name>
                  <description>Source is DRREQ</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRC_DWHIT</name>
                  <description>Source is DWHIT</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRC_DWREQ</name>
                  <description>Source is DWREQ</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRC_DWTREQ</name>
                  <description>Source is DWTREQ</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRC_IRHIT</name>
                  <description>Source is IRHIT</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRC_IRREQ</name>
                  <description>Source is IRREQ</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRC_WA</name>
                  <description>Source is WA</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRC_IPFALLOC</name>
                  <description>Source is IPFALLOC</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRC_EPFHIT</name>
                  <description>Source is EPFHIT</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRC_EPFALLOC</name>
                  <description>Source is EPFALLOC</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRC_SRRCVD</name>
                  <description>Source is SRRCVD</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRC_SRCONF</name>
                  <description>Source is SRCONF</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRC_EPFRCVD</name>
                  <description>Source is EPFRCVD</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ECFGR1</name>
          <description>Event Counter 1 Configuration Register</description>
          <addressOffset>0x204</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EIGEN</name>
              <description>Event Counter Interrupt Generation</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT_DIS</name>
                  <description>Disables (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT_EN_INCR</name>
                  <description>Enables with Increment condition</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT_EN_OVER</name>
                  <description>Enables with Overflow condition</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT_GEN_DIS</name>
                  <description>Disables Interrupt generation</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ESRC</name>
              <description>Event Counter Source</description>
              <bitRange>[5:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CNT_DIS</name>
                  <description>Counter Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRC_CO</name>
                  <description>Source is CO</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRC_DRHIT</name>
                  <description>Source is DRHIT</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRC_DRREQ</name>
                  <description>Source is DRREQ</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRC_DWHIT</name>
                  <description>Source is DWHIT</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRC_DWREQ</name>
                  <description>Source is DWREQ</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRC_DWTREQ</name>
                  <description>Source is DWTREQ</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRC_IRHIT</name>
                  <description>Source is IRHIT</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRC_IRREQ</name>
                  <description>Source is IRREQ</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRC_WA</name>
                  <description>Source is WA</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRC_IPFALLOC</name>
                  <description>Source is IPFALLOC</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRC_EPFHIT</name>
                  <description>Source is EPFHIT</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRC_EPFALLOC</name>
                  <description>Source is EPFALLOC</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRC_SRRCVD</name>
                  <description>Source is SRRCVD</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRC_SRCONF</name>
                  <description>Source is SRCONF</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRC_EPFRCVD</name>
                  <description>Source is EPFRCVD</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ECR</name>
          <description>Event Counter Control Register</description>
          <addressOffset>0x200</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVCEN</name>
              <description>Event Counter Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EVC0RST</name>
              <description>Event Counter 0 Reset</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EVC1RST</name>
              <description>Event Counter 1 Reset</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EVR0</name>
          <description>Event Counter 0 Value Register</description>
          <addressOffset>0x210</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Event Counter Value</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>EVR1</name>
          <description>Event Counter 1 Value Register</description>
          <addressOffset>0x20C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Event Counter Value</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <description>Interrupt Clear Register</description>
          <addressOffset>0x220</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ECNTR</name>
              <description>Event Counter 1/0 Overflow Increment</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PARRT</name>
              <description>Parity Error on L2 Tag RAM, Read</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PARRD</name>
              <description>Parity Error on L2 Data RAM, Read</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ERRWT</name>
              <description>Error on L2 Tag RAM, Write</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ERRWD</name>
              <description>Error on L2 Data RAM, Write</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ERRRT</name>
              <description>Error on L2 Tag RAM, Read</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ERRRD</name>
              <description>Error on L2 Data RAM, Read</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SLVERR</name>
              <description>SLVERR from L3 memory</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DECERR</name>
              <description>DECERR from L3 memory</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDR</name>
          <description>Cache ID Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>ID</name>
              <description>Cache Controller ID</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ILKR</name>
          <description>Instruction Lockdown Register</description>
          <addressOffset>0x904</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ILK0</name>
              <description>Instruction Lockdown in Way Number 0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ILK1</name>
              <description>Instruction Lockdown in Way Number 1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ILK2</name>
              <description>Instruction Lockdown in Way Number 2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ILK3</name>
              <description>Instruction Lockdown in Way Number 3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ILK4</name>
              <description>Instruction Lockdown in Way Number 4</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ILK5</name>
              <description>Instruction Lockdown in Way Number 5</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ILK6</name>
              <description>Instruction Lockdown in Way Number 6</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ILK7</name>
              <description>Instruction Lockdown in Way Number 7</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMR</name>
          <description>Interrupt Mask Register</description>
          <addressOffset>0x214</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ECNTR</name>
              <description>Event Counter 1/0 Overflow Increment</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PARRT</name>
              <description>Parity Error on L2 Tag RAM, Read</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PARRD</name>
              <description>Parity Error on L2 Data RAM, Read</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ERRWT</name>
              <description>Error on L2 Tag RAM, Write</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ERRWD</name>
              <description>Error on L2 Data RAM, Write</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ERRRT</name>
              <description>Error on L2 Tag RAM, Read</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ERRRD</name>
              <description>Error on L2 Data RAM, Read</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SLVERR</name>
              <description>SLVERR from L3 Memory</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DECERR</name>
              <description>DECERR from L3 Memory</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IPALR</name>
          <description>Invalidate Physical Address Line Register</description>
          <addressOffset>0x770</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>C</name>
              <description>Cache Synchronization Status</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IDX</name>
              <description>Index Number</description>
              <bitRange>[13:5]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>511</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TAG</name>
              <description>Tag Number</description>
              <bitRange>[31:14]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>262143</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>IWR</name>
          <description>Invalidate Way Register</description>
          <addressOffset>0x77C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WAY0</name>
              <description>Invalidate Way Number 0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WAY1</name>
              <description>Invalidate Way Number 1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WAY2</name>
              <description>Invalidate Way Number 2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WAY3</name>
              <description>Invalidate Way Number 3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WAY4</name>
              <description>Invalidate Way Number 4</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WAY5</name>
              <description>Invalidate Way Number 5</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WAY6</name>
              <description>Invalidate Way Number 6</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WAY7</name>
              <description>Invalidate Way Number 7</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
