betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>LCDC</name>
      <description>LCD Controller</description>
      <baseAddress>0xF0000000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1C</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x20</offset>
        <size>0x68</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x140</offset>
        <size>0x54</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x240</offset>
        <size>0x54</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x340</offset>
        <size>0xF4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x540</offset>
        <size>0x44</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x600</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xA00</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xE00</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1200</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ATTR</name>
          <description>LCD Controller Attribute Register</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>BASE</name>
              <description>Base Layer Update Attribute</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OVR1</name>
              <description>Overlay 1 Update Attribute</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OVR2</name>
              <description>Overlay 2 Update Attribute</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HEO</name>
              <description>High-End Overlay Update Attribute</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PP</name>
              <description>Post-Processing Update Attribute</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BASEA2Q</name>
              <description>Base Layer Update Add To Queue</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OVR1A2Q</name>
              <description>Overlay 1 Update Add To Queue</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OVR2A2Q</name>
              <description>Overlay 2 Update Add to Queue</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HEOA2Q</name>
              <description>High-End Overlay Update Add To Queue</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PPA2Q</name>
              <description>Post-Processing Update Add To Queue</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BASEADDR</name>
          <description>Base DMA Address Register</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADDR</name>
              <description>DMA Transfer Start Address</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>BASECFG0</name>
          <description>Base Layer Configuration Register 0</description>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SIF</name>
              <description>Source Interface</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BLEN</name>
              <description>AHB Burst Length</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AHB_SINGLE</name>
                  <description>AHB Access is started as soon as there is enough space in the FIFO to store one data. SINGLE, INCR, INCR4, INCR8 and INCR16 bursts are used. INCR is used for a burst of 2 and 3 beats.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AHB_INCR4</name>
                  <description>AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 4 data. An AHB INCR4 Burst is used. SINGLE, INCR and INCR4 bursts are used. INCR is used for a burst of 2 and 3 beats.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AHB_INCR8</name>
                  <description>AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 8 data. An AHB INCR8 Burst is used. SINGLE, INCR, INCR4 and INCR8 bursts are used. INCR is used for a burst of 2 and 3 beats.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AHB_INCR16</name>
                  <description>AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 16 data. An AHB INCR16 Burst is used. SINGLE, INCR, INCR4, INCR8 and INCR16 bursts are used. INCR is used for a burst of 2 and 3 beats.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DLBO</name>
              <description>Defined Length Burst Only For Channel Bus Transaction</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BASECFG1</name>
          <description>Base Layer Configuration Register 1</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CLUTEN</name>
              <description>Color Lookup Table Mode Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RGBMODE</name>
              <description>RGB Mode Input Selection</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_12BPP_RGB_444</name>
                  <description>12 bpp RGB 444</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16BPP_ARGB_4444</name>
                  <description>16 bpp ARGB 4444</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16BPP_RGBA_4444</name>
                  <description>16 bpp RGBA 4444</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16BPP_RGB_565</name>
                  <description>16 bpp RGB 565</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16BPP_TRGB_1555</name>
                  <description>16 bpp TRGB 1555</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_18BPP_RGB_666</name>
                  <description>18 bpp RGB 666</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_18BPP_RGB_666PACKED</name>
                  <description>18 bpp RGB 666 PACKED</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_19BPP_TRGB_1666</name>
                  <description>19 bpp TRGB 1666</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_19BPP_TRGB_PACKED</name>
                  <description>19 bpp TRGB 1666 PACKED</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_24BPP_RGB_888</name>
                  <description>24 bpp RGB 888</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_24BPP_RGB_888_PACKED</name>
                  <description>24 bpp RGB 888 PACKED</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_25BPP_TRGB_1888</name>
                  <description>25 bpp TRGB 1888</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_32BPP_ARGB_8888</name>
                  <description>32 bpp ARGB 8888</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_32BPP_RGBA_8888</name>
                  <description>32 bpp RGBA 8888</description>
                  <value>13</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLUTMODE</name>
              <description>Color Lookup Table Mode Input Selection</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLUT_1BPP</name>
                  <description>Color Lookup Table mode set to 1 bit per pixel</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLUT_2BPP</name>
                  <description>Color Lookup Table mode set to 2 bits per pixel</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLUT_4BPP</name>
                  <description>Color Lookup Table mode set to 4 bits per pixel</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLUT_8BPP</name>
                  <description>Color Lookup Table mode set to 8 bits per pixel</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BASECFG2</name>
          <description>Base Layer Configuration Register 2</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>XSTRIDE</name>
              <description>Horizontal Stride</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>BASECFG3</name>
          <description>Base Layer Configuration Register 3</description>
          <addressOffset>0x78</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BDEF</name>
              <description>Blue Default</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>GDEF</name>
              <description>Green Default</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RDEF</name>
              <description>Red Default</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>BASECFG4</name>
          <description>Base Layer Configuration Register 4</description>
          <addressOffset>0x7C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DMA</name>
              <description>Use DMA Data Path</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REP</name>
              <description>Use Replication logic to expand RGB color to 24 bits</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DISCEN</name>
              <description>Discard Area Enable</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BASECFG5</name>
          <description>Base Layer Configuration Register 5</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DISCXPOS</name>
              <description>Discard Area Horizontal Coordinate</description>
              <bitRange>[10:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>2047</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DISCYPOS</name>
              <description>Discard Area Vertical Coordinate</description>
              <bitRange>[26:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>2047</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>BASECFG6</name>
          <description>Base Layer Configuration Register 6</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DISCXSIZE</name>
              <description>Discard Area Horizontal Size</description>
              <bitRange>[10:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>2047</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DISCYSIZE</name>
              <description>Discard Area Vertical Size</description>
              <bitRange>[26:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>2047</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>BASECHDR</name>
          <description>Base Layer Channel Disable Register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CHDIS</name>
              <description>Channel Disable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHRST</name>
              <description>Channel Reset</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BASECHER</name>
          <description>Base Layer Channel Enable Register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CHEN</name>
              <description>Channel Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UPDATEEN</name>
              <description>Update Overlay Attributes Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>A2QEN</name>
              <description>Add To Queue Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BASECHSR</name>
          <description>Base Layer Channel Status Register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>CHSR</name>
              <description>Channel Status</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UPDATESR</name>
              <description>Update Overlay Attributes In Progress Status</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>A2QSR</name>
              <description>Add To Queue Status</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BASECLUT</name>
          <description>Base CLUT Register</description>
          <addressOffset>0x600</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BCLUT</name>
              <description>Blue Color Entry</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>GCLUT</name>
              <description>Green Color Entry</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RCLUT</name>
              <description>Red Color Entry</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
