betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
        <register>
          <name>BASECTRL</name>
          <description>Base DMA Control Register</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DFETCH</name>
              <description>Transfer Descriptor Fetch Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LFETCH</name>
              <description>Lookup Table Fetch Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DMAIEN</name>
              <description>End of DMA Transfer Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DSCRIEN</name>
              <description>Descriptor Loaded Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDIEN</name>
              <description>Add Head Descriptor to Queue Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DONEIEN</name>
              <description>End of List Interrupt Enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BASEHEAD</name>
          <description>Base DMA Head Register</description>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>HEAD</name>
              <description>DMA Head Pointer</description>
              <bitRange>[31:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1073741823</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>BASEIDR</name>
          <description>Base Layer Interrupt Disabled Register</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>DMA</name>
              <description>End of DMA Transfer Interrupt Disable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DSCR</name>
              <description>Descriptor Loaded Interrupt Disable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADD</name>
              <description>Head Descriptor Loaded Interrupt Disable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DONE</name>
              <description>End of List Interrupt Disable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OVR</name>
              <description>Overflow Interrupt Disable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BASEIER</name>
          <description>Base Layer Interrupt Enable Register</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>DMA</name>
              <description>End of DMA Transfer Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DSCR</name>
              <description>Descriptor Loaded Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADD</name>
              <description>Head Descriptor Loaded Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DONE</name>
              <description>End of List Interrupt Enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OVR</name>
              <description>Overflow Interrupt Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BASEIMR</name>
          <description>Base Layer Interrupt Mask Register</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>DMA</name>
              <description>End of DMA Transfer Interrupt Mask</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DSCR</name>
              <description>Descriptor Loaded Interrupt Mask</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADD</name>
              <description>Head Descriptor Loaded Interrupt Mask</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DONE</name>
              <description>End of List Interrupt Mask</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OVR</name>
              <description>Overflow Interrupt Mask</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BASEISR</name>
          <description>Base Layer Interrupt Status Register</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>DMA</name>
              <description>End of DMA Transfer</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DSCR</name>
              <description>DMA Descriptor Loaded</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADD</name>
              <description>Head Descriptor Loaded</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DONE</name>
              <description>End of List Detected</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OVR</name>
              <description>Overflow Detected</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BASENEXT</name>
          <description>Base DMA Next Register</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>NEXT</name>
              <description>DMA Descriptor Next Address</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOADDR</name>
          <description>High-End Overlay DMA Address Register</description>
          <addressOffset>0x360</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADDR</name>
              <description>DMA Transfer Start Address</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG0</name>
          <description>High-End Overlay Configuration Register 0</description>
          <addressOffset>0x38C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SIF</name>
              <description>Source Interface</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BLEN</name>
              <description>AHB Burst Length</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AHB_BLEN_SINGLE</name>
                  <description>AHB Access is started as soon as there is enough space in the FIFO to store one data. SINGLE, INCR, INCR4, INCR8 and INCR16 bursts are used. INCR is used for a burst of 2 and 3 beats.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AHB_BLEN_INCR4</name>
                  <description>AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 4 data. An AHB INCR4 Burst is used. SINGLE, INCR and INCR4 bursts are used. INCR is used for a burst of 2 and 3 beats.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AHB_BLEN_INCR8</name>
                  <description>AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 8 data. An AHB INCR8 Burst is used. SINGLE, INCR, INCR4 and INCR8 bursts are used. INCR is used for a burst of 2 and 3 beats.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AHB_BLEN_INCR16</name>
                  <description>AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 16 data. An AHB INCR16 Burst is used. SINGLE, INCR, INCR4, INCR8 and INCR16 bursts are used. INCR is used for a burst of 2 and 3 beats.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BLENUV</name>
              <description>AHB Burst Length for U-V Channel</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AHB_SINGLE</name>
                  <description>AHB Access is started as soon as there is enough space in the FIFO to store one data. SINGLE, INCR, INCR4, INCR8 and INCR16 bursts are used. INCR is used for a burst of 2 and 3 beats.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AHB_INCR4</name>
                  <description>AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 4 data. An AHB INCR4 Burst is used. SINGLE, INCR and INCR4 bursts are used. INCR is used for a burst of 2 and 3 beats.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AHB_INCR8</name>
                  <description>AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 8 data. An AHB INCR8 Burst is used. SINGLE, INCR, INCR4 and INCR8 bursts are used. INCR is used for a burst of 2 and 3 beats.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AHB_INCR16</name>
                  <description>AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 16 data. An AHB INCR16 Burst is used. SINGLE, INCR, INCR4, INCR8 and INCR16 bursts are used. INCR is used for a burst of 2 and 3 beats.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DLBO</name>
              <description>Defined Length Burst Only For Channel Bus Transaction</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ROTDIS</name>
              <description>Hardware Rotation Optimization Disable</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCKDIS</name>
              <description>Hardware Rotation Lock Disable</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG1</name>
          <description>High-End Overlay Configuration Register 1</description>
          <addressOffset>0x390</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CLUTEN</name>
              <description>Color Lookup Table Mode Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>YUVEN</name>
              <description>YUV Color Space Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RGBMODE</name>
              <description>RGB Mode Input Selection</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_12BPP_RGB_444</name>
                  <description>12 bpp RGB 444</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16BPP_ARGB_4444</name>
                  <description>16 bpp ARGB 4444</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16BPP_RGBA_4444</name>
                  <description>16 bpp RGBA 4444</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16BPP_RGB_565</name>
                  <description>16 bpp RGB 565</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16BPP_TRGB_1555</name>
                  <description>16 bpp TRGB 1555</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_18BPP_RGB_666</name>
                  <description>18 bpp RGB 666</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_18BPP_RGB_666PACKED</name>
                  <description>18 bpp RGB 666 PACKED</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_19BPP_TRGB_1666</name>
                  <description>19 bpp TRGB 1666</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_19BPP_TRGB_PACKED</name>
                  <description>19 bpp TRGB 1666 PACKED</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_24BPP_RGB_888</name>
                  <description>24 bpp RGB 888</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_24BPP_RGB_888_PACKED</name>
                  <description>24 bpp RGB 888 PACKED</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_25BPP_TRGB_1888</name>
                  <description>25 bpp TRGB 1888</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_32BPP_ARGB_8888</name>
                  <description>32 bpp ARGB 8888</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_32BPP_RGBA_8888</name>
                  <description>32 bpp RGBA 8888</description>
                  <value>13</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLUTMODE</name>
              <description>Color Lookup Table Mode Input Selection</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLUT_1BPP</name>
                  <description>Color Lookup Table mode set to 1 bit per pixel</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLUT_2BPP</name>
                  <description>Color Lookup Table mode set to 2 bits per pixel</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLUT_4BPP</name>
                  <description>Color Lookup Table mode set to 4 bits per pixel</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLUT_8BPP</name>
                  <description>Color Lookup Table mode set to 8 bits per pixel</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>YUVMODE</name>
              <description>YUV Mode Input Selection</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>YUV422ROT</name>
              <description>YUV 4:2:2 Rotation</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>YUV422SWP</name>
              <description>YUV 4:2:2 Swap</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DSCALEOPT</name>
              <description>Down Scaling Bandwidth Optimization</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG10</name>
          <description>High-End Overlay Configuration Register 10</description>
          <addressOffset>0x3B4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BKEY</name>
              <description>Blue Color Component Chroma Key</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>GKEY</name>
              <description>Green Color Component Chroma Key</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RKEY</name>
              <description>Red Color Component Chroma Key</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
