betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
        <register>
          <name>HEOCFG11</name>
          <description>High-End Overlay Configuration Register 11</description>
          <addressOffset>0x3B8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BMASK</name>
              <description>Blue Color Component Chroma Key Mask</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>GMASK</name>
              <description>Green Color Component Chroma Key Mask</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RMASK</name>
              <description>Red Color Component Chroma Key Mask</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG12</name>
          <description>High-End Overlay Configuration Register 12</description>
          <addressOffset>0x3BC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CRKEY</name>
              <description>Blender Chroma Key Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INV</name>
              <description>Blender Inverted Blender Output Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ITER2BL</name>
              <description>Blender Iterated Color Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ITER</name>
              <description>Blender Use Iterated Color</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REVALPHA</name>
              <description>Blender Reverse Alpha</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GAEN</name>
              <description>Blender Global Alpha Enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LAEN</name>
              <description>Blender Local Alpha Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OVR</name>
              <description>Blender Overlay Layer Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA</name>
              <description>Blender DMA Layer Enable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REP</name>
              <description>Use Replication logic to expand RGB color to 24 bits</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DSTKEY</name>
              <description>Destination Chroma Keying</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VIDPRI</name>
              <description>Video Priority</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GA</name>
              <description>Blender Global Alpha</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG13</name>
          <description>High-End Overlay Configuration Register 13</description>
          <addressOffset>0x3C0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>XFACTOR</name>
              <description>Horizontal Scaling Factor</description>
              <bitRange>[13:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>16383</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>YFACTOR</name>
              <description>Vertical Scaling Factor</description>
              <bitRange>[29:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>16383</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SCALEN</name>
              <description>Hardware Scaler Enable</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG14</name>
          <description>High-End Overlay Configuration Register 14</description>
          <addressOffset>0x3C4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CSCRY</name>
              <description>Color Space Conversion Y coefficient for Red Component 1:2:7 format</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1023</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CSCRU</name>
              <description>Color Space Conversion U coefficient for Red Component 1:2:7 format</description>
              <bitRange>[19:10]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1023</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CSCRV</name>
              <description>Color Space Conversion V coefficient for Red Component 1:2:7 format</description>
              <bitRange>[29:20]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1023</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CSCYOFF</name>
              <description>Color Space Conversion Offset</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG15</name>
          <description>High-End Overlay Configuration Register 15</description>
          <addressOffset>0x3C8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CSCGY</name>
              <description>Color Space Conversion Y coefficient for Green Component 1:2:7 format</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1023</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CSCGU</name>
              <description>Color Space Conversion U coefficient for Green Component 1:2:7 format</description>
              <bitRange>[19:10]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1023</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CSCGV</name>
              <description>Color Space Conversion V coefficient for Green Component 1:2:7 format</description>
              <bitRange>[29:20]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1023</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CSCUOFF</name>
              <description>Color Space Conversion Offset</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG16</name>
          <description>High-End Overlay Configuration Register 16</description>
          <addressOffset>0x3CC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CSCBY</name>
              <description>Color Space Conversion Y coefficient for Blue Component 1:2:7 format</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1023</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CSCBU</name>
              <description>Color Space Conversion U coefficient for Blue Component 1:2:7 format</description>
              <bitRange>[19:10]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1023</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CSCBV</name>
              <description>Color Space Conversion V coefficient for Blue Component 1:2:7 format</description>
              <bitRange>[29:20]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1023</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CSCVOFF</name>
              <description>Color Space Conversion Offset</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG17</name>
          <description>High-End Overlay Configuration Register 17</description>
          <addressOffset>0x3D0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>XPHI0COEFF0</name>
              <description>Horizontal Coefficient for phase 0 tap 0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>XPHI0COEFF1</name>
              <description>Horizontal Coefficient for phase 0 tap 1</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>XPHI0COEFF2</name>
              <description>Horizontal Coefficient for phase 0 tap 2</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>XPHI0COEFF3</name>
              <description>Horizontal Coefficient for phase 0 tap 3</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG18</name>
          <description>High-End Overlay Configuration Register 18</description>
          <addressOffset>0x3D4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>XPHI0COEFF4</name>
              <description>Horizontal Coefficient for phase 0 tap 4</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG19</name>
          <description>High-End Overlay Configuration Register 19</description>
          <addressOffset>0x3D8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>XPHI1COEFF0</name>
              <description>Horizontal Coefficient for phase 1 tap 0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>XPHI1COEFF1</name>
              <description>Horizontal Coefficient for phase 1 tap 1</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>XPHI1COEFF2</name>
              <description>Horizontal Coefficient for phase 1 tap 2</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>XPHI1COEFF3</name>
              <description>Horizontal Coefficient for phase 1 tap 3</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG2</name>
          <description>High-End Overlay Configuration Register 2</description>
          <addressOffset>0x394</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>XPOS</name>
              <description>Horizontal Window Position</description>
              <bitRange>[10:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>2047</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>YPOS</name>
              <description>Vertical Window Position</description>
              <bitRange>[26:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>2047</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG20</name>
          <description>High-End Overlay Configuration Register 20</description>
          <addressOffset>0x3DC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>XPHI1COEFF4</name>
              <description>Horizontal Coefficient for phase 1 tap 4</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG21</name>
          <description>High-End Overlay Configuration Register 21</description>
          <addressOffset>0x3E0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>XPHI2COEFF0</name>
              <description>Horizontal Coefficient for phase 2 tap 0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>XPHI2COEFF1</name>
              <description>Horizontal Coefficient for phase 2 tap 1</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>XPHI2COEFF2</name>
              <description>Horizontal Coefficient for phase 2 tap 2</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>XPHI2COEFF3</name>
              <description>Horizontal Coefficient for phase 2 tap 3</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG22</name>
          <description>High-End Overlay Configuration Register 22</description>
          <addressOffset>0x3E4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>XPHI2COEFF4</name>
              <description>Horizontal Coefficient for phase 2 tap 4</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG23</name>
          <description>High-End Overlay Configuration Register 23</description>
          <addressOffset>0x3E8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>XPHI3COEFF0</name>
              <description>Horizontal Coefficient for phase 3 tap 0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>XPHI3COEFF1</name>
              <description>Horizontal Coefficient for phase 3 tap 1</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>XPHI3COEFF2</name>
              <description>Horizontal Coefficient for phase 3 tap 2</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>XPHI3COEFF3</name>
              <description>Horizontal Coefficient for phase 3 tap 3</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
