betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
        <register>
          <name>HEOCFG39</name>
          <description>High-End Overlay Configuration Register 39</description>
          <addressOffset>0x428</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>YPHI6COEFF0</name>
              <description>Vertical Coefficient for phase 6 tap 0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>YPHI6COEFF1</name>
              <description>Vertical Coefficient for phase 6 tap 1</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>YPHI6COEFF2</name>
              <description>Vertical Coefficient for phase 6 tap 2</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG4</name>
          <description>High-End Overlay Configuration Register 4</description>
          <addressOffset>0x39C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>XMEMSIZE</name>
              <description>Horizontal image Size in Memory</description>
              <bitRange>[10:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>2047</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>YMEMSIZE</name>
              <description>Vertical image Size in Memory</description>
              <bitRange>[26:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>2047</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG40</name>
          <description>High-End Overlay Configuration Register 40</description>
          <addressOffset>0x42C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>YPHI7COEFF0</name>
              <description>Vertical Coefficient for phase 7 tap 0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>YPHI7COEFF1</name>
              <description>Vertical Coefficient for phase 7 tap 1</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>YPHI7COEFF2</name>
              <description>Vertical Coefficient for phase 7 tap 2</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG41</name>
          <description>High-End Overlay Configuration Register 41</description>
          <addressOffset>0x430</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>XPHIDEF</name>
              <description>Horizontal Filter Phase Offset</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>YPHIDEF</name>
              <description>Vertical Filter Phase Offset</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG5</name>
          <description>High-End Overlay Configuration Register 5</description>
          <addressOffset>0x3A0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>XSTRIDE</name>
              <description>Horizontal Stride</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG6</name>
          <description>High-End Overlay Configuration Register 6</description>
          <addressOffset>0x3A4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PSTRIDE</name>
              <description>Pixel Stride</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG7</name>
          <description>High-End Overlay Configuration Register 7</description>
          <addressOffset>0x3A8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>UVXSTRIDE</name>
              <description>UV Horizontal Stride</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG8</name>
          <description>High-End Overlay Configuration Register 8</description>
          <addressOffset>0x3AC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>UVPSTRIDE</name>
              <description>UV Pixel Stride</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG9</name>
          <description>High-End Overlay Configuration Register 9</description>
          <addressOffset>0x3B0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BDEF</name>
              <description>Blue Default</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>GDEF</name>
              <description>Green Default</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RDEF</name>
              <description>Red Default</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCHDR</name>
          <description>High-End Overlay Channel Disable Register</description>
          <addressOffset>0x344</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CHDIS</name>
              <description>Channel Disable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHRST</name>
              <description>Channel Reset</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCHER</name>
          <description>High-End Overlay Channel Enable Register</description>
          <addressOffset>0x340</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CHEN</name>
              <description>Channel Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UPDATEEN</name>
              <description>Update Overlay Attributes Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>A2QEN</name>
              <description>Add To Queue Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCHSR</name>
          <description>High-End Overlay Channel Status Register</description>
          <addressOffset>0x348</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>CHSR</name>
              <description>Channel Status</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UPDATESR</name>
              <description>Update Overlay Attributes In Progress Status</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>A2QSR</name>
              <description>Add To Queue Status</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCLUT</name>
          <description>High-End Overlay CLUT Register</description>
          <addressOffset>0x1200</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BCLUT</name>
              <description>Blue Color Entry</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>GCLUT</name>
              <description>Green Color Entry</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RCLUT</name>
              <description>Red Color Entry</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ACLUT</name>
              <description>Alpha Color Entry</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCTRL</name>
          <description>High-End Overlay DMA Control Register</description>
          <addressOffset>0x364</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DFETCH</name>
              <description>Transfer Descriptor Fetch Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LFETCH</name>
              <description>Lookup Table Fetch Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DMAIEN</name>
              <description>End of DMA Transfer Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DSCRIEN</name>
              <description>Descriptor Loaded Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDIEN</name>
              <description>Add Head Descriptor to Queue Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DONEIEN</name>
              <description>End of List Interrupt Enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOHEAD</name>
          <description>High-End Overlay DMA Head Register</description>
          <addressOffset>0x35C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>HEAD</name>
              <description>DMA Head Pointer</description>
              <bitRange>[31:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1073741823</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOIDR</name>
          <description>High-End Overlay Interrupt Disable Register</description>
          <addressOffset>0x350</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>DMA</name>
              <description>End of DMA Transfer Interrupt Disable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DSCR</name>
              <description>Descriptor Loaded Interrupt Disable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADD</name>
              <description>Head Descriptor Loaded Interrupt Disable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DONE</name>
              <description>End of List Interrupt Disable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OVR</name>
              <description>Overflow Interrupt Disable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UDMA</name>
              <description>End of DMA Transfer for U or UV Chrominance Component Interrupt Disable</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UDSCR</name>
              <description>Descriptor Loaded for U or UV Chrominance Component Interrupt Disable</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UADD</name>
              <description>Head Descriptor Loaded for U or UV Chrominance Component Interrupt Disable</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UDONE</name>
              <description>End of List Interrupt for U or UV Chrominance Component Disable</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UOVR</name>
              <description>Overflow Interrupt for U or UV Chrominance Component Disable</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VDMA</name>
              <description>End of DMA Transfer for V Chrominance Component Interrupt Disable</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VDSCR</name>
              <description>Descriptor Loaded for V Chrominance Component Interrupt Disable</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VADD</name>
              <description>Head Descriptor Loaded for V Chrominance Component Interrupt Disable</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VDONE</name>
              <description>End of List for V Chrominance Component Interrupt Disable</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VOVR</name>
              <description>Overflow for V Chrominance Component Interrupt Disable</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
