betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
        <register>
          <name>HEOIER</name>
          <description>High-End Overlay Interrupt Enable Register</description>
          <addressOffset>0x34C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>DMA</name>
              <description>End of DMA Transfer Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DSCR</name>
              <description>Descriptor Loaded Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADD</name>
              <description>Head Descriptor Loaded Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DONE</name>
              <description>End of List Interrupt Enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OVR</name>
              <description>Overflow Interrupt Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UDMA</name>
              <description>End of DMA Transfer for U or UV Chrominance Interrupt Enable</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UDSCR</name>
              <description>Descriptor Loaded for U or UV Chrominance Interrupt Enable</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UADD</name>
              <description>Head Descriptor Loaded for U or UV Chrominance Interrupt Enable</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UDONE</name>
              <description>End of List for U or UV Chrominance Interrupt Enable</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UOVR</name>
              <description>Overflow for U or UV Chrominance Interrupt Enable</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VDMA</name>
              <description>End of DMA for V Chrominance Transfer Interrupt Enable</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VDSCR</name>
              <description>Descriptor Loaded for V Chrominance Interrupt Enable</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VADD</name>
              <description>Head Descriptor Loaded for V Chrominance Interrupt Enable</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VDONE</name>
              <description>End of List for V Chrominance Interrupt Enable</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VOVR</name>
              <description>Overflow for V Chrominance Interrupt Enable</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOIMR</name>
          <description>High-End Overlay Interrupt Mask Register</description>
          <addressOffset>0x354</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>DMA</name>
              <description>End of DMA Transfer Interrupt Mask</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DSCR</name>
              <description>Descriptor Loaded Interrupt Mask</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADD</name>
              <description>Head Descriptor Loaded Interrupt Mask</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DONE</name>
              <description>End of List Interrupt Mask</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OVR</name>
              <description>Overflow Interrupt Mask</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UDMA</name>
              <description>End of DMA Transfer for U or UV Chrominance Component Interrupt Mask</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UDSCR</name>
              <description>Descriptor Loaded for U or UV Chrominance Component Interrupt Mask</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UADD</name>
              <description>Head Descriptor Loaded for U or UV Chrominance Component Mask</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UDONE</name>
              <description>End of List for U or UV Chrominance Component Mask</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UOVR</name>
              <description>Overflow for U Chrominance Interrupt Mask</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VDMA</name>
              <description>End of DMA Transfer for V Chrominance Component Interrupt Mask</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VDSCR</name>
              <description>Descriptor Loaded for V Chrominance Component Interrupt Mask</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VADD</name>
              <description>Head Descriptor Loaded for V Chrominance Component Mask</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VDONE</name>
              <description>End of List for V Chrominance Component Mask</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VOVR</name>
              <description>Overflow for V Chrominance Interrupt Mask</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOISR</name>
          <description>High-End Overlay Interrupt Status Register</description>
          <addressOffset>0x358</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>DMA</name>
              <description>End of DMA Transfer</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DSCR</name>
              <description>DMA Descriptor Loaded</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADD</name>
              <description>Head Descriptor Loaded</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DONE</name>
              <description>End of List Detected</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OVR</name>
              <description>Overflow Detected</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UDMA</name>
              <description>End of DMA Transfer for U Component</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UDSCR</name>
              <description>DMA Descriptor Loaded for U Component</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UADD</name>
              <description>Head Descriptor Loaded for U Component</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UDONE</name>
              <description>End of List Detected for U Component</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UOVR</name>
              <description>Overflow Detected for U Component</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VDMA</name>
              <description>End of DMA Transfer for V Component</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VDSCR</name>
              <description>DMA Descriptor Loaded for V Component</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VADD</name>
              <description>Head Descriptor Loaded for V Component</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VDONE</name>
              <description>End of List Detected for V Component</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VOVR</name>
              <description>Overflow Detected for V Component</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HEONEXT</name>
          <description>High-End Overlay DMA Next Register</description>
          <addressOffset>0x368</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>NEXT</name>
              <description>DMA Descriptor Next Address</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOUADDR</name>
          <description>High-End Overlay U-UV DMA Address Register</description>
          <addressOffset>0x370</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>UADDR</name>
              <description>DMA Transfer Start Address for U or UV Chrominance</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOUCTRL</name>
          <description>High-End Overlay U-UV DMA Control Register</description>
          <addressOffset>0x374</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>UDFETCH</name>
              <description>Transfer Descriptor Fetch Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UDMAIEN</name>
              <description>End of DMA Transfer Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UDSCRIEN</name>
              <description>Descriptor Loaded Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UADDIEN</name>
              <description>Add Head Descriptor to Queue Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UDONEIEN</name>
              <description>End of List Interrupt Enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOUHEAD</name>
          <description>High-End Overlay U-UV DMA Head Register</description>
          <addressOffset>0x36C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>UHEAD</name>
              <description>DMA Head Pointer</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOUNEXT</name>
          <description>High-End Overlay U-UV DMA Next Register</description>
          <addressOffset>0x378</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>UNEXT</name>
              <description>DMA Descriptor Next Address</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOVADDR</name>
          <description>High-End Overlay V DMA Address Register</description>
          <addressOffset>0x380</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VADDR</name>
              <description>DMA Transfer Start Address for V Chrominance</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOVCTRL</name>
          <description>High-End Overlay V DMA Control Register</description>
          <addressOffset>0x384</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VDFETCH</name>
              <description>Transfer Descriptor Fetch Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VDMAIEN</name>
              <description>End of DMA Transfer Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VDSCRIEN</name>
              <description>Descriptor Loaded Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VADDIEN</name>
              <description>Add Head Descriptor to Queue Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VDONEIEN</name>
              <description>End of List Interrupt Enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOVHEAD</name>
          <description>High-End Overlay V DMA Head Register</description>
          <addressOffset>0x37C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VHEAD</name>
              <description>DMA Head Pointer</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOVNEXT</name>
          <description>High-End Overlay V DMA Next Register</description>
          <addressOffset>0x388</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VNEXT</name>
              <description>DMA Descriptor Next Address</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDCFG0</name>
          <description>LCD Controller Configuration Register 0</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CLKPOL</name>
              <description>LCD Controller Clock Polarity</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKSEL</name>
              <description>LCD Controller Clock Source Selection</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKPWMSEL</name>
              <description>LCD Controller PWM Clock Source Selection</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CGDISBASE</name>
              <description>Clock Gating Disable Control for the Base Layer</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CGDISOVR1</name>
              <description>Clock Gating Disable Control for the Overlay 1 Layer</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CGDISOVR2</name>
              <description>Clock Gating Disable Control for the Overlay 2 Layer</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CGDISHEO</name>
              <description>Clock Gating Disable Control for the High-End Overlay</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CGDISPP</name>
              <description>Clock Gating Disable Control for the Post Processing Layer</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKDIV</name>
              <description>LCD Controller Clock Divider</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDCFG1</name>
          <description>LCD Controller Configuration Register 1</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>HSPW</name>
              <description>Horizontal Synchronization Pulse Width</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1023</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>VSPW</name>
              <description>Vertical Synchronization Pulse Width</description>
              <bitRange>[25:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1023</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
