betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
        <register>
          <name>LCDCFG2</name>
          <description>LCD Controller Configuration Register 2</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VFPW</name>
              <description>Vertical Front Porch Width</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1023</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>VBPW</name>
              <description>Vertical Back Porch Width</description>
              <bitRange>[25:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1023</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDCFG3</name>
          <description>LCD Controller Configuration Register 3</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>HFPW</name>
              <description>Horizontal Front Porch Width</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1023</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>HBPW</name>
              <description>Horizontal Back Porch Width</description>
              <bitRange>[25:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1023</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDCFG4</name>
          <description>LCD Controller Configuration Register 4</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PPL</name>
              <description>Number of Pixels Per Line</description>
              <bitRange>[10:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>2047</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RPF</name>
              <description>Number of Active Row Per Frame</description>
              <bitRange>[26:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>2047</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDCFG5</name>
          <description>LCD Controller Configuration Register 5</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>HSPOL</name>
              <description>Horizontal Synchronization Pulse Polarity</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VSPOL</name>
              <description>Vertical Synchronization Pulse Polarity</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VSPDLYS</name>
              <description>Vertical Synchronization Pulse Start</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VSPDLYE</name>
              <description>Vertical Synchronization Pulse End</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DISPPOL</name>
              <description>Display Signal Polarity</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DITHER</name>
              <description>LCD Controller Dithering</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DISPDLY</name>
              <description>LCD Controller Display Power Signal Synchronization</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE</name>
              <description>LCD Controller Output Mode</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OUTPUT_12BPP</name>
                  <description>LCD Output mode is set to 12 bits per pixel</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTPUT_16BPP</name>
                  <description>LCD Output mode is set to 16 bits per pixel</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTPUT_18BPP</name>
                  <description>LCD Output mode is set to 18 bits per pixel</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTPUT_24BPP</name>
                  <description>LCD Output mode is set to 24 bits per pixel</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PP</name>
              <description>Post Processing Enable</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VSPSU</name>
              <description>LCD Controller Vertical synchronization Pulse Setup Configuration</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VSPHO</name>
              <description>LCD Controller Vertical synchronization Pulse Hold Configuration</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GUARDTIME</name>
              <description>LCD DISPLAY Guard Time</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDCFG6</name>
          <description>LCD Controller Configuration Register 6</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PWMPS</name>
              <description>PWM Clock Prescaler</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV_1</name>
                  <description>The counter advances at a rate of fCOUNTER = fPWM_SELECTED_CLOCK</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_2</name>
                  <description>The counter advances at a rate of fCOUNTER = fPWM_SELECTED_CLOCK/2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_4</name>
                  <description>The counter advances at a rate of fCOUNTER = fPWM_SELECTED_CLOCK/4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_8</name>
                  <description>The counter advances at a rate of fCOUNTER = fPWM_SELECTED_CLOCK/8</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_16</name>
                  <description>The counter advances at a rate of fCOUNTER = fPWM_SELECTED_CLOCK/16</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_32</name>
                  <description>The counter advances at a of rate fCOUNTER = fPWM_SELECTED_CLOCK/32</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_64</name>
                  <description>The counter advances at a of rate fCOUNTER = fPWM_SELECTED_CLOCK/64</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWMPOL</name>
              <description>LCD Controller PWM Signal Polarity</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PWMCVAL</name>
              <description>LCD Controller PWM Compare Value</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDDIS</name>
          <description>LCD Controller Disable Register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CLKDIS</name>
              <description>LCD Controller Pixel Clock Disable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNCDIS</name>
              <description>LCD Controller Horizontal and Vertical Synchronization Disable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DISPDIS</name>
              <description>LCD Controller DISP Signal Disable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PWMDIS</name>
              <description>LCD Controller Pulse Width Modulation Disable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKRST</name>
              <description>LCD Controller Clock Reset</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNCRST</name>
              <description>LCD Controller Horizontal and Vertical Synchronization Reset</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DISPRST</name>
              <description>LCD Controller DISP Signal Reset</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PWMRST</name>
              <description>LCD Controller PWM Reset</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDEN</name>
          <description>LCD Controller Enable Register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CLKEN</name>
              <description>LCD Controller Pixel Clock Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNCEN</name>
              <description>LCD Controller Horizontal and Vertical Synchronization Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DISPEN</name>
              <description>LCD Controller DISP Signal Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PWMEN</name>
              <description>LCD Controller Pulse Width Modulation Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDIDR</name>
          <description>LCD Controller Interrupt Disable Register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>SOFID</name>
              <description>Start of Frame Interrupt Disable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DISID</name>
              <description>LCD Disable Interrupt Disable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DISPID</name>
              <description>Powerup/Powerdown Sequence Terminated Interrupt Disable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FIFOERRID</name>
              <description>Output FIFO Error Interrupt Disable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BASEID</name>
              <description>Base Layer Interrupt Disable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OVR1ID</name>
              <description>Overlay 1 Interrupt Disable</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OVR2ID</name>
              <description>Overlay 2 Interrupt Disable</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HEOID</name>
              <description>High-End Overlay Interrupt Disable</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PPID</name>
              <description>Post Processing Interrupt Disable</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDIER</name>
          <description>LCD Controller Interrupt Enable Register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>SOFIE</name>
              <description>Start of Frame Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DISIE</name>
              <description>LCD Disable Interrupt Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DISPIE</name>
              <description>Powerup/Powerdown Sequence Terminated Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FIFOERRIE</name>
              <description>Output FIFO Error Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BASEIE</name>
              <description>Base Layer Interrupt Enable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OVR1IE</name>
              <description>Overlay 1 Interrupt Enable</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OVR2IE</name>
              <description>Overlay 2 Interrupt Enable</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HEOIE</name>
              <description>High-End Overlay Interrupt Enable</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PPIE</name>
              <description>Post Processing Interrupt Enable</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDIMR</name>
          <description>LCD Controller Interrupt Mask Register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>SOFIM</name>
              <description>Start of Frame Interrupt Mask</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DISIM</name>
              <description>LCD Disable Interrupt Mask</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DISPIM</name>
              <description>Powerup/Powerdown Sequence Terminated Interrupt Mask</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FIFOERRIM</name>
              <description>Output FIFO Error Interrupt Mask</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BASEIM</name>
              <description>Base Layer Interrupt Mask</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OVR1IM</name>
              <description>Overlay 1 Interrupt Mask</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OVR2IM</name>
              <description>Overlay 2 Interrupt Mask</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HEOIM</name>
              <description>High-End Overlay Interrupt Mask</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PPIM</name>
              <description>Post Processing Interrupt Mask</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
