betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
        <register>
          <name>LCDISR</name>
          <description>LCD Controller Interrupt Status Register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>SOF</name>
              <description>Start of Frame Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DIS</name>
              <description>LCD Disable Interrupt Status</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DISP</name>
              <description>Powerup/Powerdown Sequence Terminated Interrupt Status</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FIFOERR</name>
              <description>Output FIFO Error</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BASE</name>
              <description>Base Layer Raw Interrupt Status</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OVR1</name>
              <description>Overlay 1 Raw Interrupt Status</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OVR2</name>
              <description>Overlay 2 Raw Interrupt Status</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HEO</name>
              <description>High-End Overlay Raw Interrupt Status</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PP</name>
              <description>Post Processing Raw Interrupt Status</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDSR</name>
          <description>LCD Controller Status Register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>CLKSTS</name>
              <description>Clock Status</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDSTS</name>
              <description>LCD Controller Synchronization status</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DISPSTS</name>
              <description>LCD Controller DISP Signal Status</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PWMSTS</name>
              <description>LCD Controller PWM Signal Status</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SIPSTS</name>
              <description>Synchronization In Progress</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OVR1ADDR</name>
          <description>Overlay 1 DMA Address Register</description>
          <addressOffset>0x160</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADDR</name>
              <description>DMA Transfer Overlay 1 Address</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>OVR1CFG0</name>
          <description>Overlay 1 Configuration Register 0</description>
          <addressOffset>0x16C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SIF</name>
              <description>Source Interface</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BLEN</name>
              <description>AHB Burst Length</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AHB_BLEN_SINGLE</name>
                  <description>AHB Access is started as soon as there is enough space in the FIFO to store one data. SINGLE, INCR, INCR4, INCR8 and INCR16 bursts are used. INCR is used for a burst of 2 and 3 beats.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AHB_BLEN_INCR4</name>
                  <description>AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 4 data. An AHB INCR4 Burst is used. SINGLE, INCR and INCR4 bursts are used. INCR is used for a burst of 2 and 3 beats.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AHB_BLEN_INCR8</name>
                  <description>AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 8 data. An AHB INCR8 Burst is used. SINGLE, INCR, INCR4 and INCR8 bursts are used. INCR is used for a burst of 2 and 3 beats.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AHB_BLEN_INCR16</name>
                  <description>AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 16 data. An AHB INCR16 Burst is used. SINGLE, INCR, INCR4, INCR8 and INCR16 bursts are used. INCR is used for a burst of 2 and 3 beats.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DLBO</name>
              <description>Defined Length Burst Only for Channel Bus Transaction</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ROTDIS</name>
              <description>Hardware Rotation Optimization Disable</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCKDIS</name>
              <description>Hardware Rotation Lock Disable</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OVR1CFG1</name>
          <description>Overlay 1 Configuration Register 1</description>
          <addressOffset>0x170</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CLUTEN</name>
              <description>Color Lookup Table Mode Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RGBMODE</name>
              <description>RGB Mode Input Selection</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_12BPP_RGB_444</name>
                  <description>12 bpp RGB 444</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16BPP_ARGB_4444</name>
                  <description>16 bpp ARGB 4444</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16BPP_RGBA_4444</name>
                  <description>16 bpp RGBA 4444</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16BPP_RGB_565</name>
                  <description>16 bpp RGB 565</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16BPP_TRGB_1555</name>
                  <description>16 bpp TRGB 1555</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_18BPP_RGB_666</name>
                  <description>18 bpp RGB 666</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_18BPP_RGB_666PACKED</name>
                  <description>18 bpp RGB 666 PACKED</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_19BPP_TRGB_1666</name>
                  <description>19 bpp TRGB 1666</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_19BPP_TRGB_PACKED</name>
                  <description>19 bpp TRGB 1666 PACKED</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_24BPP_RGB_888</name>
                  <description>24 bpp RGB 888</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_24BPP_RGB_888_PACKED</name>
                  <description>24 bpp RGB 888 PACKED</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_25BPP_TRGB_1888</name>
                  <description>25 bpp TRGB 1888</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_32BPP_ARGB_8888</name>
                  <description>32 bpp ARGB 8888</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_32BPP_RGBA_8888</name>
                  <description>32 bpp RGBA 8888</description>
                  <value>13</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLUTMODE</name>
              <description>Color Lookup Table Mode Input Selection</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLUT_1BPP</name>
                  <description>Color Lookup Table mode set to 1 bit per pixel</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLUT_2BPP</name>
                  <description>Color Lookup Table mode set to 2 bits per pixel</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLUT_4BPP</name>
                  <description>Color Lookup Table mode set to 4 bits per pixel</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLUT_8BPP</name>
                  <description>Color Lookup Table mode set to 8 bits per pixel</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OVR1CFG2</name>
          <description>Overlay 1 Configuration Register 2</description>
          <addressOffset>0x174</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>XPOS</name>
              <description>Horizontal Window Position</description>
              <bitRange>[10:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>2047</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>YPOS</name>
              <description>Vertical Window Position</description>
              <bitRange>[26:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>2047</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>OVR1CFG3</name>
          <description>Overlay 1 Configuration Register 3</description>
          <addressOffset>0x178</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>XSIZE</name>
              <description>Horizontal Window Size</description>
              <bitRange>[10:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>2047</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>YSIZE</name>
              <description>Vertical Window Size</description>
              <bitRange>[26:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>2047</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>OVR1CFG4</name>
          <description>Overlay 1 Configuration Register 4</description>
          <addressOffset>0x17C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>XSTRIDE</name>
              <description>Horizontal Stride</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>OVR1CFG5</name>
          <description>Overlay 1 Configuration Register 5</description>
          <addressOffset>0x180</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PSTRIDE</name>
              <description>Pixel Stride</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>OVR1CFG6</name>
          <description>Overlay 1 Configuration Register 6</description>
          <addressOffset>0x184</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BDEF</name>
              <description>Blue Default</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>GDEF</name>
              <description>Green Default</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RDEF</name>
              <description>Red Default</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>OVR1CFG7</name>
          <description>Overlay 1 Configuration Register 7</description>
          <addressOffset>0x188</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BKEY</name>
              <description>Blue Color Component Chroma Key</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>GKEY</name>
              <description>Green Color Component Chroma Key</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RKEY</name>
              <description>Red Color Component Chroma Key</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>OVR1CFG8</name>
          <description>Overlay 1 Configuration Register 8</description>
          <addressOffset>0x18C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BMASK</name>
              <description>Blue Color Component Chroma Key Mask</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>GMASK</name>
              <description>Green Color Component Chroma Key Mask</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RMASK</name>
              <description>Red Color Component Chroma Key Mask</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
