betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
        <register>
          <name>OVR1CFG9</name>
          <description>Overlay 1 Configuration Register 9</description>
          <addressOffset>0x190</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CRKEY</name>
              <description>Blender Chroma Key Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INV</name>
              <description>Blender Inverted Blender Output Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ITER2BL</name>
              <description>Blender Iterated Color Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ITER</name>
              <description>Blender Use Iterated Color</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REVALPHA</name>
              <description>Blender Reverse Alpha</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GAEN</name>
              <description>Blender Global Alpha Enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LAEN</name>
              <description>Blender Local Alpha Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OVR</name>
              <description>Blender Overlay Layer Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA</name>
              <description>Blender DMA Layer Enable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REP</name>
              <description>Use Replication logic to expand RGB color to 24 bits</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DSTKEY</name>
              <description>Destination Chroma Keying</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GA</name>
              <description>Blender Global Alpha</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>OVR1CHDR</name>
          <description>Overlay 1 Channel Disable Register</description>
          <addressOffset>0x144</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CHDIS</name>
              <description>Channel Disable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHRST</name>
              <description>Channel Reset</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OVR1CHER</name>
          <description>Overlay 1 Channel Enable Register</description>
          <addressOffset>0x140</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CHEN</name>
              <description>Channel Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UPDATEEN</name>
              <description>Update Overlay Attributes Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>A2QEN</name>
              <description>Add To Queue Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OVR1CHSR</name>
          <description>Overlay 1 Channel Status Register</description>
          <addressOffset>0x148</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>CHSR</name>
              <description>Channel Status</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UPDATESR</name>
              <description>Update Overlay Attributes In Progress Status</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>A2QSR</name>
              <description>Add To Queue Status</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OVR1CLUT</name>
          <description>Overlay 1 CLUT Register</description>
          <addressOffset>0xA00</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BCLUT</name>
              <description>Blue Color Entry</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>GCLUT</name>
              <description>Green Color Entry</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RCLUT</name>
              <description>Red Color Entry</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ACLUT</name>
              <description>Alpha Color Entry</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>OVR1CTRL</name>
          <description>Overlay 1 DMA Control Register</description>
          <addressOffset>0x164</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DFETCH</name>
              <description>Transfer Descriptor Fetch Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LFETCH</name>
              <description>Lookup Table Fetch Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DMAIEN</name>
              <description>End of DMA Transfer Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DSCRIEN</name>
              <description>Descriptor Loaded Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDIEN</name>
              <description>Add Head Descriptor to Queue Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DONEIEN</name>
              <description>End of List Interrupt Enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OVR1HEAD</name>
          <description>Overlay 1 DMA Head Register</description>
          <addressOffset>0x15C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>HEAD</name>
              <description>DMA Head Pointer</description>
              <bitRange>[31:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1073741823</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>OVR1IDR</name>
          <description>Overlay 1 Interrupt Disable Register</description>
          <addressOffset>0x150</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>DMA</name>
              <description>End of DMA Transfer Interrupt Disable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DSCR</name>
              <description>Descriptor Loaded Interrupt Disable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADD</name>
              <description>Head Descriptor Loaded Interrupt Disable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DONE</name>
              <description>End of List Interrupt Disable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OVR</name>
              <description>Overflow Interrupt Disable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OVR1IER</name>
          <description>Overlay 1 Interrupt Enable Register</description>
          <addressOffset>0x14C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>DMA</name>
              <description>End of DMA Transfer Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DSCR</name>
              <description>Descriptor Loaded Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADD</name>
              <description>Head Descriptor Loaded Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DONE</name>
              <description>End of List Interrupt Enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OVR</name>
              <description>Overflow Interrupt Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OVR1IMR</name>
          <description>Overlay 1 Interrupt Mask Register</description>
          <addressOffset>0x154</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>DMA</name>
              <description>End of DMA Transfer Interrupt Mask</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DSCR</name>
              <description>Descriptor Loaded Interrupt Mask</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADD</name>
              <description>Head Descriptor Loaded Interrupt Mask</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DONE</name>
              <description>End of List Interrupt Mask</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OVR</name>
              <description>Overflow Interrupt Mask</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OVR1ISR</name>
          <description>Overlay 1 Interrupt Status Register</description>
          <addressOffset>0x158</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>DMA</name>
              <description>End of DMA Transfer</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DSCR</name>
              <description>DMA Descriptor Loaded</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADD</name>
              <description>Head Descriptor Loaded</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DONE</name>
              <description>End of List Detected</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OVR</name>
              <description>Overflow Detected</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OVR1NEXT</name>
          <description>Overlay 1 DMA Next Register</description>
          <addressOffset>0x168</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>NEXT</name>
              <description>DMA Descriptor Next Address</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>OVR2ADDR</name>
          <description>Overlay 2 DMA Address Register</description>
          <addressOffset>0x260</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADDR</name>
              <description>DMA Transfer Overlay 2 Address</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>OVR2CFG0</name>
          <description>Overlay 2 Configuration Register 0</description>
          <addressOffset>0x26C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BLEN</name>
              <description>AHB Burst Length</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AHB_SINGLE</name>
                  <description>AHB Access is started as soon as there is enough space in the FIFO to store one data. SINGLE, INCR, INCR4, INCR8 and INCR16 bursts are used. INCR is used for a burst of 2 and 3 beats.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AHB_INCR4</name>
                  <description>AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 4 data. An AHB INCR4 Burst is used. SINGLE, INCR and INCR4 bursts are used. INCR is used for a burst of 2 and 3 beats.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AHB_INCR8</name>
                  <description>AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 8 data. An AHB INCR8 Burst is used. SINGLE, INCR, INCR4 and INCR8 bursts are used. INCR is used for a burst of 2 and 3 beats.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AHB_INCR16</name>
                  <description>AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 16 data. An AHB INCR16 Burst is used. SINGLE, INCR, INCR4, INCR8 and INCR16 bursts are used. INCR is used for a burst of 2 and 3 beats.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DLBO</name>
              <description>Defined Length Burst Only For Channel Bus Transaction</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ROTDIS</name>
              <description>Hardware Rotation Optimization Disable</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCKDIS</name>
              <description>Hardware Rotation Lock Disable</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
