betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
        <register>
          <name>OVR2CFG1</name>
          <description>Overlay 2 Configuration Register 1</description>
          <addressOffset>0x270</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CLUTEN</name>
              <description>Color Lookup Table Mode Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RGBMODE</name>
              <description>RGB Mode Input Selection</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_12BPP_RGB_444</name>
                  <description>12 bpp RGB 444</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16BPP_ARGB_4444</name>
                  <description>16 bpp ARGB 4444</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16BPP_RGBA_4444</name>
                  <description>16 bpp RGBA 4444</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16BPP_RGB_565</name>
                  <description>16 bpp RGB 565</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16BPP_TRGB_1555</name>
                  <description>16 bpp TRGB 1555</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_18BPP_RGB_666</name>
                  <description>18 bpp RGB 666</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_18BPP_RGB_666PACKED</name>
                  <description>18 bpp RGB 666 PACKED</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_19BPP_TRGB_1666</name>
                  <description>19 bpp TRGB 1666</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_19BPP_TRGB_PACKED</name>
                  <description>19 bpp TRGB 1666 PACKED</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_24BPP_RGB_888</name>
                  <description>24 bpp RGB 888</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_24BPP_RGB_888_PACKED</name>
                  <description>24 bpp RGB 888 PACKED</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_25BPP_TRGB_1888</name>
                  <description>25 bpp TRGB 1888</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_32BPP_ARGB_8888</name>
                  <description>32 bpp ARGB 8888</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_32BPP_RGBA_8888</name>
                  <description>32 bpp RGBA 8888</description>
                  <value>13</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLUTMODE</name>
              <description>Color Lookup Table Mode Input Selection</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLUT_1BPP</name>
                  <description>Color Lookup Table mode set to 1 bit per pixel</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLUT_2BPP</name>
                  <description>Color Lookup Table mode set to 2 bits per pixel</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLUT_4BPP</name>
                  <description>Color Lookup Table mode set to 4 bits per pixel</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLUT_8BPP</name>
                  <description>Color Lookup Table mode set to 8 bits per pixel</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OVR2CFG2</name>
          <description>Overlay 2 Configuration Register 2</description>
          <addressOffset>0x274</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>XPOS</name>
              <description>Horizontal Window Position</description>
              <bitRange>[10:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>2047</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>YPOS</name>
              <description>Vertical Window Position</description>
              <bitRange>[26:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>2047</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>OVR2CFG3</name>
          <description>Overlay 2 Configuration Register 3</description>
          <addressOffset>0x278</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>XSIZE</name>
              <description>Horizontal Window Size</description>
              <bitRange>[10:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>2047</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>YSIZE</name>
              <description>Vertical Window Size</description>
              <bitRange>[26:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>2047</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>OVR2CFG4</name>
          <description>Overlay 2 Configuration Register 4</description>
          <addressOffset>0x27C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>XSTRIDE</name>
              <description>Horizontal Stride</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>OVR2CFG5</name>
          <description>Overlay 2 Configuration Register 5</description>
          <addressOffset>0x280</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PSTRIDE</name>
              <description>Pixel Stride</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>OVR2CFG6</name>
          <description>Overlay 2 Configuration Register 6</description>
          <addressOffset>0x284</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BDEF</name>
              <description>Blue Default</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>GDEF</name>
              <description>Green Default</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RDEF</name>
              <description>Red Default</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>OVR2CFG7</name>
          <description>Overlay 2 Configuration Register 7</description>
          <addressOffset>0x288</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BKEY</name>
              <description>Blue Color Component Chroma Key</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>GKEY</name>
              <description>Green Color Component Chroma Key</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RKEY</name>
              <description>Red Color Component Chroma Key</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>OVR2CFG8</name>
          <description>Overlay 2 Configuration Register 8</description>
          <addressOffset>0x28C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BMASK</name>
              <description>Blue Color Component Chroma Key Mask</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>GMASK</name>
              <description>Green Color Component Chroma Key Mask</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RMASK</name>
              <description>Red Color Component Chroma Key Mask</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>OVR2CFG9</name>
          <description>Overlay 2 Configuration Register 9</description>
          <addressOffset>0x290</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CRKEY</name>
              <description>Blender Chroma Key Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INV</name>
              <description>Blender Inverted Blender Output Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ITER2BL</name>
              <description>Blender Iterated Color Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ITER</name>
              <description>Blender Use Iterated Color</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REVALPHA</name>
              <description>Blender Reverse Alpha</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GAEN</name>
              <description>Blender Global Alpha Enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LAEN</name>
              <description>Blender Local Alpha Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OVR</name>
              <description>Blender Overlay Layer Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA</name>
              <description>Blender DMA Layer Enable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REP</name>
              <description>Use Replication logic to expand RGB color to 24 bits</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DSTKEY</name>
              <description>Destination Chroma Keying</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GA</name>
              <description>Blender Global Alpha</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>OVR2CHDR</name>
          <description>Overlay 2 Channel Disable Register</description>
          <addressOffset>0x244</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CHDIS</name>
              <description>Channel Disable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHRST</name>
              <description>Channel Reset</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OVR2CHER</name>
          <description>Overlay 2 Channel Enable Register</description>
          <addressOffset>0x240</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CHEN</name>
              <description>Channel Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UPDATEEN</name>
              <description>Update Overlay Attributes Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>A2QEN</name>
              <description>Add To Queue Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OVR2CHSR</name>
          <description>Overlay 2 Channel Status Register</description>
          <addressOffset>0x248</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>CHSR</name>
              <description>Channel Status</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UPDATESR</name>
              <description>Update Overlay Attributes In Progress Status</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>A2QSR</name>
              <description>Add To Queue Status</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OVR2CLUT</name>
          <description>Overlay 2 CLUT Register</description>
          <addressOffset>0xE00</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BCLUT</name>
              <description>Blue Color Entry</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>GCLUT</name>
              <description>Green Color Entry</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RCLUT</name>
              <description>Red Color Entry</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ACLUT</name>
              <description>Alpha Color Entry</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>OVR2CTRL</name>
          <description>Overlay 2 DMA Control Register</description>
          <addressOffset>0x264</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DFETCH</name>
              <description>Transfer Descriptor Fetch Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LFETCH</name>
              <description>Lookup Table Fetch Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DMAIEN</name>
              <description>End of DMA Transfer Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DSCRIEN</name>
              <description>Descriptor Loaded Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDIEN</name>
              <description>Add Head Descriptor to Queue Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DONEIEN</name>
              <description>End of List Interrupt Enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OVR2HEAD</name>
          <description>Overlay 2 DMA Head Register</description>
          <addressOffset>0x25C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>HEAD</name>
              <description>DMA Head Pointer</description>
              <bitRange>[31:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1073741823</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
