betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
        <register>
          <name>OVR2IDR</name>
          <description>Overlay 2 Interrupt Disable Register</description>
          <addressOffset>0x250</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>DMA</name>
              <description>End of DMA Transfer Interrupt Disable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DSCR</name>
              <description>Descriptor Loaded Interrupt Disable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADD</name>
              <description>Head Descriptor Loaded Interrupt Disable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DONE</name>
              <description>End of List Interrupt Disable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OVR</name>
              <description>Overflow Interrupt Disable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OVR2IER</name>
          <description>Overlay 2 Interrupt Enable Register</description>
          <addressOffset>0x24C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>DMA</name>
              <description>End of DMA Transfer Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DSCR</name>
              <description>Descriptor Loaded Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADD</name>
              <description>Head Descriptor Loaded Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DONE</name>
              <description>End of List Interrupt Enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OVR</name>
              <description>Overflow Interrupt Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OVR2IMR</name>
          <description>Overlay 2 Interrupt Mask Register</description>
          <addressOffset>0x254</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>DMA</name>
              <description>End of DMA Transfer Interrupt Mask</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DSCR</name>
              <description>Descriptor Loaded Interrupt Mask</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADD</name>
              <description>Head Descriptor Loaded Interrupt Mask</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DONE</name>
              <description>End of List Interrupt Mask</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OVR</name>
              <description>Overflow Interrupt Mask</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OVR2ISR</name>
          <description>Overlay 2 Interrupt Status Register</description>
          <addressOffset>0x258</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>DMA</name>
              <description>End of DMA Transfer</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DSCR</name>
              <description>DMA Descriptor Loaded</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADD</name>
              <description>Head Descriptor Loaded</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DONE</name>
              <description>End of List Detected</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OVR</name>
              <description>Overflow Detected</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OVR2NEXT</name>
          <description>Overlay 2 DMA Next Register</description>
          <addressOffset>0x268</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>NEXT</name>
              <description>DMA Descriptor Next Address</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PPADDR</name>
          <description>Post Processing Address Register</description>
          <addressOffset>0x560</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADDR</name>
              <description>DMA Transfer Start Address</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PPCFG0</name>
          <description>Post Processing Configuration Register 0</description>
          <addressOffset>0x56C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SIF</name>
              <description>Source Interface</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BLEN</name>
              <description>AHB Burst Length</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DLBO</name>
              <description>Defined Length Burst Only For Channel Bus Transaction</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PPCFG1</name>
          <description>Post Processing Configuration Register 1</description>
          <addressOffset>0x570</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PPMODE</name>
              <description>Post Processing Output Format Selection</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PPMODE_RGB_16BPP</name>
                  <description>RGB 16 bpp</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PPMODE_RGB_24BPP_PACKED</name>
                  <description>RGB 24 bpp PACKED</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PPMODE_RGB_24BPP_UNPACKED</name>
                  <description>RGB 24 bpp UNPACKED</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PPMODE_YCBCR_422_MODE0</name>
                  <description>YCbCr 422 16 bpp (Mode 0)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PPMODE_YCBCR_422_MODE1</name>
                  <description>YCbCr 422 16 bpp (Mode 1)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PPMODE_YCBCR_422_MODE2</name>
                  <description>YCbCr 422 16 bpp (Mode 2)</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PPMODE_YCBCR_422_MODE3</name>
                  <description>YCbCr 422 16 bpp (Mode 3)</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ITUBT601</name>
              <description>Color Space Conversion Luminance</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PPCFG2</name>
          <description>Post Processing Configuration Register 2</description>
          <addressOffset>0x574</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>XSTRIDE</name>
              <description>Horizontal Stride</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PPCFG3</name>
          <description>Post Processing Configuration Register 3</description>
          <addressOffset>0x578</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CSCYR</name>
              <description>Color Space Conversion R coefficient for Luminance component, signed format, step set to 1/1024</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1023</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CSCYG</name>
              <description>Color Space Conversion G coefficient for Luminance component, signed format, step set to 1/512</description>
              <bitRange>[19:10]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1023</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CSCYB</name>
              <description>Color Space Conversion B coefficient for Luminance component, signed format, step set to 1/1024</description>
              <bitRange>[29:20]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1023</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CSCYOFF</name>
              <description>Color Space Conversion Luminance Offset</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PPCFG4</name>
          <description>Post Processing Configuration Register 4</description>
          <addressOffset>0x57C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CSCUR</name>
              <description>Color Space Conversion R coefficient for Chrominance B component, signed format. (step 1/1024)</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1023</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CSCUG</name>
              <description>Color Space Conversion G coefficient for Chrominance B component, signed format. (step 1/512)</description>
              <bitRange>[19:10]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1023</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CSCUB</name>
              <description>Color Space Conversion B coefficient for Chrominance B component, signed format. (step 1/512)</description>
              <bitRange>[29:20]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1023</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CSCUOFF</name>
              <description>Color Space Conversion Chrominance B Offset</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PPCFG5</name>
          <description>Post Processing Configuration Register 5</description>
          <addressOffset>0x580</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CSCVR</name>
              <description>Color Space Conversion R coefficient for Chrominance R component, signed format. (step 1/1024)</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1023</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CSCVG</name>
              <description>Color Space Conversion G coefficient for Chrominance R component, signed format. (step 1/512)</description>
              <bitRange>[19:10]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1023</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CSCVB</name>
              <description>Color Space Conversion B coefficient for Chrominance R component, signed format. (step 1/1024)</description>
              <bitRange>[29:20]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1023</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CSCVOFF</name>
              <description>Color Space Conversion Chrominance R Offset</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PPCHDR</name>
          <description>Post Processing Channel Disable Register</description>
          <addressOffset>0x544</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CHDIS</name>
              <description>Channel Disable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHRST</name>
              <description>Channel Reset</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PPCHER</name>
          <description>Post Processing Channel Enable Register</description>
          <addressOffset>0x540</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CHEN</name>
              <description>Channel Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UPDATEEN</name>
              <description>Update Overlay Attributes Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>A2QEN</name>
              <description>Add To Queue Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PPCHSR</name>
          <description>Post Processing Channel Status Register</description>
          <addressOffset>0x548</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>CHSR</name>
              <description>Channel Status</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UPDATESR</name>
              <description>Update Overlay Attributes In Progress Status</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>A2QSR</name>
              <description>Add To Queue Status</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PPCTRL</name>
          <description>Post Processing Control Register</description>
          <addressOffset>0x564</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DFETCH</name>
              <description>Transfer Descriptor Fetch Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DMAIEN</name>
              <description>End of DMA Transfer Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DSCRIEN</name>
              <description>Descriptor Loaded Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDIEN</name>
              <description>Add Head Descriptor to Queue Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DONEIEN</name>
              <description>End of List Interrupt Enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PPHEAD</name>
          <description>Post Processing Head Register</description>
          <addressOffset>0x55C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>HEAD</name>
              <description>DMA Head Pointer</description>
              <bitRange>[31:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1073741823</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PPIDR</name>
          <description>Post Processing Interrupt Disable Register</description>
          <addressOffset>0x550</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>DMA</name>
              <description>End of DMA Transfer Interrupt Disable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DSCR</name>
              <description>Descriptor Loaded Interrupt Disable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADD</name>
              <description>Head Descriptor Loaded Interrupt Disable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DONE</name>
              <description>End of List Interrupt Disable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
