betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
        <register>
          <name>SSR</name>
          <description>Security Slave 0 Register</description>
          <addressOffset>0x200</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LANSECH0</name>
              <description>Low Area Non-secured in HSELx Security Region</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LANSECH1</name>
              <description>Low Area Non-secured in HSELx Security Region</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LANSECH2</name>
              <description>Low Area Non-secured in HSELx Security Region</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LANSECH3</name>
              <description>Low Area Non-secured in HSELx Security Region</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LANSECH4</name>
              <description>Low Area Non-secured in HSELx Security Region</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LANSECH5</name>
              <description>Low Area Non-secured in HSELx Security Region</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LANSECH6</name>
              <description>Low Area Non-secured in HSELx Security Region</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LANSECH7</name>
              <description>Low Area Non-secured in HSELx Security Region</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RDNSECH0</name>
              <description>Read Non-secured for HSELx Security Region</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RDNSECH1</name>
              <description>Read Non-secured for HSELx Security Region</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RDNSECH2</name>
              <description>Read Non-secured for HSELx Security Region</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RDNSECH3</name>
              <description>Read Non-secured for HSELx Security Region</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RDNSECH4</name>
              <description>Read Non-secured for HSELx Security Region</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RDNSECH5</name>
              <description>Read Non-secured for HSELx Security Region</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RDNSECH6</name>
              <description>Read Non-secured for HSELx Security Region</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RDNSECH7</name>
              <description>Read Non-secured for HSELx Security Region</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WRNSECH0</name>
              <description>Write Non-secured for HSELx Security Region</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WRNSECH1</name>
              <description>Write Non-secured for HSELx Security Region</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WRNSECH2</name>
              <description>Write Non-secured for HSELx Security Region</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WRNSECH3</name>
              <description>Write Non-secured for HSELx Security Region</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WRNSECH4</name>
              <description>Write Non-secured for HSELx Security Region</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WRNSECH5</name>
              <description>Write Non-secured for HSELx Security Region</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WRNSECH6</name>
              <description>Write Non-secured for HSELx Security Region</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WRNSECH7</name>
              <description>Write Non-secured for HSELx Security Region</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WPMR</name>
          <description>Write Protection Mode Register</description>
          <addressOffset>0x1E4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WPEN</name>
              <description>Write Protection Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WPKEY</name>
              <description>Write Protection Key (Write-only)</description>
              <bitRange>[31:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PASSWD</name>
                  <description>Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0.</description>
                  <value>5062996</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WPSR</name>
          <description>Write Protection Status Register</description>
          <addressOffset>0x1E8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>WPVS</name>
              <description>Write Protection Violation Status</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WPVSRC</name>
              <description>Write Protection Violation Source</description>
              <bitRange>[23:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
