betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="MATRIX0">
      <name>MATRIX1</name>
      <description>AHB Bus Matrix</description>
      <baseAddress>0xFC03C000</baseAddress>
    </peripheral>
    <peripheral>
      <name>MCAN0</name>
      <description>Controller Area Network</description>
      <baseAddress>0xF8054000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x30</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x40</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x50</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x80</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x90</offset>
        <size>0x58</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xF0</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CCCR</name>
          <description>CC Control Register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INIT</name>
              <description>Initialization (read/write)</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Initialization is started.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCE</name>
              <description>Configuration Change Enable (read/write, write protection)</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PROTECTED</name>
                  <description>The processor has no write access to the protected configuration registers.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONFIGURABLE</name>
                  <description>The processor has write access to the protected configuration registers (while MCAN_CCCR.INIT = '1').</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ASM</name>
              <description>Restricted Operation Mode (read/write, write protection against '1')</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Normal CAN operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESTRICTED</name>
                  <description>Restricted Operation mode active.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CSA</name>
              <description>Clock Stop Acknowledge (read-only)</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CSR</name>
              <description>Clock Stop Request (read/write)</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_CLOCK_STOP</name>
                  <description>No clock stop is requested.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLOCK_STOP</name>
                  <description>Clock stop requested. When clock stop is requested, first INIT and then CSA will be set after all pend-ing transfer requests have been completed and the CAN bus reached idle.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MON</name>
              <description>Bus Monitoring Mode (read/write, write protection against '1')</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Bus Monitoring mode is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Bus Monitoring mode is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DAR</name>
              <description>Disable Automatic Retransmission (read/write, write protection)</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AUTO_RETX</name>
                  <description>Automatic retransmission of messages not transmitted successfully enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_AUTO_RETX</name>
                  <description>Automatic retransmission disabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TEST</name>
              <description>Test Mode Enable (read/write, write protection against '1')</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Normal operation, MCAN_TEST register holds reset values.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Test mode, write access to MCAN_TEST register enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FDOE</name>
              <description>CAN FD Operation Enable (read/write, write protection)</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>FD operation disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>FD operation enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BRSE</name>
              <description>Bit Rate Switching Enable (read/write, write protection)</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Bit rate switching for transmissions disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Bit rate switching for transmissions enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PXHD</name>
              <description>Protocol Exception Event Handling (read/write, write protection)</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EFBI</name>
              <description>Edge Filtering during Bus Integration (read/write, write protection)</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXP</name>
              <description>Transmit Pause (read/write, write protection)</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CREL</name>
          <description>Core Release Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>DAY</name>
              <description>Timestamp Day</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MON</name>
              <description>Timestamp Month</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>YEAR</name>
              <description>Timestamp Year</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SUBSTEP</name>
              <description>Sub-step of Core Release</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>STEP</name>
              <description>Step of Core Release</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>REL</name>
              <description>Core Release</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CUST</name>
          <description>Customer Register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CSV</name>
              <description>Customer-specific Value</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DBTP</name>
          <description>Data Bit Timing and Prescaler Register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DSJW</name>
              <description>Data (Re) Synchronization Jump Width</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DTSEG2</name>
              <description>Data Time Segment After Sample Point</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DTSEG1</name>
              <description>Data Time Segment Before Sample Point</description>
              <bitRange>[12:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DBRP</name>
              <description>Data Bit Rate Prescaler</description>
              <bitRange>[20:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TDC</name>
              <description>Transmitter Delay Compensation</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Transmitter Delay Compensation disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Transmitter Delay Compensation enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ECR</name>
          <description>Error Counter Register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>TEC</name>
              <description>Transmit Error Counter</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>REC</name>
              <description>Receive Error Counter</description>
              <bitRange>[14:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RP</name>
              <description>Receive Error Passive</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CEL</name>
              <description>CAN Error Logging (cleared on read)</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ENDN</name>
          <description>Endian Register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>ETV</name>
              <description>Endianness Test Value</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>GFC</name>
          <description>Global Filter Configuration Register</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RRFE</name>
              <description>Reject Remote Frames Extended</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FILTER</name>
                  <description>Filter remote frames with 29-bit extended IDs.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REJECT</name>
                  <description>Reject all remote frames with 29-bit extended IDs.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RRFS</name>
              <description>Reject Remote Frames Standard</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FILTER</name>
                  <description>Filter remote frames with 11-bit standard IDs.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REJECT</name>
                  <description>Reject all remote frames with 11-bit standard IDs.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ANFE</name>
              <description>Accept Non-matching Frames Extended</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RX_FIFO_0</name>
                  <description>Accept in Rx FIFO 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_FIFO_1</name>
                  <description>Accept in Rx FIFO 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ANFS</name>
              <description>Accept Non-matching Frames Standard</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RX_FIFO_0</name>
                  <description>Accept in Rx FIFO 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_FIFO_1</name>
                  <description>Accept in Rx FIFO 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
