betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
        <register>
          <name>PSR</name>
          <description>Protocol Status Register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>LEC</name>
              <description>Last Error Code (set to 111 on read)</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_ERROR</name>
                  <description>No error occurred since LEC has been reset by successful reception or transmission.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STUFF_ERROR</name>
                  <description>More than 5 equal bits in a sequence have occurred in a part of a received message where this is not allowed.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FORM_ERROR</name>
                  <description>A fixed format part of a received frame has the wrong format.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACK_ERROR</name>
                  <description>The message transmitted by the MCAN was not acknowledged by another node.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIT1_ERROR</name>
                  <description>During transmission of a message (with the exception of the arbitration field), the device tried to send a recessive level (bit of logical value '1'), but the monitored bus value was dominant.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIT0_ERROR</name>
                  <description>During transmission of a message (or acknowledge bit, or active error flag, or overload flag), the device tried to send a dominant level (data or identifier bit logical value '0'), but the monitored bus value was recessive. During Bus_Off recovery, this status is set each time a sequence of 11 recessive bits has been monitored. This enables the processor to monitor the proceeding of the Bus_Off recovery sequence (indicating the bus is not stuck at dominant or continuously disturbed).</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_ERROR</name>
                  <description>The CRC check sum of a received message was incorrect. The CRC of an incoming message does not match the CRC calculated from the received data.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_CHANGE</name>
                  <description>Any read access to the Protocol Status Register re-initializes the LEC to '7'. When the LEC shows value '7', no CAN bus event was detected since the last processor read access to the Protocol Status Register.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACT</name>
              <description>Activity</description>
              <bitRange>[4:3]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYNCHRONIZING</name>
                  <description>Node is synchronizing on CAN communication</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDLE</name>
                  <description>Node is neither receiver nor transmitter</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RECEIVER</name>
                  <description>Node is operating as receiver</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRANSMITTER</name>
                  <description>Node is operating as transmitter</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EP</name>
              <description>Error Passive</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EW</name>
              <description>Warning Status</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BO</name>
              <description>Bus_Off Status</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DLEC</name>
              <description>Data Phase Last Error Code (set to 111 on read)</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RESI</name>
              <description>ESI Flag of Last Received CAN FD Message (cleared on read)</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RBRS</name>
              <description>BRS Flag of Last Received CAN FD Message (cleared on read)</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RFDF</name>
              <description>Received a CAN FD Message (cleared on read)</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PXE</name>
              <description>Protocol Exception Event (cleared on read)</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TDCV</name>
              <description>Transmitter Delay Compensation Value</description>
              <bitRange>[22:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RWD</name>
          <description>RAM Watchdog Register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WDC</name>
              <description>Watchdog Configuration (read/write)</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>WDV</name>
              <description>Watchdog Value (read-only)</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RXBC</name>
          <description>Receive Rx Buffer Configuration Register</description>
          <addressOffset>0xAC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RBSA</name>
              <description>Receive Buffer Start Address</description>
              <bitRange>[15:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>16383</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RXESC</name>
          <description>Receive Buffer / FIFO Element Size Configuration Register</description>
          <addressOffset>0xBC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>F0DS</name>
              <description>Receive FIFO 0 Data Field Size</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_8_BYTE</name>
                  <description>8-byte data field</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_12_BYTE</name>
                  <description>12-byte data field</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16_BYTE</name>
                  <description>16-byte data field</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_20_BYTE</name>
                  <description>20-byte data field</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_24_BYTE</name>
                  <description>24-byte data field</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_32_BYTE</name>
                  <description>32-byte data field</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_48_BYTE</name>
                  <description>48-byte data field</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_64_BYTE</name>
                  <description>64-byte data field</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>F1DS</name>
              <description>Receive FIFO 1 Data Field Size</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_8_BYTE</name>
                  <description>8-byte data field</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_12_BYTE</name>
                  <description>12-byte data field</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16_BYTE</name>
                  <description>16-byte data field</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_20_BYTE</name>
                  <description>20-byte data field</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_24_BYTE</name>
                  <description>24-byte data field</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_32_BYTE</name>
                  <description>32-byte data field</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_48_BYTE</name>
                  <description>48-byte data field</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_64_BYTE</name>
                  <description>64-byte data field</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RBDS</name>
              <description>Receive Buffer Data Field Size</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_8_BYTE</name>
                  <description>8-byte data field</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_12_BYTE</name>
                  <description>12-byte data field</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16_BYTE</name>
                  <description>16-byte data field</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_20_BYTE</name>
                  <description>20-byte data field</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_24_BYTE</name>
                  <description>24-byte data field</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_32_BYTE</name>
                  <description>32-byte data field</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_48_BYTE</name>
                  <description>48-byte data field</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_64_BYTE</name>
                  <description>64-byte data field</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RXF0A</name>
          <description>Receive FIFO 0 Acknowledge Register</description>
          <addressOffset>0xA8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>F0AI</name>
              <description>Receive FIFO 0 Acknowledge Index</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RXF0C</name>
          <description>Receive FIFO 0 Configuration Register</description>
          <addressOffset>0xA0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>F0SA</name>
              <description>Receive FIFO 0 Start Address</description>
              <bitRange>[15:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>16383</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>F0S</name>
              <description>Receive FIFO 0 Start Address</description>
              <bitRange>[22:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>F0WM</name>
              <description>Receive FIFO 0 Watermark</description>
              <bitRange>[30:24]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>F0OM</name>
              <description>FIFO 0 Operation Mode</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXF0S</name>
          <description>Receive FIFO 0 Status Register</description>
          <addressOffset>0xA4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>F0FL</name>
              <description>Receive FIFO 0 Fill Level</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>F0GI</name>
              <description>Receive FIFO 0 Get Index</description>
              <bitRange>[13:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>F0PI</name>
              <description>Receive FIFO 0 Put Index</description>
              <bitRange>[21:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>F0F</name>
              <description>Receive FIFO 0 Fill Level</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RF0L</name>
              <description>Receive FIFO 0 Message Lost</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXF1A</name>
          <description>Receive FIFO 1 Acknowledge Register</description>
          <addressOffset>0xB8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>F1AI</name>
              <description>Receive FIFO 1 Acknowledge Index</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RXF1C</name>
          <description>Receive FIFO 1 Configuration Register</description>
          <addressOffset>0xB0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>F1SA</name>
              <description>Receive FIFO 1 Start Address</description>
              <bitRange>[15:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>16383</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>F1S</name>
              <description>Receive FIFO 1 Start Address</description>
              <bitRange>[22:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>F1WM</name>
              <description>Receive FIFO 1 Watermark</description>
              <bitRange>[30:24]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>F1OM</name>
              <description>FIFO 1 Operation Mode</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
