betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
        <register>
          <name>RXF1S</name>
          <description>Receive FIFO 1 Status Register</description>
          <addressOffset>0xB4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>F1FL</name>
              <description>Receive FIFO 1 Fill Level</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>F1GI</name>
              <description>Receive FIFO 1 Get Index</description>
              <bitRange>[13:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>F1PI</name>
              <description>Receive FIFO 1 Put Index</description>
              <bitRange>[21:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>F1F</name>
              <description>Receive FIFO 1 Fill Level</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RF1L</name>
              <description>Receive FIFO 1 Message Lost</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DMS</name>
              <description>Debug Message Status</description>
              <bitRange>[31:30]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE</name>
                  <description>Idle state, wait for reception of debug messages, DMA request is cleared.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSG_A</name>
                  <description>Debug message A received.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSG_AB</name>
                  <description>Debug messages A, B received.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSG_ABC</name>
                  <description>Debug messages A, B, C received, DMA request is set.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SIDFC</name>
          <description>Standard ID Filter Configuration Register</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FLSSA</name>
              <description>Filter List Standard Start Address</description>
              <bitRange>[15:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>16383</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>LSS</name>
              <description>List Size Standard</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TDCR</name>
          <description>Transmit Delay Compensation Register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TDCF</name>
              <description>Transmitter Delay Compensation Filter</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TDCO</name>
              <description>Transmitter Delay Compensation Offset</description>
              <bitRange>[14:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TEST</name>
          <description>Test Register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LBCK</name>
              <description>Loop Back Mode (read/write)</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Reset value. Loop Back mode is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Loop Back mode is enabled (see Section 6.1.9).</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX</name>
              <description>Control of Transmit Pin (read/write)</description>
              <bitRange>[6:5]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RESET</name>
                  <description>Reset value, CANTX controlled by the CAN Core, updated at the end of the CAN bit time.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_POINT_MONITORING</name>
                  <description>Sample Point can be monitored at pin CANTX.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DOMINANT</name>
                  <description>Dominant ('0') level at pin CANTX.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RECESSIVE</name>
                  <description>Recessive ('1') at pin CANTX.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX</name>
              <description>Receive Pin (read-only)</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TOCC</name>
          <description>Timeout Counter Configuration Register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ETOC</name>
              <description>Enable Timeout Counter</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_TIMEOUT</name>
                  <description>Timeout Counter disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOS_CONTROLLED</name>
                  <description>Timeout Counter enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TOS</name>
              <description>Timeout Select</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CONTINUOUS</name>
                  <description>Continuous operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX_EV_TIMEOUT</name>
                  <description>Timeout controlled by Tx Event FIFO</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX0_EV_TIMEOUT</name>
                  <description>Timeout controlled by Receive FIFO 0</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX1_EV_TIMEOUT</name>
                  <description>Timeout controlled by Receive FIFO 1</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TOP</name>
              <description>Timeout Period</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TOCV</name>
          <description>Timeout Counter Value Register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TOC</name>
              <description>Timeout Counter (cleared on write)</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TSCC</name>
          <description>Timestamp Counter Configuration Register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TSS</name>
              <description>Timestamp Select</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALWAYS_0</name>
                  <description>Timestamp counter value always 0x0000</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCP_INC</name>
                  <description>Timestamp counter value incremented according to TCP</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT_TIMESTAMP</name>
                  <description>External timestamp counter value used</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TCP</name>
              <description>Timestamp Counter Prescaler</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TSCV</name>
          <description>Timestamp Counter Value Register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TSC</name>
              <description>Timestamp Counter (cleared on write)</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TXBAR</name>
          <description>Transmit Buffer Add Request Register</description>
          <addressOffset>0xD0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>AR0</name>
              <description>Add Request for Transmit Buffer 0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AR1</name>
              <description>Add Request for Transmit Buffer 1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AR2</name>
              <description>Add Request for Transmit Buffer 2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AR3</name>
              <description>Add Request for Transmit Buffer 3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AR4</name>
              <description>Add Request for Transmit Buffer 4</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AR5</name>
              <description>Add Request for Transmit Buffer 5</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AR6</name>
              <description>Add Request for Transmit Buffer 6</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AR7</name>
              <description>Add Request for Transmit Buffer 7</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AR8</name>
              <description>Add Request for Transmit Buffer 8</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AR9</name>
              <description>Add Request for Transmit Buffer 9</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AR10</name>
              <description>Add Request for Transmit Buffer 10</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AR11</name>
              <description>Add Request for Transmit Buffer 11</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AR12</name>
              <description>Add Request for Transmit Buffer 12</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AR13</name>
              <description>Add Request for Transmit Buffer 13</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AR14</name>
              <description>Add Request for Transmit Buffer 14</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AR15</name>
              <description>Add Request for Transmit Buffer 15</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AR16</name>
              <description>Add Request for Transmit Buffer 16</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AR17</name>
              <description>Add Request for Transmit Buffer 17</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AR18</name>
              <description>Add Request for Transmit Buffer 18</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AR19</name>
              <description>Add Request for Transmit Buffer 19</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AR20</name>
              <description>Add Request for Transmit Buffer 20</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AR21</name>
              <description>Add Request for Transmit Buffer 21</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AR22</name>
              <description>Add Request for Transmit Buffer 22</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AR23</name>
              <description>Add Request for Transmit Buffer 23</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AR24</name>
              <description>Add Request for Transmit Buffer 24</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AR25</name>
              <description>Add Request for Transmit Buffer 25</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AR26</name>
              <description>Add Request for Transmit Buffer 26</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AR27</name>
              <description>Add Request for Transmit Buffer 27</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AR28</name>
              <description>Add Request for Transmit Buffer 28</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AR29</name>
              <description>Add Request for Transmit Buffer 29</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AR30</name>
              <description>Add Request for Transmit Buffer 30</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AR31</name>
              <description>Add Request for Transmit Buffer 31</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
