betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
        <register>
          <name>TXBC</name>
          <description>Transmit Buffer Configuration Register</description>
          <addressOffset>0xC0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TBSA</name>
              <description>Tx Buffers Start Address</description>
              <bitRange>[15:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>16383</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>NDTB</name>
              <description>Number of Dedicated Transmit Buffers</description>
              <bitRange>[21:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TFQS</name>
              <description>Transmit FIFO/Queue Size</description>
              <bitRange>[29:24]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TFQM</name>
              <description>Tx FIFO/Queue Mode</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXBCF</name>
          <description>Transmit Buffer Cancellation Finished Register</description>
          <addressOffset>0xDC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>CF0</name>
              <description>Cancellation Finished for Transmit Buffer 0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CF1</name>
              <description>Cancellation Finished for Transmit Buffer 1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CF2</name>
              <description>Cancellation Finished for Transmit Buffer 2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CF3</name>
              <description>Cancellation Finished for Transmit Buffer 3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CF4</name>
              <description>Cancellation Finished for Transmit Buffer 4</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CF5</name>
              <description>Cancellation Finished for Transmit Buffer 5</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CF6</name>
              <description>Cancellation Finished for Transmit Buffer 6</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CF7</name>
              <description>Cancellation Finished for Transmit Buffer 7</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CF8</name>
              <description>Cancellation Finished for Transmit Buffer 8</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CF9</name>
              <description>Cancellation Finished for Transmit Buffer 9</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CF10</name>
              <description>Cancellation Finished for Transmit Buffer 10</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CF11</name>
              <description>Cancellation Finished for Transmit Buffer 11</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CF12</name>
              <description>Cancellation Finished for Transmit Buffer 12</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CF13</name>
              <description>Cancellation Finished for Transmit Buffer 13</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CF14</name>
              <description>Cancellation Finished for Transmit Buffer 14</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CF15</name>
              <description>Cancellation Finished for Transmit Buffer 15</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CF16</name>
              <description>Cancellation Finished for Transmit Buffer 16</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CF17</name>
              <description>Cancellation Finished for Transmit Buffer 17</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CF18</name>
              <description>Cancellation Finished for Transmit Buffer 18</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CF19</name>
              <description>Cancellation Finished for Transmit Buffer 19</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CF20</name>
              <description>Cancellation Finished for Transmit Buffer 20</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CF21</name>
              <description>Cancellation Finished for Transmit Buffer 21</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CF22</name>
              <description>Cancellation Finished for Transmit Buffer 22</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CF23</name>
              <description>Cancellation Finished for Transmit Buffer 23</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CF24</name>
              <description>Cancellation Finished for Transmit Buffer 24</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CF25</name>
              <description>Cancellation Finished for Transmit Buffer 25</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CF26</name>
              <description>Cancellation Finished for Transmit Buffer 26</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CF27</name>
              <description>Cancellation Finished for Transmit Buffer 27</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CF28</name>
              <description>Cancellation Finished for Transmit Buffer 28</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CF29</name>
              <description>Cancellation Finished for Transmit Buffer 29</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CF30</name>
              <description>Cancellation Finished for Transmit Buffer 30</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CF31</name>
              <description>Cancellation Finished for Transmit Buffer 31</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXBCIE</name>
          <description>Transmit Buffer Cancellation Finished Interrupt Enable Register</description>
          <addressOffset>0xE4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CFIE0</name>
              <description>Cancellation Finished Interrupt Enable for Transmit Buffer 0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFIE1</name>
              <description>Cancellation Finished Interrupt Enable for Transmit Buffer 1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFIE2</name>
              <description>Cancellation Finished Interrupt Enable for Transmit Buffer 2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFIE3</name>
              <description>Cancellation Finished Interrupt Enable for Transmit Buffer 3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFIE4</name>
              <description>Cancellation Finished Interrupt Enable for Transmit Buffer 4</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFIE5</name>
              <description>Cancellation Finished Interrupt Enable for Transmit Buffer 5</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFIE6</name>
              <description>Cancellation Finished Interrupt Enable for Transmit Buffer 6</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFIE7</name>
              <description>Cancellation Finished Interrupt Enable for Transmit Buffer 7</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFIE8</name>
              <description>Cancellation Finished Interrupt Enable for Transmit Buffer 8</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFIE9</name>
              <description>Cancellation Finished Interrupt Enable for Transmit Buffer 9</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFIE10</name>
              <description>Cancellation Finished Interrupt Enable for Transmit Buffer 10</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFIE11</name>
              <description>Cancellation Finished Interrupt Enable for Transmit Buffer 11</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFIE12</name>
              <description>Cancellation Finished Interrupt Enable for Transmit Buffer 12</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFIE13</name>
              <description>Cancellation Finished Interrupt Enable for Transmit Buffer 13</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFIE14</name>
              <description>Cancellation Finished Interrupt Enable for Transmit Buffer 14</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFIE15</name>
              <description>Cancellation Finished Interrupt Enable for Transmit Buffer 15</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFIE16</name>
              <description>Cancellation Finished Interrupt Enable for Transmit Buffer 16</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFIE17</name>
              <description>Cancellation Finished Interrupt Enable for Transmit Buffer 17</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFIE18</name>
              <description>Cancellation Finished Interrupt Enable for Transmit Buffer 18</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFIE19</name>
              <description>Cancellation Finished Interrupt Enable for Transmit Buffer 19</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFIE20</name>
              <description>Cancellation Finished Interrupt Enable for Transmit Buffer 20</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFIE21</name>
              <description>Cancellation Finished Interrupt Enable for Transmit Buffer 21</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFIE22</name>
              <description>Cancellation Finished Interrupt Enable for Transmit Buffer 22</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFIE23</name>
              <description>Cancellation Finished Interrupt Enable for Transmit Buffer 23</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFIE24</name>
              <description>Cancellation Finished Interrupt Enable for Transmit Buffer 24</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFIE25</name>
              <description>Cancellation Finished Interrupt Enable for Transmit Buffer 25</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFIE26</name>
              <description>Cancellation Finished Interrupt Enable for Transmit Buffer 26</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFIE27</name>
              <description>Cancellation Finished Interrupt Enable for Transmit Buffer 27</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFIE28</name>
              <description>Cancellation Finished Interrupt Enable for Transmit Buffer 28</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFIE29</name>
              <description>Cancellation Finished Interrupt Enable for Transmit Buffer 29</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFIE30</name>
              <description>Cancellation Finished Interrupt Enable for Transmit Buffer 30</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFIE31</name>
              <description>Cancellation Finished Interrupt Enable for Transmit Buffer 31</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
