betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
        <register>
          <name>TXBCR</name>
          <description>Transmit Buffer Cancellation Request Register</description>
          <addressOffset>0xD4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CR0</name>
              <description>Cancellation Request for Transmit Buffer 0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CR1</name>
              <description>Cancellation Request for Transmit Buffer 1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CR2</name>
              <description>Cancellation Request for Transmit Buffer 2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CR3</name>
              <description>Cancellation Request for Transmit Buffer 3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CR4</name>
              <description>Cancellation Request for Transmit Buffer 4</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CR5</name>
              <description>Cancellation Request for Transmit Buffer 5</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CR6</name>
              <description>Cancellation Request for Transmit Buffer 6</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CR7</name>
              <description>Cancellation Request for Transmit Buffer 7</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CR8</name>
              <description>Cancellation Request for Transmit Buffer 8</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CR9</name>
              <description>Cancellation Request for Transmit Buffer 9</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CR10</name>
              <description>Cancellation Request for Transmit Buffer 10</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CR11</name>
              <description>Cancellation Request for Transmit Buffer 11</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CR12</name>
              <description>Cancellation Request for Transmit Buffer 12</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CR13</name>
              <description>Cancellation Request for Transmit Buffer 13</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CR14</name>
              <description>Cancellation Request for Transmit Buffer 14</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CR15</name>
              <description>Cancellation Request for Transmit Buffer 15</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CR16</name>
              <description>Cancellation Request for Transmit Buffer 16</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CR17</name>
              <description>Cancellation Request for Transmit Buffer 17</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CR18</name>
              <description>Cancellation Request for Transmit Buffer 18</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CR19</name>
              <description>Cancellation Request for Transmit Buffer 19</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CR20</name>
              <description>Cancellation Request for Transmit Buffer 20</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CR21</name>
              <description>Cancellation Request for Transmit Buffer 21</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CR22</name>
              <description>Cancellation Request for Transmit Buffer 22</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CR23</name>
              <description>Cancellation Request for Transmit Buffer 23</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CR24</name>
              <description>Cancellation Request for Transmit Buffer 24</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CR25</name>
              <description>Cancellation Request for Transmit Buffer 25</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CR26</name>
              <description>Cancellation Request for Transmit Buffer 26</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CR27</name>
              <description>Cancellation Request for Transmit Buffer 27</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CR28</name>
              <description>Cancellation Request for Transmit Buffer 28</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CR29</name>
              <description>Cancellation Request for Transmit Buffer 29</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CR30</name>
              <description>Cancellation Request for Transmit Buffer 30</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CR31</name>
              <description>Cancellation Request for Transmit Buffer 31</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXBRP</name>
          <description>Transmit Buffer Request Pending Register</description>
          <addressOffset>0xCC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>TRP0</name>
              <description>Transmission Request Pending for Buffer 0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TRP1</name>
              <description>Transmission Request Pending for Buffer 1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TRP2</name>
              <description>Transmission Request Pending for Buffer 2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TRP3</name>
              <description>Transmission Request Pending for Buffer 3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TRP4</name>
              <description>Transmission Request Pending for Buffer 4</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TRP5</name>
              <description>Transmission Request Pending for Buffer 5</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TRP6</name>
              <description>Transmission Request Pending for Buffer 6</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TRP7</name>
              <description>Transmission Request Pending for Buffer 7</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TRP8</name>
              <description>Transmission Request Pending for Buffer 8</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TRP9</name>
              <description>Transmission Request Pending for Buffer 9</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TRP10</name>
              <description>Transmission Request Pending for Buffer 10</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TRP11</name>
              <description>Transmission Request Pending for Buffer 11</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TRP12</name>
              <description>Transmission Request Pending for Buffer 12</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TRP13</name>
              <description>Transmission Request Pending for Buffer 13</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TRP14</name>
              <description>Transmission Request Pending for Buffer 14</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TRP15</name>
              <description>Transmission Request Pending for Buffer 15</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TRP16</name>
              <description>Transmission Request Pending for Buffer 16</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TRP17</name>
              <description>Transmission Request Pending for Buffer 17</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TRP18</name>
              <description>Transmission Request Pending for Buffer 18</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TRP19</name>
              <description>Transmission Request Pending for Buffer 19</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TRP20</name>
              <description>Transmission Request Pending for Buffer 20</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TRP21</name>
              <description>Transmission Request Pending for Buffer 21</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TRP22</name>
              <description>Transmission Request Pending for Buffer 22</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TRP23</name>
              <description>Transmission Request Pending for Buffer 23</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TRP24</name>
              <description>Transmission Request Pending for Buffer 24</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TRP25</name>
              <description>Transmission Request Pending for Buffer 25</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TRP26</name>
              <description>Transmission Request Pending for Buffer 26</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TRP27</name>
              <description>Transmission Request Pending for Buffer 27</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TRP28</name>
              <description>Transmission Request Pending for Buffer 28</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TRP29</name>
              <description>Transmission Request Pending for Buffer 29</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TRP30</name>
              <description>Transmission Request Pending for Buffer 30</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TRP31</name>
              <description>Transmission Request Pending for Buffer 31</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
