betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
        <register>
          <name>TXBTIE</name>
          <description>Transmit Buffer Transmission Interrupt Enable Register</description>
          <addressOffset>0xE0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TIE0</name>
              <description>Transmission Interrupt Enable for Buffer 0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TIE1</name>
              <description>Transmission Interrupt Enable for Buffer 1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TIE2</name>
              <description>Transmission Interrupt Enable for Buffer 2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TIE3</name>
              <description>Transmission Interrupt Enable for Buffer 3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TIE4</name>
              <description>Transmission Interrupt Enable for Buffer 4</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TIE5</name>
              <description>Transmission Interrupt Enable for Buffer 5</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TIE6</name>
              <description>Transmission Interrupt Enable for Buffer 6</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TIE7</name>
              <description>Transmission Interrupt Enable for Buffer 7</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TIE8</name>
              <description>Transmission Interrupt Enable for Buffer 8</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TIE9</name>
              <description>Transmission Interrupt Enable for Buffer 9</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TIE10</name>
              <description>Transmission Interrupt Enable for Buffer 10</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TIE11</name>
              <description>Transmission Interrupt Enable for Buffer 11</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TIE12</name>
              <description>Transmission Interrupt Enable for Buffer 12</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TIE13</name>
              <description>Transmission Interrupt Enable for Buffer 13</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TIE14</name>
              <description>Transmission Interrupt Enable for Buffer 14</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TIE15</name>
              <description>Transmission Interrupt Enable for Buffer 15</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TIE16</name>
              <description>Transmission Interrupt Enable for Buffer 16</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TIE17</name>
              <description>Transmission Interrupt Enable for Buffer 17</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TIE18</name>
              <description>Transmission Interrupt Enable for Buffer 18</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TIE19</name>
              <description>Transmission Interrupt Enable for Buffer 19</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TIE20</name>
              <description>Transmission Interrupt Enable for Buffer 20</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TIE21</name>
              <description>Transmission Interrupt Enable for Buffer 21</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TIE22</name>
              <description>Transmission Interrupt Enable for Buffer 22</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TIE23</name>
              <description>Transmission Interrupt Enable for Buffer 23</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TIE24</name>
              <description>Transmission Interrupt Enable for Buffer 24</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TIE25</name>
              <description>Transmission Interrupt Enable for Buffer 25</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TIE26</name>
              <description>Transmission Interrupt Enable for Buffer 26</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TIE27</name>
              <description>Transmission Interrupt Enable for Buffer 27</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TIE28</name>
              <description>Transmission Interrupt Enable for Buffer 28</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TIE29</name>
              <description>Transmission Interrupt Enable for Buffer 29</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TIE30</name>
              <description>Transmission Interrupt Enable for Buffer 30</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TIE31</name>
              <description>Transmission Interrupt Enable for Buffer 31</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXBTO</name>
          <description>Transmit Buffer Transmission Occurred Register</description>
          <addressOffset>0xD8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>TO0</name>
              <description>Transmission Occurred for Buffer 0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TO1</name>
              <description>Transmission Occurred for Buffer 1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TO2</name>
              <description>Transmission Occurred for Buffer 2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TO3</name>
              <description>Transmission Occurred for Buffer 3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TO4</name>
              <description>Transmission Occurred for Buffer 4</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TO5</name>
              <description>Transmission Occurred for Buffer 5</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TO6</name>
              <description>Transmission Occurred for Buffer 6</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TO7</name>
              <description>Transmission Occurred for Buffer 7</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TO8</name>
              <description>Transmission Occurred for Buffer 8</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TO9</name>
              <description>Transmission Occurred for Buffer 9</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TO10</name>
              <description>Transmission Occurred for Buffer 10</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TO11</name>
              <description>Transmission Occurred for Buffer 11</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TO12</name>
              <description>Transmission Occurred for Buffer 12</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TO13</name>
              <description>Transmission Occurred for Buffer 13</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TO14</name>
              <description>Transmission Occurred for Buffer 14</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TO15</name>
              <description>Transmission Occurred for Buffer 15</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TO16</name>
              <description>Transmission Occurred for Buffer 16</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TO17</name>
              <description>Transmission Occurred for Buffer 17</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TO18</name>
              <description>Transmission Occurred for Buffer 18</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TO19</name>
              <description>Transmission Occurred for Buffer 19</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TO20</name>
              <description>Transmission Occurred for Buffer 20</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TO21</name>
              <description>Transmission Occurred for Buffer 21</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TO22</name>
              <description>Transmission Occurred for Buffer 22</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TO23</name>
              <description>Transmission Occurred for Buffer 23</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TO24</name>
              <description>Transmission Occurred for Buffer 24</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TO25</name>
              <description>Transmission Occurred for Buffer 25</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TO26</name>
              <description>Transmission Occurred for Buffer 26</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TO27</name>
              <description>Transmission Occurred for Buffer 27</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TO28</name>
              <description>Transmission Occurred for Buffer 28</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TO29</name>
              <description>Transmission Occurred for Buffer 29</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TO30</name>
              <description>Transmission Occurred for Buffer 30</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TO31</name>
              <description>Transmission Occurred for Buffer 31</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXEFA</name>
          <description>Transmit Event FIFO Acknowledge Register</description>
          <addressOffset>0xF8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EFAI</name>
              <description>Event FIFO Acknowledge Index</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TXEFC</name>
          <description>Transmit Event FIFO Configuration Register</description>
          <addressOffset>0xF0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EFSA</name>
              <description>Event FIFO Start Address</description>
              <bitRange>[15:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>16383</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EFS</name>
              <description>Event FIFO Size</description>
              <bitRange>[21:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EFWM</name>
              <description>Event FIFO Watermark</description>
              <bitRange>[29:24]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TXEFS</name>
          <description>Transmit Event FIFO Status Register</description>
          <addressOffset>0xF4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>EFFL</name>
              <description>Event FIFO Fill Level</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EFGI</name>
              <description>Event FIFO Get Index</description>
              <bitRange>[12:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EFPI</name>
              <description>Event FIFO Put Index</description>
              <bitRange>[20:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EFF</name>
              <description>Event FIFO Full</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TEFL</name>
              <description>Tx Event FIFO Element Lost</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXESC</name>
          <description>Transmit Buffer Element Size Configuration Register</description>
          <addressOffset>0xC8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TBDS</name>
              <description>Tx Buffer Data Field Size</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_8_BYTE</name>
                  <description>8-byte data field</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_12_BYTE</name>
                  <description>12-byte data field</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16_BYTE</name>
                  <description>16-byte data field</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_20_BYTE</name>
                  <description>20-byte data field</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_24_BYTE</name>
                  <description>24-byte data field</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_32_BYTE</name>
                  <description>32-byte data field</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_48_BYTE</name>
                  <description>48- byte data field</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_64_BYTE</name>
                  <description>64-byte data field</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
