betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
        <register>
          <name>TXFQS</name>
          <description>Transmit FIFO/Queue Status Register</description>
          <addressOffset>0xC4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>TFFL</name>
              <description>Tx FIFO Free Level</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TFGI</name>
              <description>Tx FIFO Get Index</description>
              <bitRange>[12:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TFQPI</name>
              <description>Tx FIFO/Queue Put Index</description>
              <bitRange>[20:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TFQF</name>
              <description>Tx FIFO/Queue Full</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XIDAM</name>
          <description>Extended ID AND Mask Register</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EIDM</name>
              <description>Extended ID Mask</description>
              <bitRange>[28:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>536870911</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>XIDFC</name>
          <description>Extended ID Filter Configuration Register</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FLESA</name>
              <description>Filter List Extended Start Address</description>
              <bitRange>[15:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>16383</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>LSE</name>
              <description>List Size Extended</description>
              <bitRange>[22:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="MCAN0">
      <name>MCAN1</name>
      <description>Controller Area Network</description>
      <baseAddress>0xFC050000</baseAddress>
    </peripheral>
    <peripheral>
      <name>MPDDRC</name>
      <description>AHB Multiport DDR-SDRAM Controller</description>
      <baseAddress>0xF000C000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x18</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1C</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x28</offset>
        <size>0x7C</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xE4</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>BDW_PORT_0123</name>
          <description>Current/Maximum Bandwidth Port 0-1-2-3 Register</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>BDW_P0</name>
              <description>Current/Maximum Bandwidth from Port 0-1-2-3</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BDW_P1</name>
              <description>Current/Maximum Bandwidth from Port 0-1-2-3</description>
              <bitRange>[14:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BDW_P2</name>
              <description>Current/Maximum Bandwidth from Port 0-1-2-3</description>
              <bitRange>[22:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BDW_P3</name>
              <description>Current/Maximum Bandwidth from Port 0-1-2-3</description>
              <bitRange>[30:24]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>BDW_PORT_4567</name>
          <description>Current/Maximum Bandwidth Port 4-5-6-7 Register</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>BDW_P4</name>
              <description>Current/Maximum Bandwidth from Port 4-5-6-7</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BDW_P5</name>
              <description>Current/Maximum Bandwidth from Port 4-5-6-7</description>
              <bitRange>[14:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BDW_P6</name>
              <description>Current/Maximum Bandwidth from Port 4-5-6-7</description>
              <bitRange>[22:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BDW_P7</name>
              <description>Current/Maximum Bandwidth from Port 4-5-6-7</description>
              <bitRange>[30:24]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CONF_ARBITER</name>
          <description>Configuration Arbiter Register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ARB</name>
              <description>Type of Arbitration</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ROUND</name>
                  <description>Round Robin</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NB_REQUEST</name>
                  <description>Request Policy</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BANDWIDTH</name>
                  <description>Bandwidth Policy</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BDW_MAX_CUR</name>
              <description>Bandwidth Max or Current</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RQ_WD_P0</name>
              <description>Request or Word from Port X</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RQ_WD_P1</name>
              <description>Request or Word from Port X</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RQ_WD_P2</name>
              <description>Request or Word from Port X</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RQ_WD_P3</name>
              <description>Request or Word from Port X</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RQ_WD_P4</name>
              <description>Request or Word from Port X</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RQ_WD_P5</name>
              <description>Request or Word from Port X</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RQ_WD_P6</name>
              <description>Request or Word from Port X</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RQ_WD_P7</name>
              <description>Request or Word from Port X</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MA_PR_P0</name>
              <description>Master or Software Provide Information</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MA_PR_P1</name>
              <description>Master or Software Provide Information</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MA_PR_P2</name>
              <description>Master or Software Provide Information</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MA_PR_P3</name>
              <description>Master or Software Provide Information</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MA_PR_P4</name>
              <description>Master or Software Provide Information</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MA_PR_P5</name>
              <description>Master or Software Provide Information</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MA_PR_P6</name>
              <description>Master or Software Provide Information</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MA_PR_P7</name>
              <description>Master or Software Provide Information</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BDW_BURST_P0</name>
              <description>Bandwidth is Reached or Bandwidth and Current Burst Access is Ended on port X</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BDW_BURST_P1</name>
              <description>Bandwidth is Reached or Bandwidth and Current Burst Access is Ended on port X</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BDW_BURST_P2</name>
              <description>Bandwidth is Reached or Bandwidth and Current Burst Access is Ended on port X</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BDW_BURST_P3</name>
              <description>Bandwidth is Reached or Bandwidth and Current Burst Access is Ended on port X</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BDW_BURST_P4</name>
              <description>Bandwidth is Reached or Bandwidth and Current Burst Access is Ended on port X</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BDW_BURST_P5</name>
              <description>Bandwidth is Reached or Bandwidth and Current Burst Access is Ended on port X</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BDW_BURST_P6</name>
              <description>Bandwidth is Reached or Bandwidth and Current Burst Access is Ended on port X</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BDW_BURST_P7</name>
              <description>Bandwidth is Reached or Bandwidth and Current Burst Access is Ended on port X</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
