betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
        <register>
          <name>CR</name>
          <description>Configuration Register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>NC</name>
              <description>Number of Column Bits</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DDR9_MDDR8_COL_BITS</name>
                  <description>9 bits to define the column number, up to 512 columns, for DDR2-SDRAM/DDR3-SDRAM/LPDDR2-SDRAM/LPDDR3-SDRAM 8 bits to define the column number, up to 256 columns, for LPDDR1-SDRAM</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DDR10_MDDR9_COL_BITS</name>
                  <description>10 bits to define the column number, up to 1024 columns, for DDR2-SDRAM/DDR3-SDRAM/LPDDR2-SDRAM/LPDDR3-SDRAM 9 bits to define the column number, up to 512 columns, for LPDDR1-SDRAM</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DDR11_MDDR10_COL_BITS</name>
                  <description>11 bits to define the column number, up to 2048 columns, for DDR2-SDRAM/DDR3-SDRAM/LPDDR2-SDRAM/LPDDR3-SDRAM 10 bits to define the column number, up to 1024 columns, for LPDDR1-SDRAM</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DDR12_MDDR11_COL_BITS</name>
                  <description>12 bits to define the column number, up to 4096 columns, for DDR2-SDRAM/DDR3-SDRAM/LPDDR2-SDRAM/LPDDR3-SDRAM 11 bits to define the column number, up to 2048 columns, for LPDDR1-SDRAM</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NR</name>
              <description>Number of Row Bits</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_11_ROW_BITS</name>
                  <description>11 bits to define the row number, up to 2048 rows</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_12_ROW_BITS</name>
                  <description>12 bits to define the row number, up to 4096 rows</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_13_ROW_BITS</name>
                  <description>13 bits to define the row number, up to 8192 rows</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_14_ROW_BITS</name>
                  <description>14 bits to define the row number, up to 16384 rows</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAS</name>
              <description>CAS Latency</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DDR_CAS2</name>
                  <description>LPDDR1 CAS Latency 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DDR_CAS3</name>
                  <description>LPDDR3/DDR2/LPDDR2/LPDDR1 CAS Latency 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DDR_CAS5</name>
                  <description>DDR3 CAS Latency 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DDR_CAS6</name>
                  <description>DDR3LPDDR3 CAS Latency 6</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DLL</name>
              <description>Reset DLL</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RESET_DISABLED</name>
                  <description>Disable DLL reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESET_ENABLED</name>
                  <description>Enable DLL reset</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIC_DS</name>
              <description>Output Driver Impedance Control (Drive Strength)</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DDR2_NORMALSTRENGTH_DDR3_RZQ6</name>
                  <description>Normal drive strength (DDR2) - RZQ/6 (40 [NOM], DDR3)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DDR2_WEAKSTRENGTH_DDR3_RZQ7</name>
                  <description>Weak drive strength (DDR2) - RZQ/7 (34 [NOM], DDR3)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIS_DLL</name>
              <description>DISABLE DLL</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ZQ</name>
              <description>ZQ Calibration</description>
              <bitRange>[11:10]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INIT</name>
                  <description>Calibration command after initialization</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LONG</name>
                  <description>Long calibration</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHORT</name>
                  <description>Short calibration</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESET</name>
                  <description>ZQ Reset</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OCD</name>
              <description>Off-chip Driver</description>
              <bitRange>[14:12]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DDR2_EXITCALIB</name>
                  <description>Exit from OCD Calibration mode and maintain settings</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DDR2_DEFAULT_CALIB</name>
                  <description>OCD calibration default</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DQMS</name>
              <description>Mask Data is Shared</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_SHARED</name>
                  <description>DQM is not shared with another controller</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHARED</name>
                  <description>DQM is shared with another controller</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENRDM</name>
              <description>Enable Read Measure</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>DQS/DDR_DATA phase error correction is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>DQS/DDR_DATA phase error correction is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LC_LPDDR1</name>
              <description>Low-cost Low-power DDR1</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_2_BANKS</name>
                  <description>Any type of memory devices except of low cost, low density Low Power DDR1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_2_BANKS_LPDDR1</name>
                  <description>Low-cost and low-density low-power DDR1. These devices have a density of 32 Mbits and are organized as two internal banks. To use this feature, the user has to define the type of memory and the data bus width (see Section 8.8 "MPDDRC Memory Device Register").The 16-bit memory device is organized as 2 banks, 9 columns and 11 rows.The 32-bit memory device is organized as 2 banks, 8 columns and 11 rows.It is impossible to use two 16-bit memory devices (2 x 32 Mbits) for creating one 32-bit memory device (64 Mbits). In this case, it is recommended to use one 32-bit memory device which embeds four internal banks.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NB</name>
              <description>Number of Banks</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_4_BANKS</name>
                  <description>4-bank memory devices</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_8_BANKS</name>
                  <description>8 banks. Only possible when using the DDR2-SDRAM and low-power DDR2-SDRAM and DDR3-SDRAM and low-power DDR3-SDRAM devices.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NDQS</name>
              <description>Not DQS</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Not DQS is enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Not DQS is disabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DECOD</name>
              <description>Type of Decoding</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEQUENTIAL</name>
                  <description>Method for address mapping where banks alternate at each last DDR-SDRAM page of the current bank.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTERLEAVED</name>
                  <description>Method for address mapping where banks alternate at each DDR-SDRAM end of page of the current bank.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UNAL</name>
              <description>Support Unaligned Access</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNSUPPORTED</name>
                  <description>Unaligned access is not supported.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUPPORTED</name>
                  <description>Unaligned access is supported.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IO_CALIBR</name>
          <description>I/O Calibration Register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RDIV</name>
              <description>Resistor Divider, Output Driver Impedance</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RZQ_34</name>
                  <description>LPDDR2 serial impedance line = 34.3 ohms,DDR2/LPDDR1 serial impedance line: Not applicable</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RZQ_40_RZQ_38_RZQ_37_RZQ_35</name>
                  <description>LPDDR2 serial impedance line = 40 ohms,LPDDR3 serial impedance line = 38 ohms,DDR3 serial impedance line = 37 ohms,DDR2/LPDDR1 serial impedance line = 35 ohms</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RZQ_48_RZQ_46_RZQ_44_RZQ_43</name>
                  <description>LPDDR2 serial impedance line = 48 ohms,LPDDR3 serial impedance line = 46 ohms,DDR3 serial impedance line = 44 ohms,DDR2/LPDDR1 serial impedance line = 43 ohms</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RZQ_60_RZQ_57_RZQ_55_RZQ_52</name>
                  <description>LPDDR2 serial impedance line = 60 ohms,LPDDR3 serial impedance line = 57 ohms,DDR3 serial impedance line = 55 ohms,DDR2/LPDDR1 serial impedance line = 52 ohms</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RZQ_80_RZQ_77_RZQ_73_RZQ_70</name>
                  <description>LPDDR2 serial impedance line = 80 ohms,LPDDR3 serial impedance line = 77 ohms,DDR3 serial impedance line = 73 ohms,DDR2/LPDDR1 serial impedance line = 70 ohms</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RZQ_120_RZQ_115_RZQ_110_RZQ_105</name>
                  <description>LPDDR2 serial impedance line = 120 ohms,LPDDR3 serial impedance line = 115 ohms,DDR3 serial impedance line = 110 ohms,DDR2/LPDDR1 serial impedance line = 105 ohms</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EN_CALIB</name>
              <description>Enable Calibration</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE_CALIBRATION</name>
                  <description>Calibration is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_CALIBRATION</name>
                  <description>Calibration is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TZQIO</name>
              <description>IO Calibration</description>
              <bitRange>[14:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CALCODEP</name>
              <description>Number of Transistor P (read-only)</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CALCODEN</name>
              <description>Number of Transistor N (read-only)</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>LPDDR23_LPR</name>
          <description>Low-power DDR2 Low-power DDR3 Low-power Register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BK_MASK_PASR</name>
              <description>Bank Mask Bit/PASR</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SEG_MASK</name>
              <description>Segment Mask Bit</description>
              <bitRange>[23:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DS</name>
              <description>Drive Strength</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DS_34_3</name>
                  <description>34.3 ohm typical</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DS_40</name>
                  <description>40 ohm typical (default)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DS_48</name>
                  <description>48 ohm typical</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DS_60</name>
                  <description>60 ohm typical</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DS_80</name>
                  <description>80 ohm typical</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DS_120</name>
                  <description>120 ohm typical</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
