betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
        <register>
          <name>LPDDR2_LPDDR3_DDR3_CAL_MR4</name>
          <description>Low-power DDR2 Low-power DDR3 and DDR3 Calibration and MR4 Register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>COUNT_CAL</name>
              <description>LPDDR2 LPDDR3 and DDR3 Calibration Timer Count</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MR4_READ</name>
              <description>Mode Register 4 Read Interval</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>LPDDR2_LPDDR3_DDR3_TIM_CAL</name>
          <description>Low-power DDR2 Low-power DDR3 and DDR3 Timing Calibration Register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ZQCS</name>
              <description>ZQ Calibration Short</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RZQI</name>
              <description>Built-in Self-Test for RZQ Information (read-only)</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RZQ_NOT_SUPPORTED</name>
                  <description>RZQ self test not supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZQ_VDDCA_FLOAT</name>
                  <description>The ZQ pin can be connected to VDDCA or left floating.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZQ_SHORTED_GROUND</name>
                  <description>The ZQ pin can be shorted to ground.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZQ_SELF_TEST_OK</name>
                  <description>ZQ pin self test complete; no error condition detected</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPR</name>
          <description>Low-Power Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LPCB</name>
              <description>Low-power Command Bit</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOLOWPOWER</name>
                  <description>Low-power feature is inhibited. No Powerdown, Self-refresh and Deep power modes are issued to the DDR-SDRAM device.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELFREFRESH</name>
                  <description>The MPDDRC issues a self-refresh command to the DDR-SDRAM device, the clock(s) is/are deactivated and the CKE signal is set low. The DDR-SDRAM device leaves the Self-refresh mode when accessed and reenters it after the access.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWERDOWN</name>
                  <description>The MPDDRC issues a Powerdown command to the DDR-SDRAM device after each access, the CKE signal is set low. The DDR-SDRAM device leaves the Powerdown mode when accessed and reenters it after the access.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEEPPOWERDOWN</name>
                  <description>The MPDDRC issues a Deep Powerdown command to the low-power DDR-SDRAM device.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLK_FR</name>
              <description>Clock Frozen Command Bit</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Clock(s) is/are not frozen.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Clock(s) is/are frozen.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPDDR2_LPDDR3_PWOFF</name>
              <description>LPDDR2 - LPDDR3 Power Off Bit</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>No power-off sequence applied to LPDDR2/LPDDR3.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>A power-off sequence is applied to the LPDDR2/LPDDR3 device. CKE is forced low.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PASR</name>
              <description>Partial Array Self-refresh</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DS</name>
              <description>Drive Strength</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DS_FULL</name>
                  <description>Full drive strength</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DS_HALF</name>
                  <description>Half drive strength</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DS_QUARTER</name>
                  <description>Quarter drive strength</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DS_OCTANT</name>
                  <description>Octant drive strength</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMEOUT</name>
              <description>Time Between Last Transfer and Low-Power Mode</description>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>SDRAM Low-power mode is activated immediately after the end of the last transfer.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_64_CLK</name>
                  <description>SDRAM Low-power mode is activated 64 clock cycles after the end of the last transfer.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_128_CLK</name>
                  <description>SDRAM Low-power mode is activated 128 clock cycles after the end of the last transfer.</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>APDE</name>
              <description>Active Power Down Exit Time</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DDR2_FAST_EXIT</name>
                  <description>Fast Exit from Power Down. DDR2-SDRAM and DDR3-SDRAM devices only.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DDR2_SLOW_EXIT</name>
                  <description>Slow Exit from Power Down. DDR2-SDRAM and DDR3-SDRAM devices only.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UPD_MR</name>
              <description>Update Load Mode Register and Extended Mode Register</description>
              <bitRange>[21:20]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_UPDATE</name>
                  <description>Update of Load Mode and Extended Mode registers is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UPDATE_SHAREDBUS</name>
                  <description>MPDDRC shares an external bus. Automatic update is done during a refresh command and a pending read or write access in the SDRAM device.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UPDATE_NOSHAREDBUS</name>
                  <description>MPDDRC does not share an external bus. Automatic update is done before entering Self-refresh mode.</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHG_FRQ</name>
              <description>Change Clock Frequency During Self-refresh Mode</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SELF_DONE</name>
              <description>Self-refresh is done (read-only)</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MADDR0</name>
          <description>Monitor Address High/Low Port 0 Register</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADDR_LOW_PORT0</name>
              <description>Address Low on Port x [x = 0..7]</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ADDR_HIGH_PORT0</name>
              <description>Address High on Port x [x = 0..7]</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MADDR1</name>
          <description>Monitor Address High/Low Port 1 Register</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADDR_LOW_PORT1</name>
              <description>Address Low on Port x [x = 0..7]</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ADDR_HIGH_PORT1</name>
              <description>Address High on Port x [x = 0..7]</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MADDR2</name>
          <description>Monitor Address High/Low Port 2 Register</description>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADDR_LOW_PORT2</name>
              <description>Address Low on Port x [x = 0..7]</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ADDR_HIGH_PORT2</name>
              <description>Address High on Port x [x = 0..7]</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MADDR3</name>
          <description>Monitor Address High/Low Port 3 Register</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADDR_LOW_PORT3</name>
              <description>Address Low on Port x [x = 0..7]</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ADDR_HIGH_PORT3</name>
              <description>Address High on Port x [x = 0..7]</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MADDR4</name>
          <description>Monitor Address High/Low Port 4 Register</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADDR_LOW_PORT4</name>
              <description>Address Low on Port x [x = 0..7]</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ADDR_HIGH_PORT4</name>
              <description>Address High on Port x [x = 0..7]</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MADDR5</name>
          <description>Monitor Address High/Low Port 5 Register</description>
          <addressOffset>0x78</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADDR_LOW_PORT5</name>
              <description>Address Low on Port x [x = 0..7]</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ADDR_HIGH_PORT5</name>
              <description>Address High on Port x [x = 0..7]</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MADDR6</name>
          <description>Monitor Address High/Low Port 6 Register</description>
          <addressOffset>0x7C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADDR_LOW_PORT6</name>
              <description>Address Low on Port x [x = 0..7]</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ADDR_HIGH_PORT6</name>
              <description>Address High on Port x [x = 0..7]</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MADDR7</name>
          <description>Monitor Address High/Low Port 7 Register</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADDR_LOW_PORT7</name>
              <description>Address Low on Port x [x = 0..7]</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ADDR_HIGH_PORT7</name>
              <description>Address High on Port x [x = 0..7]</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
