betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
        <register>
          <name>MCFGR</name>
          <description>Monitor Configuration Register</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN_MONI</name>
              <description>Enable Monitor</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SOFT_RESET</name>
              <description>Soft Reset</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RUN</name>
              <description>Control Monitor</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_WRITE</name>
              <description>Read/Write Access</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG_RD_WR</name>
                  <description>Read and Write accesses are triggered.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_WR</name>
                  <description>Only Write accesses are triggered.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_RD</name>
                  <description>Only Read accesses are triggered.</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REFR_CALIB</name>
              <description>Refresh Calibration</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INFO</name>
              <description>Information Type</description>
              <bitRange>[12:11]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAX_WAIT</name>
                  <description>Information concerning the transfer with the longest waiting time</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NB_TRANSFERS</name>
                  <description>Number of transfers on the port</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOTAL_LATENCY</name>
                  <description>Total latency on the port</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MD</name>
          <description>Memory Device Register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MD</name>
              <description>Memory Device</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPDDR_SDRAM</name>
                  <description>Low-power DDR1-SDRAM</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DDR3_SDRAM</name>
                  <description>DDR3-SDRAM</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPDDR3_SDRAM</name>
                  <description>Low-power DDR3-SDRAM</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DDR2_SDRAM</name>
                  <description>DDR2-SDRAM</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPDDR2_SDRAM</name>
                  <description>Low-power DDR2-SDRAM</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBW</name>
              <description>Data Bus Width</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DBW_32_BITS</name>
                  <description>Data bus width is 32 bits</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBW_16_BITS</name>
                  <description>Data bus width is 16 bits.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WL</name>
              <description>Write Latency (read-only)</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WL_SETA</name>
                  <description>Write Latency Set A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WL_SETB</name>
                  <description>Write Latency Set B</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RL3</name>
              <description>Read Latency 3 Option Support (read-only)</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RL3_SUPPORT</name>
                  <description>Read latency of 3 is supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RL3_NOT_SUPPORTED</name>
                  <description>Read latency 0f 3 is not supported</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MANU_ID</name>
              <description>Manufacturer Identification (read-only)</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>REV_ID</name>
              <description>Revision Identification (read-only)</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TYPE</name>
              <description>DRAM Architecture (read-only)</description>
              <bitRange>[25:24]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>S4_SDRAM</name>
                  <description>4n prefetch architecture</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S2_SDRAM</name>
                  <description>2n prefetch architecture</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVM</name>
                  <description>Non-volatile device</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S8_SDRAM</name>
                  <description>8n prefetch architecture</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DENSITY</name>
              <description>Density of Memory (read-only)</description>
              <bitRange>[29:26]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DENSITY_64MBITS</name>
                  <description>The device density is 64 Mbits.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DENSITY_128MBITS</name>
                  <description>The device density is 128 Mbits.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DENSITY_256MBITS</name>
                  <description>The device density is 256 Mbits.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DENSITY_512MBITS</name>
                  <description>The device density is 512 Mbits.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DENSITY_1GBITS</name>
                  <description>The device density is 1 Gbit.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DENSITY_2GBITS</name>
                  <description>The device density is 2 Gbits.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DENSITY_4GBITS</name>
                  <description>The device density is 4 Gbits.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DENSITY_8GBITS</name>
                  <description>The device density is 8 Gbits.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DENSITY_16GBITS</name>
                  <description>The device density is 16 Gbits.</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DENSITY_32GBITS</name>
                  <description>The device density is 32 Gbits.</description>
                  <value>9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IO_WIDTH</name>
              <description>Width of Memory (read-only)</description>
              <bitRange>[31:30]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WIDTH_32</name>
                  <description>The data bus width is 32 bits.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIDTH_16</name>
                  <description>The data bus width is 16 bits.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIDTH_8</name>
                  <description>The data bus width is 8 bits.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_USED</name>
                  <description>-</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MINFO0</name>
          <description>Monitor Information Port 0 Register</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>MAX_PORT0_WAITING</name>
              <description>Address High on Port x [x = 0..7]</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>P0_NB_TRANSFERS</name>
              <description>Number of Transfers on Port x [x = 0..7]</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>P0_TOTAL_LATENCY</name>
              <description>Total Latency on Port x [x = 0..7]</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BURST</name>
              <description>Type of Burst on Port x [x = 0..7]</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SINGLE</name>
                  <description>Single transfer</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCR</name>
                  <description>Incrementing burst of unspecified length</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRAP4</name>
                  <description>4-beat wrapping burst</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCR4</name>
                  <description>4-beat incrementing burst</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRAP8</name>
                  <description>8-beat wrapping burst</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCR8</name>
                  <description>8-beat incrementing burst</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRAP16</name>
                  <description>16-beat wrapping burst</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCR16</name>
                  <description>16-beat incrementing burst</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIZE</name>
              <description>Transfer Size on Port x [x = 0..7]</description>
              <bitRange>[22:20]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_8BITS</name>
                  <description>Byte transfer</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16BITS</name>
                  <description>Halfword transfer</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_32BITS</name>
                  <description>Word transfer</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_64BITS</name>
                  <description>Dword transfer</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>READ_WRITE</name>
              <description>Read or Write Access on Port x [x = 0..7]</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
