betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
        <register>
          <name>MINFO1</name>
          <description>Monitor Information Port 1 Register</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>MAX_PORT1_WAITING</name>
              <description>Address High on Port x [x = 0..7]</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>P1_NB_TRANSFERS</name>
              <description>Number of Transfers on Port x [x = 0..7]</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>P1_TOTAL_LATENCY</name>
              <description>Total Latency on Port x [x = 0..7]</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BURST</name>
              <description>Type of Burst on Port x [x = 0..7]</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SINGLE</name>
                  <description>Single transfer</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCR</name>
                  <description>Incrementing burst of unspecified length</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRAP4</name>
                  <description>4-beat wrapping burst</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCR4</name>
                  <description>4-beat incrementing burst</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRAP8</name>
                  <description>8-beat wrapping burst</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCR8</name>
                  <description>8-beat incrementing burst</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRAP16</name>
                  <description>16-beat wrapping burst</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCR16</name>
                  <description>16-beat incrementing burst</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIZE</name>
              <description>Transfer Size on Port x [x = 0..7]</description>
              <bitRange>[22:20]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_8BITS</name>
                  <description>Byte transfer</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16BITS</name>
                  <description>Halfword transfer</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_32BITS</name>
                  <description>Word transfer</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_64BITS</name>
                  <description>Dword transfer</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>READ_WRITE</name>
              <description>Read or Write Access on Port x [x = 0..7]</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MINFO2</name>
          <description>Monitor Information Port 2 Register</description>
          <addressOffset>0x8C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>MAX_PORT2_WAITING</name>
              <description>Address High on Port x [x = 0..7]</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>P2_NB_TRANSFERS</name>
              <description>Number of Transfers on Port x [x = 0..7]</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>P2_TOTAL_LATENCY</name>
              <description>Total Latency on Port x [x = 0..7]</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BURST</name>
              <description>Type of Burst on Port x [x = 0..7]</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SINGLE</name>
                  <description>Single transfer</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCR</name>
                  <description>Incrementing burst of unspecified length</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRAP4</name>
                  <description>4-beat wrapping burst</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCR4</name>
                  <description>4-beat incrementing burst</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRAP8</name>
                  <description>8-beat wrapping burst</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCR8</name>
                  <description>8-beat incrementing burst</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRAP16</name>
                  <description>16-beat wrapping burst</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCR16</name>
                  <description>16-beat incrementing burst</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIZE</name>
              <description>Transfer Size on Port x [x = 0..7]</description>
              <bitRange>[22:20]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_8BITS</name>
                  <description>Byte transfer</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16BITS</name>
                  <description>Halfword transfer</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_32BITS</name>
                  <description>Word transfer</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_64BITS</name>
                  <description>Dword transfer</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>READ_WRITE</name>
              <description>Read or Write Access on Port x [x = 0..7]</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MINFO3</name>
          <description>Monitor Information Port 3 Register</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>MAX_PORT3_WAITING</name>
              <description>Address High on Port x [x = 0..7]</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>P3_NB_TRANSFERS</name>
              <description>Number of Transfers on Port x [x = 0..7]</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>P3_TOTAL_LATENCY</name>
              <description>Total Latency on Port x [x = 0..7]</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BURST</name>
              <description>Type of Burst on Port x [x = 0..7]</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SINGLE</name>
                  <description>Single transfer</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCR</name>
                  <description>Incrementing burst of unspecified length</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRAP4</name>
                  <description>4-beat wrapping burst</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCR4</name>
                  <description>4-beat incrementing burst</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRAP8</name>
                  <description>8-beat wrapping burst</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCR8</name>
                  <description>8-beat incrementing burst</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRAP16</name>
                  <description>16-beat wrapping burst</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCR16</name>
                  <description>16-beat incrementing burst</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIZE</name>
              <description>Transfer Size on Port x [x = 0..7]</description>
              <bitRange>[22:20]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_8BITS</name>
                  <description>Byte transfer</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16BITS</name>
                  <description>Halfword transfer</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_32BITS</name>
                  <description>Word transfer</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_64BITS</name>
                  <description>Dword transfer</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>READ_WRITE</name>
              <description>Read or Write Access on Port x [x = 0..7]</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MINFO4</name>
          <description>Monitor Information Port 4 Register</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>MAX_PORT4_WAITING</name>
              <description>Address High on Port x [x = 0..7]</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>P4_NB_TRANSFERS</name>
              <description>Number of Transfers on Port x [x = 0..7]</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>P4_TOTAL_LATENCY</name>
              <description>Total Latency on Port x [x = 0..7]</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BURST</name>
              <description>Type of Burst on Port x [x = 0..7]</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SINGLE</name>
                  <description>Single transfer</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCR</name>
                  <description>Incrementing burst of unspecified length</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRAP4</name>
                  <description>4-beat wrapping burst</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCR4</name>
                  <description>4-beat incrementing burst</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRAP8</name>
                  <description>8-beat wrapping burst</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCR8</name>
                  <description>8-beat incrementing burst</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRAP16</name>
                  <description>16-beat wrapping burst</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCR16</name>
                  <description>16-beat incrementing burst</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIZE</name>
              <description>Transfer Size on Port x [x = 0..7]</description>
              <bitRange>[22:20]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_8BITS</name>
                  <description>Byte transfer</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16BITS</name>
                  <description>Halfword transfer</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_32BITS</name>
                  <description>Word transfer</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_64BITS</name>
                  <description>Dword transfer</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>READ_WRITE</name>
              <description>Read or Write Access on Port x [x = 0..7]</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
