betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
        <register>
          <name>MINFO5</name>
          <description>Monitor Information Port 5 Register</description>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>MAX_PORT5_WAITING</name>
              <description>Address High on Port x [x = 0..7]</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>P5_NB_TRANSFERS</name>
              <description>Number of Transfers on Port x [x = 0..7]</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>P5_TOTAL_LATENCY</name>
              <description>Total Latency on Port x [x = 0..7]</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BURST</name>
              <description>Type of Burst on Port x [x = 0..7]</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SINGLE</name>
                  <description>Single transfer</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCR</name>
                  <description>Incrementing burst of unspecified length</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRAP4</name>
                  <description>4-beat wrapping burst</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCR4</name>
                  <description>4-beat incrementing burst</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRAP8</name>
                  <description>8-beat wrapping burst</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCR8</name>
                  <description>8-beat incrementing burst</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRAP16</name>
                  <description>16-beat wrapping burst</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCR16</name>
                  <description>16-beat incrementing burst</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIZE</name>
              <description>Transfer Size on Port x [x = 0..7]</description>
              <bitRange>[22:20]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_8BITS</name>
                  <description>Byte transfer</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16BITS</name>
                  <description>Halfword transfer</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_32BITS</name>
                  <description>Word transfer</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_64BITS</name>
                  <description>Dword transfer</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>READ_WRITE</name>
              <description>Read or Write Access on Port x [x = 0..7]</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MINFO6</name>
          <description>Monitor Information Port 6 Register</description>
          <addressOffset>0x9C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>MAX_PORT6_WAITING</name>
              <description>Address High on Port x [x = 0..7]</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>P6_NB_TRANSFERS</name>
              <description>Number of Transfers on Port x [x = 0..7]</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>P6_TOTAL_LATENCY</name>
              <description>Total Latency on Port x [x = 0..7]</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BURST</name>
              <description>Type of Burst on Port x [x = 0..7]</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SINGLE</name>
                  <description>Single transfer</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCR</name>
                  <description>Incrementing burst of unspecified length</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRAP4</name>
                  <description>4-beat wrapping burst</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCR4</name>
                  <description>4-beat incrementing burst</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRAP8</name>
                  <description>8-beat wrapping burst</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCR8</name>
                  <description>8-beat incrementing burst</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRAP16</name>
                  <description>16-beat wrapping burst</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCR16</name>
                  <description>16-beat incrementing burst</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIZE</name>
              <description>Transfer Size on Port x [x = 0..7]</description>
              <bitRange>[22:20]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_8BITS</name>
                  <description>Byte transfer</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16BITS</name>
                  <description>Halfword transfer</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_32BITS</name>
                  <description>Word transfer</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_64BITS</name>
                  <description>Dword transfer</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>READ_WRITE</name>
              <description>Read or Write Access on Port x [x = 0..7]</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MINFO7</name>
          <description>Monitor Information Port 7 Register</description>
          <addressOffset>0xA0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>MAX_PORT7_WAITING</name>
              <description>Address High on Port x [x = 0..7]</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>P7_NB_TRANSFERS</name>
              <description>Number of Transfers on Port x [x = 0..7]</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>P7_TOTAL_LATENCY</name>
              <description>Total Latency on Port x [x = 0..7]</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BURST</name>
              <description>Type of Burst on Port x [x = 0..7]</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SINGLE</name>
                  <description>Single transfer</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCR</name>
                  <description>Incrementing burst of unspecified length</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRAP4</name>
                  <description>4-beat wrapping burst</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCR4</name>
                  <description>4-beat incrementing burst</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRAP8</name>
                  <description>8-beat wrapping burst</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCR8</name>
                  <description>8-beat incrementing burst</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRAP16</name>
                  <description>16-beat wrapping burst</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCR16</name>
                  <description>16-beat incrementing burst</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIZE</name>
              <description>Transfer Size on Port x [x = 0..7]</description>
              <bitRange>[22:20]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_8BITS</name>
                  <description>Byte transfer</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16BITS</name>
                  <description>Halfword transfer</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_32BITS</name>
                  <description>Word transfer</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_64BITS</name>
                  <description>Dword transfer</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>READ_WRITE</name>
              <description>Read or Write Access on Port x [x = 0..7]</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MR</name>
          <description>Mode Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MODE</name>
              <description>MPDDRC Command Mode</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL_CMD</name>
                  <description>Normal Mode. Any access to the MPDDRC is decoded normally. To activate this mode, the command must be followed by a write to the DDR-SDRAM.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOP_CMD</name>
                  <description>The MPDDRC issues a NOP command when the DDR-SDRAM device is accessed regardless of the cycle. To activate this mode, the command must be followed by a write to the DDR-SDRAM.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRCGALL_CMD</name>
                  <description>The MPDDRC issues the All Banks Precharge command when the DDR-SDRAM device is accessed regardless of the cycle. To activate this mode, the command must be followed by a write to the SDRAM.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMR_CMD</name>
                  <description>The MPDDRC issues a Load Mode Register command when the DDR-SDRAM device is accessed regardless of the cycle. To activate this mode, the command must be followed by a write to the DDR-SDRAM.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFSH_CMD</name>
                  <description>The MPDDRC issues an Autorefresh command when the DDR-SDRAM device is accessed regardless of the cycle. Previously, an All Banks Precharge command must be issued. To activate this mode, the command must be followed by a write to the DDR-SDRAM.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT_LMR_CMD</name>
                  <description>The MPDDRC issues an Extended Load Mode Register command when the SDRAM device is accessed regardless of the cycle. To activate this mode, the command must be followed by a write to the DDR-SDRAM. The write in the DDR-SDRAM must be done in the appropriate bank.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEEP_CALIB_MD</name>
                  <description>Deep Power mode: Access to Deep Powerdown modeCalibration command: to calibrate RTT and RON values for the Process Voltage Temperature (PVT) (DDR3-SDRAM device)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPDDR2_LPDDR3_CMD</name>
                  <description>The MPDDRC issues an LPDDR2/LPDDR3 Mode Register command when the device is accessed regardless of the cycle. To activate this mode, the Mode Register command must be followed by a write to the low-power DDR2-SDRAM or to the low-power DDR3-SDRAM.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DAI</name>
              <description>Device Autoinitialization Status (read-only)</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DAI_COMPLETE</name>
                  <description>DAI complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAI_IN_PROGESSS</name>
                  <description>DAI still in progress</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MRS</name>
              <description>Mode Register Select LPDDR2/LPDDR3</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>OCMS</name>
          <description>OCMS Register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SCR_EN</name>
              <description>Scrambling Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OCMS_KEY1</name>
          <description>OCMS KEY1 Register</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>KEY1</name>
              <description>Off-chip Memory Scrambling (OCMS) Key Part 1</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>OCMS_KEY2</name>
          <description>OCMS KEY2 Register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>KEY2</name>
              <description>Off-chip Memory Scrambling (OCMS) Key Part 2</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
