betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
        <register>
          <name>PIO_MSKR2</name>
          <description>PIO Mask Register.</description>
          <addressOffset>0x080</addressOffset>
          <fields>
            <field>
              <name>MSK0</name>
              <description>Selects the I/O line 0 to be configured when writing the PIO Configuration Register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSK1</name>
              <description>Selects the I/O line 1 to be configured when writing the PIO Configuration Register.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSK2</name>
              <description>Selects the I/O line 2 to be configured when writing the PIO Configuration Register.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSK3</name>
              <description>Selects the I/O line 3 to be configured when writing the PIO Configuration Register.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSK4</name>
              <description>Selects the I/O line 4 to be configured when writing the PIO Configuration Register.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSK5</name>
              <description>Selects the I/O line 5 to be configured when writing the PIO Configuration Register.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSK6</name>
              <description>Selects the I/O line 6 to be configured when writing the PIO Configuration Register.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSK7</name>
              <description>Selects the I/O line 7 to be configured when writing the PIO Configuration Register.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSK8</name>
              <description>Selects the I/O line 8 to be configured when writing the PIO Configuration Register.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSK9</name>
              <description>Selects the I/O line 9 to be configured when writing the PIO Configuration Register.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSK10</name>
              <description>Selects the I/O line 10 to be configured when writing the PIO Configuration Register.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSK11</name>
              <description>Selects the I/O line 11 to be configured when writing the PIO Configuration Register.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSK12</name>
              <description>Selects the I/O line 12 to be configured when writing the PIO Configuration Register.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSK13</name>
              <description>Selects the I/O line 13 to be configured when writing the PIO Configuration Register.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSK14</name>
              <description>Selects the I/O line 14 to be configured when writing the PIO Configuration Register.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSK15</name>
              <description>Selects the I/O line 15 to be configured when writing the PIO Configuration Register.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSK16</name>
              <description>Selects the I/O line 16 to be configured when writing the PIO Configuration Register.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSK17</name>
              <description>Selects the I/O line 17 to be configured when writing the PIO Configuration Register.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSK18</name>
              <description>Selects the I/O line 18 to be configured when writing the PIO Configuration Register.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSK19</name>
              <description>Selects the I/O line 19 to be configured when writing the PIO Configuration Register.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSK20</name>
              <description>Selects the I/O line 20 to be configured when writing the PIO Configuration Register.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSK21</name>
              <description>Selects the I/O line 21 to be configured when writing the PIO Configuration Register.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSK22</name>
              <description>Selects the I/O line 22 to be configured when writing the PIO Configuration Register.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSK23</name>
              <description>Selects the I/O line 23 to be configured when writing the PIO Configuration Register.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSK24</name>
              <description>Selects the I/O line 24 to be configured when writing the PIO Configuration Register.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSK25</name>
              <description>Selects the I/O line 25 to be configured when writing the PIO Configuration Register.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSK26</name>
              <description>Selects the I/O line 26 to be configured when writing the PIO Configuration Register.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSK27</name>
              <description>Selects the I/O line 27 to be configured when writing the PIO Configuration Register.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSK28</name>
              <description>Selects the I/O line 28 to be configured when writing the PIO Configuration Register.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSK29</name>
              <description>Selects the I/O line 29 to be configured when writing the PIO Configuration Register.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSK30</name>
              <description>Selects the I/O line 30 to be configured when writing the PIO Configuration Register.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PIO_MSKR3</name>
          <description>PIO Mask Register.</description>
          <addressOffset>0x0C0</addressOffset>
          <fields>
            <field>
              <name>MSK0</name>
              <description>Selects the I/O line 0 to be configured when writing the PIO Configuration Register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSK1</name>
              <description>Selects the I/O line 1 to be configured when writing the PIO Configuration Register.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSK2</name>
              <description>Selects the I/O line 2 to be configured when writing the PIO Configuration Register.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSK3</name>
              <description>Selects the I/O line 3 to be configured when writing the PIO Configuration Register.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSK4</name>
              <description>Selects the I/O line 4 to be configured when writing the PIO Configuration Register.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSK5</name>
              <description>Selects the I/O line 5 to be configured when writing the PIO Configuration Register.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSK6</name>
              <description>Selects the I/O line 6 to be configured when writing the PIO Configuration Register.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSK7</name>
              <description>Selects the I/O line 7 to be configured when writing the PIO Configuration Register.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSK8</name>
              <description>Selects the I/O line 8 to be configured when writing the PIO Configuration Register.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSK9</name>
              <description>Selects the I/O line 9 to be configured when writing the PIO Configuration Register.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSK10</name>
              <description>Selects the I/O line 10 to be configured when writing the PIO Configuration Register.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSK11</name>
              <description>Selects the I/O line 11 to be configured when writing the PIO Configuration Register.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSK12</name>
              <description>Selects the I/O line 12 to be configured when writing the PIO Configuration Register.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSK13</name>
              <description>Selects the I/O line 13 to be configured when writing the PIO Configuration Register.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSK14</name>
              <description>Selects the I/O line 14 to be configured when writing the PIO Configuration Register.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSK15</name>
              <description>Selects the I/O line 15 to be configured when writing the PIO Configuration Register.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSK16</name>
              <description>Selects the I/O line 16 to be configured when writing the PIO Configuration Register.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSK17</name>
              <description>Selects the I/O line 17 to be configured when writing the PIO Configuration Register.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSK18</name>
              <description>Selects the I/O line 18 to be configured when writing the PIO Configuration Register.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSK19</name>
              <description>Selects the I/O line 19 to be configured when writing the PIO Configuration Register.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSK20</name>
              <description>Selects the I/O line 20 to be configured when writing the PIO Configuration Register.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSK21</name>
              <description>Selects the I/O line 21 to be configured when writing the PIO Configuration Register.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSK22</name>
              <description>Selects the I/O line 22 to be configured when writing the PIO Configuration Register.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSK23</name>
              <description>Selects the I/O line 23 to be configured when writing the PIO Configuration Register.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSK24</name>
              <description>Selects the I/O line 24 to be configured when writing the PIO Configuration Register.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSK25</name>
              <description>Selects the I/O line 25 to be configured when writing the PIO Configuration Register.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSK26</name>
              <description>Selects the I/O line 26 to be configured when writing the PIO Configuration Register.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSK27</name>
              <description>Selects the I/O line 27 to be configured when writing the PIO Configuration Register.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSK28</name>
              <description>Selects the I/O line 28 to be configured when writing the PIO Configuration Register.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSK29</name>
              <description>Selects the I/O line 29 to be configured when writing the PIO Configuration Register.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSK30</name>
              <description>Selects the I/O line 30 to be configured when writing the PIO Configuration Register.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
