betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
        <register>
          <name>PIO_CFGR0</name>
          <description>PIO Configuration Register.</description>
          <addressOffset>0x004</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ICFS</name>
              <description>Interrupt Configuration Freeze Status.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PCFS</name>
              <description>Physical Configuration Freeze Status.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EVTSEL</name>
              <description>Event Selection.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>EVTSEL</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>FALLING</name>
                  <description>Event detection on input falling edge.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING</name>
                  <description>Event detection on input rising edge.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Event detection on input both edge.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Event detection on low level input.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>Event detection on high level input.</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DRVSTR</name>
              <description>Drive Strength.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>DRVSTR</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>LO0</name>
                  <description>Low drive.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO1</name>
                  <description>Low drive.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ME</name>
                  <description>Medium drive.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HI</name>
                  <description>Medium drive.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCHMITT</name>
              <description>Schmitt Trigger.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>SCHMITT</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Schmitt trigger is enabled for the selected I/O lines.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Schmitt trigger is disabled for the selected I/O lines.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPD</name>
              <description>Open Drain.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>OPD</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Open drain is disabled for the selected I/O lines.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Open drain is enabled for the selected I/O lines.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IFSCEN</name>
              <description>Input Filter Slow Clock Enable.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>IFSCEN</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>The input filter is disabled for the selected I/O lines.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>The input filter is enabled for the selected I/O lines.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IFEN</name>
              <description>Input Filter Enable.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>IFEN</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>The input filter is disabled for the selected I/O lines.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>The input filter is enabled for the selected I/O lines.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDEN</name>
              <description>Pull-Down Enable.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>PDEN</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Pull-Up is disabled for the selected I/O lines.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Pull-Up is enabled for the selected I/O lines.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PUEN</name>
              <description>Pull-Up Enable.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>PUEN</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Pull-Up is disabled for the selected I/O lines.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Pull-Up is enabled for the selected I/O lines.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIR</name>
              <description>Direction.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>DIR</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>INPUT</name>
                  <description>The selected I/O lines are pure inputs.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTPUT</name>
                  <description>The selected I/O lines are enabled in output.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FUNC</name>
              <description>I/O Line Function.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>FUNC</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>GPIO</name>
                  <description>Selects GPIO mode for the selected I/O lines.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PERIPH_A</name>
                  <description>Selects peripheral A for the selected I/O lines.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PERIPH_B</name>
                  <description>Selects peripheral B for the selected I/O lines.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PERIPH_C</name>
                  <description>Selects peripheral C for the selected I/O lines.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PERIPH_D</name>
                  <description>Selects peripheral D for the selected I/O lines.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PERIPH_E</name>
                  <description>Selects peripheral E for the selected I/O lines.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PERIPH_F</name>
                  <description>Selects peripheral F for the selected I/O lines.</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PIO_CFGR1</name>
          <description>PIO Configuration Register.</description>
          <addressOffset>0x044</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ICFS</name>
              <description>Interrupt Configuration Freeze Status.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PCFS</name>
              <description>Physical Configuration Freeze Status.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EVTSEL</name>
              <description>Event Selection.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>EVTSEL</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>FALLING</name>
                  <description>Event detection on input falling edge.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING</name>
                  <description>Event detection on input rising edge.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Event detection on input both edge.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Event detection on low level input.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>Event detection on high level input.</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DRVSTR</name>
              <description>Drive Strength.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>DRVSTR</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>LO0</name>
                  <description>Low drive.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO1</name>
                  <description>Low drive.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ME</name>
                  <description>Medium drive.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HI</name>
                  <description>Medium drive.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCHMITT</name>
              <description>Schmitt Trigger.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>SCHMITT</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Schmitt trigger is enabled for the selected I/O lines.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Schmitt trigger is disabled for the selected I/O lines.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPD</name>
              <description>Open Drain.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>OPD</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Open drain is disabled for the selected I/O lines.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Open drain is enabled for the selected I/O lines.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IFSCEN</name>
              <description>Input Filter Slow Clock Enable.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>IFSCEN</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>The input filter is disabled for the selected I/O lines.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>The input filter is enabled for the selected I/O lines.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IFEN</name>
              <description>Input Filter Enable.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>IFEN</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>The input filter is disabled for the selected I/O lines.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>The input filter is enabled for the selected I/O lines.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDEN</name>
              <description>Pull-Down Enable.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>PDEN</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Pull-Up is disabled for the selected I/O lines.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Pull-Up is enabled for the selected I/O lines.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PUEN</name>
              <description>Pull-Up Enable.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>PUEN</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Pull-Up is disabled for the selected I/O lines.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Pull-Up is enabled for the selected I/O lines.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIR</name>
              <description>Direction.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>DIR</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>INPUT</name>
                  <description>The selected I/O lines are pure inputs.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTPUT</name>
                  <description>The selected I/O lines are enabled in output.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FUNC</name>
              <description>I/O Line Function.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>FUNC</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>GPIO</name>
                  <description>Selects GPIO mode for the selected I/O lines.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PERIPH_A</name>
                  <description>Selects peripheral A for the selected I/O lines.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PERIPH_B</name>
                  <description>Selects peripheral B for the selected I/O lines.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PERIPH_C</name>
                  <description>Selects peripheral C for the selected I/O lines.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PERIPH_D</name>
                  <description>Selects peripheral D for the selected I/O lines.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PERIPH_E</name>
                  <description>Selects peripheral E for the selected I/O lines.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PERIPH_F</name>
                  <description>Selects peripheral F for the selected I/O lines.</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
