betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
        <register>
          <name>PIO_IOFR3</name>
          <description>PIO Freeze Configuration Register.</description>
          <addressOffset>0x0FC</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>FRZKEY</name>
              <description>Freeze Key.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <enumeratedValues>
                <name>FRZKEY</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>PASSWD</name>
                  <description>Freeze key.</description>
                  <value>0x494F46</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FINT</name>
              <description>Freeze Interrupt Configuration.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>FINT</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No effect.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FREEZE</name>
                  <description>Freezes the following configuration of Non-Secure I/O lines if FRZKEY corresponds to 0x494F46, ("IOF" in ASCII): IFEN, IFSCEN and EVTSEL.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FPHY</name>
              <description>Freeze Physical Configuration.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>FPHY</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No effect.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FREEZE</name>
                  <description>Freezes the following configuration of Non-Secure I/O lines if FRZKEY corresponds to 0x494F46, ("IOF" in ASCII): FUNC, DIR, PUEN, PDEN, OPD, SCHMITT and DRVSTR.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PIT</name>
      <description>Periodic Interval Timer</description>
      <baseAddress>0xF8048030</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>MR</name>
          <description>Mode Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PIV</name>
              <description>Periodic Interval Value</description>
              <bitRange>[19:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1048575</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PITEN</name>
              <description>Period Interval Timer Enabled</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PITIEN</name>
              <description>Periodic Interval Timer Interrupt Enable</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PIIR</name>
          <description>Periodic Interval Image Register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>CPIV</name>
              <description>Current Periodic Interval Value</description>
              <bitRange>[19:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1048575</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PICNT</name>
              <description>Periodic Interval Counter</description>
              <bitRange>[31:20]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PIVR</name>
          <description>Periodic Interval Value Register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>CPIV</name>
              <description>Current Periodic Interval Value</description>
              <bitRange>[19:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1048575</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PICNT</name>
              <description>Periodic Interval Counter</description>
              <bitRange>[31:20]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>Status Register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>PITS</name>
              <description>Periodic Interval Timer Status</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
