betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PMC</name>
      <description>Power Management Controller</description>
      <baseAddress>0xF0014000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x1C</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x30</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x38</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x40</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x60</offset>
        <size>0x1C</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x80</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xE4</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x100</offset>
        <size>0x24</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x134</offset>
        <size>0x20</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CKGR_MCFR</name>
          <description>Main Clock Frequency Register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MAINF</name>
              <description>Main Clock Frequency</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MAINFRDY</name>
              <description>Main Clock Frequency Measure Ready</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RCMEAS</name>
              <description>RC Oscillator Frequency Measure (write-only)</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CCSS</name>
              <description>Counter Clock Source Selection</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CKGR_MOR</name>
          <description>Main Oscillator Register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MOSCXTEN</name>
              <description>8 to 24 MHz Crystal Oscillator Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MOSCXTBY</name>
              <description>8 to 24 MHz Crystal Oscillator Bypass</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WAITMODE</name>
              <description>Wait Mode Command (Write-only)</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MOSCRCEN</name>
              <description>12 MHz RC Oscillator Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ONE</name>
              <description>Must Be Set to 1</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MOSCXTST</name>
              <description>8 to 24 MHz Crystal Oscillator Startup Time</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>KEY</name>
              <description>Password</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PASSWD</name>
                  <description>Writing any other value in this field aborts the write operation.</description>
                  <value>55</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MOSCSEL</name>
              <description>Main Clock Oscillator Selection</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFDEN</name>
              <description>Clock Failure Detector Enable</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CKGR_PLLAR</name>
          <description>PLLA Register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DIVA</name>
              <description>Divider A</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PLLACOUNT</name>
              <description>PLLA Counter</description>
              <bitRange>[13:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>OUTA</name>
              <description>PLLA Clock Frequency Range</description>
              <bitRange>[17:14]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MULA</name>
              <description>PLLA Multiplier</description>
              <bitRange>[24:18]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ONE</name>
              <description>Must Be Set to 1</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CKGR_UCKR</name>
          <description>UTMI Clock Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>UPLLEN</name>
              <description>UTMI PLL Enable</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UPLLCOUNT</name>
              <description>UTMI PLL Startup Time</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BIASEN</name>
              <description>UTMI BIAS Enable</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BIASCOUNT</name>
              <description>UTMI BIAS Startup Time</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PMC_AUDIO_PLL0</name>
          <description>Audio PLL Register 0</description>
          <addressOffset>0x14C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PLLEN</name>
              <description>PLL Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PADEN</name>
              <description>Pad Clock Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PMCEN</name>
              <description>PMC Clock Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESETN</name>
              <description>Audio PLL Reset</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PLLFLT</name>
              <description>PLL Loop Filter Selection</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ND</name>
              <description>Loop Divider Ratio</description>
              <bitRange>[14:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>QDPMC</name>
              <description>Output Divider Ratio for PMC Clock</description>
              <bitRange>[22:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DCO_FILTER</name>
              <description>Digitally Controlled Oscillator Filter Selection</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DCO_GAIN</name>
              <description>Digitally Controlled Oscillator Gain Selection</description>
              <bitRange>[29:28]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PMC_AUDIO_PLL1</name>
          <description>Audio PLL Register 1</description>
          <addressOffset>0x150</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FRACR</name>
              <description>Fractional Loop Divider Setting</description>
              <bitRange>[21:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4194303</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DIV</name>
              <description>Divider Value</description>
              <bitRange>[25:24]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV2</name>
                  <description>Divide by 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV3</name>
                  <description>Divide by 3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QDAUDIO</name>
              <description>Output Divider Ratio for Pad Clock</description>
              <bitRange>[30:26]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PMC_FOCR</name>
          <description>Fault Output Clear Register</description>
          <addressOffset>0x78</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>FOCLR</name>
              <description>Fault Output Clear</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMC_FSMR</name>
          <description>Fast Startup Mode Register</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FSTT0</name>
              <description>Fast Startup from WKUP Pin Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FSTT1</name>
              <description>Fast Startup from Security Module Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FSTT2</name>
              <description>Fast Startup from PIOBU0-7 Input Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FSTT3</name>
              <description>Fast Startup from PIOBU0-7 Input Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FSTT4</name>
              <description>Fast Startup from PIOBU0-7 Input Enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FSTT5</name>
              <description>Fast Startup from PIOBU0-7 Input Enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FSTT6</name>
              <description>Fast Startup from PIOBU0-7 Input Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FSTT7</name>
              <description>Fast Startup from PIOBU0-7 Input Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FSTT8</name>
              <description>Fast Startup from PIOBU0-7 Input Enable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FSTT9</name>
              <description>Fast Startup from PIOBU0-7 Input Enable</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FSTT10</name>
              <description>Fast Start-up from GMAC Wake-up On LAN Enable</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCAL</name>
              <description>Fast Startup from RTC Alarm Enable</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>USBAL</name>
              <description>Fast Startup from USB Resume Enable</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SDMMC_CD</name>
              <description>Fast Startup from SDMMC Card Detect Enable</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LPM</name>
              <description>Low-power Mode</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXLP_MCE</name>
              <description>Fast Startup from Backup UART Receive Match Condition Enable</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ACC_CE</name>
              <description>Fast Startup from Analog Comparator Controller Comparison Enable</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMC_FSPR</name>
          <description>Fast Startup Polarity Register</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FSTP0</name>
              <description>WKUP Pin Polarity for Fast Startup</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FSTP1</name>
              <description>Security Module Polarity for Fast Startup</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FSTP2</name>
              <description>PIOBU0-7 Pin Polarity for Fast Startup</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FSTP3</name>
              <description>PIOBU0-7 Pin Polarity for Fast Startup</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FSTP4</name>
              <description>PIOBU0-7 Pin Polarity for Fast Startup</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FSTP5</name>
              <description>PIOBU0-7 Pin Polarity for Fast Startup</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FSTP6</name>
              <description>PIOBU0-7 Pin Polarity for Fast Startup</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FSTP7</name>
              <description>PIOBU0-7 Pin Polarity for Fast Startup</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FSTP8</name>
              <description>PIOBU0-7 Pin Polarity for Fast Startup</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FSTP9</name>
              <description>PIOBU0-7 Pin Polarity for Fast Startup</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FSTP10</name>
              <description>GMAC Wake-up On LAN Polarity for Fast Start-up</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
