betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
        <register>
          <name>PMC_IDR</name>
          <description>Interrupt Disable Register</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>MOSCXTS</name>
              <description>8 to 24 MHz Crystal Oscillator Status Interrupt Disable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCKA</name>
              <description>PLLA Lock Interrupt Disable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MCKRDY</name>
              <description>Master Clock Ready Interrupt Disable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCKU</name>
              <description>UTMI PLL Lock Interrupt Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PCKRDY0</name>
              <description>Programmable Clock Ready 0 Interrupt Disable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PCKRDY1</name>
              <description>Programmable Clock Ready 1 Interrupt Disable</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PCKRDY2</name>
              <description>Programmable Clock Ready 2 Interrupt Disable</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MOSCSELS</name>
              <description>Main Oscillator Clock Source Selection Status Interrupt Disable</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MOSCRCS</name>
              <description>12 MHz RC Oscillator Status Interrupt Disable</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFDEV</name>
              <description>Clock Failure Detector Event Interrupt Disable</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMC_IER</name>
          <description>Interrupt Enable Register</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>MOSCXTS</name>
              <description>8 to 24 MHz Crystal Oscillator Status Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCKA</name>
              <description>PLLA Lock Interrupt Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MCKRDY</name>
              <description>Master Clock Ready Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCKU</name>
              <description>UTMI PLL Lock Interrupt Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PCKRDY0</name>
              <description>Programmable Clock Ready 0 Interrupt Enable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PCKRDY1</name>
              <description>Programmable Clock Ready 1 Interrupt Enable</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PCKRDY2</name>
              <description>Programmable Clock Ready 2 Interrupt Enable</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MOSCSELS</name>
              <description>Main Clock Source Oscillator Selection Status Interrupt Enable</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MOSCRCS</name>
              <description>12 MHz RC Oscillator Status Interrupt Enable</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFDEV</name>
              <description>Clock Failure Detector Event Interrupt Enable</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMC_IMR</name>
          <description>Interrupt Mask Register</description>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>MOSCXTS</name>
              <description>8 to 24 MHz Crystal Oscillator Status Interrupt Mask</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCKA</name>
              <description>PLLA Lock Interrupt Mask</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MCKRDY</name>
              <description>Master Clock Ready Interrupt Mask</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PCKRDY0</name>
              <description>Programmable Clock Ready 0 Interrupt Mask</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PCKRDY1</name>
              <description>Programmable Clock Ready 1 Interrupt Mask</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PCKRDY2</name>
              <description>Programmable Clock Ready 2 Interrupt Mask</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MOSCSELS</name>
              <description>Main Oscillator Clock Source Selection Status Interrupt Mask</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MOSCRCS</name>
              <description>12 MHz RC Oscillator Status Interrupt Mask</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFDEV</name>
              <description>Clock Failure Detector Event Interrupt Mask</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMC_MCKR</name>
          <description>Master Clock Register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CSS</name>
              <description>Master/Processor Clock Source Selection</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SLOW_CLK</name>
                  <description>Slow clock is selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAIN_CLK</name>
                  <description>Main clock is selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLLA_CLK</name>
                  <description>PLLACK is selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UPLL_CLK</name>
                  <description>UPLL Clock is selected</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRES</name>
              <description>Master/Processor Clock Prescaler</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLOCK</name>
                  <description>Selected clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLOCK_DIV2</name>
                  <description>Selected clock divided by 2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLOCK_DIV4</name>
                  <description>Selected clock divided by 4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLOCK_DIV8</name>
                  <description>Selected clock divided by 8</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLOCK_DIV16</name>
                  <description>Selected clock divided by 16</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLOCK_DIV32</name>
                  <description>Selected clock divided by 32</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLOCK_DIV64</name>
                  <description>Selected clock divided by 64</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MDIV</name>
              <description>Master Clock Division</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EQ_PCK</name>
                  <description>Master Clock is Prescaler Output Clock divided by 1.Warning: DDRCK is not available.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PCK_DIV2</name>
                  <description>Master Clock is Prescaler Output Clock divided by 2. DDRCK is equal to MCK.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PCK_DIV4</name>
                  <description>Master Clock is Prescaler Output Clock divided by 4. DDRCK is equal to MCK.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PCK_DIV3</name>
                  <description>Master Clock is Prescaler Output Clock divided by 3. DDRCK is equal to MCK.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLLADIV2</name>
              <description>PLLA Divisor by 2</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>H32MXDIV</name>
              <description>AHB 32-bit Matrix Divisor</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>H32MXDIV1</name>
                  <description>The AHB 32-bit Matrix frequency is equal to the AHB 64-bit Matrix frequency. It is possible only if the AHB 64-bit Matrix frequency does not exceed 83 MHz.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>H32MXDIV2</name>
                  <description>The AHB 32-bit Matrix frequency is equal to the AHB 64-bit Matrix frequency divided by 2.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PMC_OCR</name>
          <description>Oscillator Calibration Register</description>
          <addressOffset>0x110</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CAL</name>
              <description>12 MHz RC Oscillator Calibration Bits</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SEL</name>
              <description>Selection of RC Oscillator Calibration Bits</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMC_PCDR0</name>
          <description>Peripheral Clock Disable Register 0</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>PID2</name>
              <description>Peripheral Clock 2 Disable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID3</name>
              <description>Peripheral Clock 3 Disable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID4</name>
              <description>Peripheral Clock 4 Disable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID5</name>
              <description>Peripheral Clock 5 Disable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID6</name>
              <description>Peripheral Clock 6 Disable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID7</name>
              <description>Peripheral Clock 7 Disable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID8</name>
              <description>Peripheral Clock 8 Disable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID9</name>
              <description>Peripheral Clock 9 Disable</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID10</name>
              <description>Peripheral Clock 10 Disable</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID11</name>
              <description>Peripheral Clock 11 Disable</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID12</name>
              <description>Peripheral Clock 12 Disable</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID13</name>
              <description>Peripheral Clock 13 Disable</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID14</name>
              <description>Peripheral Clock 14 Disable</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID15</name>
              <description>Peripheral Clock 15 Disable</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID16</name>
              <description>Peripheral Clock 16 Disable</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID17</name>
              <description>Peripheral Clock 17 Disable</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID18</name>
              <description>Peripheral Clock 18 Disable</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID19</name>
              <description>Peripheral Clock 19 Disable</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID20</name>
              <description>Peripheral Clock 20 Disable</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID21</name>
              <description>Peripheral Clock 21 Disable</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID22</name>
              <description>Peripheral Clock 22 Disable</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID23</name>
              <description>Peripheral Clock 23 Disable</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID24</name>
              <description>Peripheral Clock 24 Disable</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID25</name>
              <description>Peripheral Clock 25 Disable</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID26</name>
              <description>Peripheral Clock 26 Disable</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID27</name>
              <description>Peripheral Clock 27 Disable</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID28</name>
              <description>Peripheral Clock 28 Disable</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID29</name>
              <description>Peripheral Clock 29 Disable</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID30</name>
              <description>Peripheral Clock 30 Disable</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID31</name>
              <description>Peripheral Clock 31 Disable</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
