betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
        <register>
          <name>PMC_PCK</name>
          <description>Programmable Clock 0 Register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CSS</name>
              <description>Master Clock Source Selection</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SLOW_CLK</name>
                  <description>Slow clock is selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAIN_CLK</name>
                  <description>Main clock is selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLLA_CLK</name>
                  <description>PLLACK is selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UPLL_CLK</name>
                  <description>UPLL Clock is selected</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK_CLK</name>
                  <description>Master Clock is selected</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUDIO_CLK</name>
                  <description>Audio PLL clock is selected</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRES</name>
              <description>Programmable Clock Prescaler</description>
              <bitRange>[11:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PMC_PCR</name>
          <description>Peripheral Control Register</description>
          <addressOffset>0x10C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PID</name>
              <description>Peripheral ID</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>GCKCSS</name>
              <description>Generic Clock Source Selection</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SLOW_CLK</name>
                  <description>Slow clock is selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAIN_CLK</name>
                  <description>Main clock is selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLLA_CLK</name>
                  <description>PLLACK is selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UPLL_CLK</name>
                  <description>UPLL Clock is selected</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK_CLK</name>
                  <description>Master Clock is selected</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUDIO_CLK</name>
                  <description>Audio PLL clock is selected</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMD</name>
              <description>Command</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GCKDIV</name>
              <description>Generic Clock Division Ratio</description>
              <bitRange>[27:20]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GCKEN</name>
              <description>Generic Clock Enable</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMC_PCSR0</name>
          <description>Peripheral Clock Status Register 0</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>PID2</name>
              <description>Peripheral Clock 2 Status</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID3</name>
              <description>Peripheral Clock 3 Status</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID4</name>
              <description>Peripheral Clock 4 Status</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID5</name>
              <description>Peripheral Clock 5 Status</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID6</name>
              <description>Peripheral Clock 6 Status</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID7</name>
              <description>Peripheral Clock 7 Status</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID8</name>
              <description>Peripheral Clock 8 Status</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID9</name>
              <description>Peripheral Clock 9 Status</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID10</name>
              <description>Peripheral Clock 10 Status</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID11</name>
              <description>Peripheral Clock 11 Status</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID12</name>
              <description>Peripheral Clock 12 Status</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID13</name>
              <description>Peripheral Clock 13 Status</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID14</name>
              <description>Peripheral Clock 14 Status</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID15</name>
              <description>Peripheral Clock 15 Status</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID16</name>
              <description>Peripheral Clock 16 Status</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID17</name>
              <description>Peripheral Clock 17 Status</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID18</name>
              <description>Peripheral Clock 18 Status</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID19</name>
              <description>Peripheral Clock 19 Status</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID20</name>
              <description>Peripheral Clock 20 Status</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID21</name>
              <description>Peripheral Clock 21 Status</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID22</name>
              <description>Peripheral Clock 22 Status</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID23</name>
              <description>Peripheral Clock 23 Status</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID24</name>
              <description>Peripheral Clock 24 Status</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID25</name>
              <description>Peripheral Clock 25 Status</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID26</name>
              <description>Peripheral Clock 26 Status</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID27</name>
              <description>Peripheral Clock 27 Status</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID28</name>
              <description>Peripheral Clock 28 Status</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID29</name>
              <description>Peripheral Clock 29 Status</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID30</name>
              <description>Peripheral Clock 30 Status</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID31</name>
              <description>Peripheral Clock 31 Status</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMC_PCSR1</name>
          <description>Peripheral Clock Status Register 1</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>PID32</name>
              <description>Peripheral Clock 32 Status</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID33</name>
              <description>Peripheral Clock 33 Status</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID34</name>
              <description>Peripheral Clock 34 Status</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID35</name>
              <description>Peripheral Clock 35 Status</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID36</name>
              <description>Peripheral Clock 36 Status</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID37</name>
              <description>Peripheral Clock 37 Status</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID38</name>
              <description>Peripheral Clock 38 Status</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID39</name>
              <description>Peripheral Clock 39 Status</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID40</name>
              <description>Peripheral Clock 40 Status</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID41</name>
              <description>Peripheral Clock 41 Status</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID42</name>
              <description>Peripheral Clock 42 Status</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID43</name>
              <description>Peripheral Clock 43 Status</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID44</name>
              <description>Peripheral Clock 44 Status</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID45</name>
              <description>Peripheral Clock 45 Status</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID46</name>
              <description>Peripheral Clock 46 Status</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID47</name>
              <description>Peripheral Clock 47 Status</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID48</name>
              <description>Peripheral Clock 48 Status</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID49</name>
              <description>Peripheral Clock 49 Status</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID50</name>
              <description>Peripheral Clock 50 Status</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID51</name>
              <description>Peripheral Clock 51 Status</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID52</name>
              <description>Peripheral Clock 52 Status</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID53</name>
              <description>Peripheral Clock 53 Status</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID54</name>
              <description>Peripheral Clock 54 Status</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID55</name>
              <description>Peripheral Clock 55 Status</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID56</name>
              <description>Peripheral Clock 56 Status</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID57</name>
              <description>Peripheral Clock 57 Status</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID58</name>
              <description>Peripheral Clock 58 Status</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID59</name>
              <description>Peripheral Clock 59 Status</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID60</name>
              <description>Peripheral Clock 60 Status</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID61</name>
              <description>Peripheral Clock 61 Status</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID62</name>
              <description>Peripheral Clock 62 Status</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID63</name>
              <description>Peripheral Clock 63 Status</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMC_PLLICPR</name>
          <description>PLL Charge Pump Current Register</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ICP_PLLA</name>
              <description>Charge Pump Current</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ICP_PLLU</name>
              <description>Charge Pump Current PLL UTMI</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>IVCO_PLLU</name>
              <description>Voltage Control Output Current PLL UTMI</description>
              <bitRange>[25:24]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
