betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
        <register>
          <name>PMC_SCDR</name>
          <description>System Clock Disable Register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>PCK</name>
              <description>Processor Clock Disable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DDRCK</name>
              <description>DDR Clock Disable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCK</name>
              <description>MCK2x Clock Disable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UHP</name>
              <description>USB Host OHCI Clock Disable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UDP</name>
              <description>USB Device Clock Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PCK0</name>
              <description>Programmable Clock 0 Output Disable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PCK1</name>
              <description>Programmable Clock 1 Output Disable</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PCK2</name>
              <description>Programmable Clock 2 Output Disable</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ISCCK</name>
              <description>ISC Clock Disable</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMC_SCER</name>
          <description>System Clock Enable Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>DDRCK</name>
              <description>DDR Clock Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCK</name>
              <description>MCK2x Clock Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UHP</name>
              <description>USB Host OHCI Clocks Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UDP</name>
              <description>USB Device Clock Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PCK0</name>
              <description>Programmable Clock 0 Output Enable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PCK1</name>
              <description>Programmable Clock 1 Output Enable</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PCK2</name>
              <description>Programmable Clock 2 Output Enable</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ISCCK</name>
              <description>ISC Clock Enable</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMC_SCSR</name>
          <description>System Clock Status Register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>PCK</name>
              <description>Processor Clock Status</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DDRCK</name>
              <description>DDR Clock Status</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCK</name>
              <description>MCK2x Clock Status</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UHP</name>
              <description>USB Host Port Clock Status</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UDP</name>
              <description>USB Device Port Clock Status</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PCK0</name>
              <description>Programmable Clock 0 Output Status</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PCK1</name>
              <description>Programmable Clock 1 Output Status</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PCK2</name>
              <description>Programmable Clock 2 Output Status</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ISCCK</name>
              <description>ISC Clock Status</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMC_SLPWKCR</name>
          <description>SleepWalking Control Register</description>
          <addressOffset>0x148</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PID</name>
              <description>Peripheral ID</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CMD</name>
              <description>Command</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ASR</name>
              <description>Activity Status Register</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SLPWKSR</name>
              <description>SleepWalking Status Register</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMC_SLPWK_AIPR</name>
          <description>SleepWalking Activity In Progress Register</description>
          <addressOffset>0x144</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>AIP</name>
              <description>Activity In Progress</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMC_SLPWK_ASR0</name>
          <description>SleepWalking Activity Status Register 0</description>
          <addressOffset>0x120</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>PID19</name>
              <description>Peripheral 19 Activity Status</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID20</name>
              <description>Peripheral 20 Activity Status</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID21</name>
              <description>Peripheral 21 Activity Status</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID22</name>
              <description>Peripheral 22 Activity Status</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID23</name>
              <description>Peripheral 23 Activity Status</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID24</name>
              <description>Peripheral 24 Activity Status</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID25</name>
              <description>Peripheral 25 Activity Status</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID26</name>
              <description>Peripheral 26 Activity Status</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID27</name>
              <description>Peripheral 27 Activity Status</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID28</name>
              <description>Peripheral 28 Activity Status</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID29</name>
              <description>Peripheral 29 Activity Status</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID30</name>
              <description>Peripheral 30 Activity Status</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMC_SLPWK_ASR1</name>
          <description>SleepWalking Activity Status Register 1</description>
          <addressOffset>0x140</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>PID33</name>
              <description>Peripheral 33 Activity Status</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID34</name>
              <description>Peripheral 34 Activity Status</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID40</name>
              <description>Peripheral 40 Activity Status</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMC_SLPWK_DR0</name>
          <description>SleepWalking Disable Register 0</description>
          <addressOffset>0x118</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>PID19</name>
              <description>Peripheral 19 SleepWalking Disable</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID20</name>
              <description>Peripheral 20 SleepWalking Disable</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID21</name>
              <description>Peripheral 21 SleepWalking Disable</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID22</name>
              <description>Peripheral 22 SleepWalking Disable</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID23</name>
              <description>Peripheral 23 SleepWalking Disable</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID24</name>
              <description>Peripheral 24 SleepWalking Disable</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID25</name>
              <description>Peripheral 25 SleepWalking Disable</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID26</name>
              <description>Peripheral 26 SleepWalking Disable</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID27</name>
              <description>Peripheral 27 SleepWalking Disable</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID28</name>
              <description>Peripheral 28 SleepWalking Disable</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID29</name>
              <description>Peripheral 29 SleepWalking Disable</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID30</name>
              <description>Peripheral 30 SleepWalking Disable</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMC_SLPWK_DR1</name>
          <description>SleepWalking Disable Register 1</description>
          <addressOffset>0x138</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>PID33</name>
              <description>Peripheral 33 SleepWalking Disable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID34</name>
              <description>Peripheral 34 SleepWalking Disable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID40</name>
              <description>Peripheral 40 SleepWalking Disable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMC_SLPWK_ER0</name>
          <description>SleepWalking Enable Register 0</description>
          <addressOffset>0x114</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>PID19</name>
              <description>Peripheral 19 SleepWalking Enable</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID20</name>
              <description>Peripheral 20 SleepWalking Enable</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID21</name>
              <description>Peripheral 21 SleepWalking Enable</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID22</name>
              <description>Peripheral 22 SleepWalking Enable</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID23</name>
              <description>Peripheral 23 SleepWalking Enable</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID24</name>
              <description>Peripheral 24 SleepWalking Enable</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID25</name>
              <description>Peripheral 25 SleepWalking Enable</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID26</name>
              <description>Peripheral 26 SleepWalking Enable</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID27</name>
              <description>Peripheral 27 SleepWalking Enable</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID28</name>
              <description>Peripheral 28 SleepWalking Enable</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID29</name>
              <description>Peripheral 29 SleepWalking Enable</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID30</name>
              <description>Peripheral 30 SleepWalking Enable</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMC_SLPWK_ER1</name>
          <description>SleepWalking Enable Register 1</description>
          <addressOffset>0x134</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>PID33</name>
              <description>Peripheral 33 SleepWalking Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID34</name>
              <description>Peripheral 34 SleepWalking Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID40</name>
              <description>Peripheral 40 SleepWalking Enable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMC_SLPWK_SR0</name>
          <description>SleepWalking Status Register 0</description>
          <addressOffset>0x11C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>PID19</name>
              <description>Peripheral 19 SleepWalking Status</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID20</name>
              <description>Peripheral 20 SleepWalking Status</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID21</name>
              <description>Peripheral 21 SleepWalking Status</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID22</name>
              <description>Peripheral 22 SleepWalking Status</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID23</name>
              <description>Peripheral 23 SleepWalking Status</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID24</name>
              <description>Peripheral 24 SleepWalking Status</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID25</name>
              <description>Peripheral 25 SleepWalking Status</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID26</name>
              <description>Peripheral 26 SleepWalking Status</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID27</name>
              <description>Peripheral 27 SleepWalking Status</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID28</name>
              <description>Peripheral 28 SleepWalking Status</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID29</name>
              <description>Peripheral 29 SleepWalking Status</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PID30</name>
              <description>Peripheral 30 SleepWalking Status</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
