betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PTC</name>
      <description>Peripheral Touch Controller</description>
      <baseAddress>0xFC060028</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xD</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CMD</name>
          <description>PTC Command Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CMD</name>
              <description>Host Command</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_ACTION</name>
                  <description>-</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP</name>
                  <description>Waits for ongoing execution to complete, then stops.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REST</name>
                  <description>Stops and resets</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ABORT</name>
                  <description>Stops without waiting for ongoing execution to complete.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN</name>
                  <description>Starts execution (from stopped state)</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IED</name>
          <description>PTC Enable Register</description>
          <addressOffset>0xD</addressOffset>
          <size>0x8</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>IER0</name>
              <description>IER0</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IER1</name>
              <description>IER1</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IER2</name>
              <description>IER2</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IER3</name>
              <description>IER3</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ISR</name>
          <description>PTC Interrupt Status Register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>NOTIFY0</name>
              <description>Notification to the Firmware</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IRQ0</name>
              <description>IRQ0</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IRQ1</name>
              <description>IRQ1</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IRQ2</name>
              <description>IRQ2</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IRQ3</name>
              <description>IRQ3</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PWM</name>
      <description>Pulse Width Modulation Controller</description>
      <baseAddress>0xF802C000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x70</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x7C</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xA0</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xB0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xE4</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x400</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x420</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x42C</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x440</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x460</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CLK</name>
          <description>PWM Clock Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DIVA</name>
              <description>CLKA Divide Factor</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLKA_POFF</name>
                  <description>CLKA clock is turned off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PREA</name>
                  <description>CLKA clock is clock selected by PREA</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PREA</name>
              <description>CLKA Source Clock Selection</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLK</name>
                  <description>Peripheral clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_DIV2</name>
                  <description>Peripheral clock/2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_DIV4</name>
                  <description>Peripheral clock/4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_DIV8</name>
                  <description>Peripheral clock/8</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_DIV16</name>
                  <description>Peripheral clock/16</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_DIV32</name>
                  <description>Peripheral clock/32</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_DIV64</name>
                  <description>Peripheral clock/64</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_DIV128</name>
                  <description>Peripheral clock/128</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_DIV256</name>
                  <description>Peripheral clock/256</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_DIV512</name>
                  <description>Peripheral clock/512</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_DIV1024</name>
                  <description>Peripheral clock/1024</description>
                  <value>10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIVB</name>
              <description>CLKB Divide Factor</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLKB_POFF</name>
                  <description>CLKB clock is turned off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PREB</name>
                  <description>CLKB clock is clock selected by PREB</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PREB</name>
              <description>CLKB Source Clock Selection</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLK</name>
                  <description>Peripheral clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_DIV2</name>
                  <description>Peripheral clock/2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_DIV4</name>
                  <description>Peripheral clock/4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_DIV8</name>
                  <description>Peripheral clock/8</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_DIV16</name>
                  <description>Peripheral clock/16</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_DIV32</name>
                  <description>Peripheral clock/32</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_DIV64</name>
                  <description>Peripheral clock/64</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_DIV128</name>
                  <description>Peripheral clock/128</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_DIV256</name>
                  <description>Peripheral clock/256</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_DIV512</name>
                  <description>Peripheral clock/512</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_DIV1024</name>
                  <description>Peripheral clock/1024</description>
                  <value>10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CMUPD0</name>
          <description>PWM Channel Mode Update Register (ch_num = 0)</description>
          <addressOffset>0x400</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CPOLUP</name>
              <description>Channel Polarity Update</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CPOLINVUP</name>
              <description>Channel Polarity Inversion Update</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMUPD1</name>
          <description>PWM Channel Mode Update Register (ch_num = 1)</description>
          <addressOffset>0x420</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CPOLUP</name>
              <description>Channel Polarity Update</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CPOLINVUP</name>
              <description>Channel Polarity Inversion Update</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMUPD2</name>
          <description>PWM Channel Mode Update Register (ch_num = 2)</description>
          <addressOffset>0x440</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CPOLUP</name>
              <description>Channel Polarity Update</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CPOLINVUP</name>
              <description>Channel Polarity Inversion Update</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMUPD3</name>
          <description>PWM Channel Mode Update Register (ch_num = 3)</description>
          <addressOffset>0x460</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CPOLUP</name>
              <description>Channel Polarity Update</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CPOLINVUP</name>
              <description>Channel Polarity Inversion Update</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIS</name>
          <description>PWM Disable Register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CHID0</name>
              <description>Channel ID</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHID1</name>
              <description>Channel ID</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHID2</name>
              <description>Channel ID</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHID3</name>
              <description>Channel ID</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAR</name>
          <description>PWM DMA Register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>DMADUTY</name>
              <description>Duty-Cycle Holding Register for DMA Access</description>
              <bitRange>[23:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>16777215</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ELMR</name>
          <description>PWM Event Line 0 Mode Register</description>
          <addressOffset>0x7C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CSEL0</name>
              <description>Comparison 0 Selection</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CSEL1</name>
              <description>Comparison 1 Selection</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CSEL2</name>
              <description>Comparison 2 Selection</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CSEL3</name>
              <description>Comparison 3 Selection</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CSEL4</name>
              <description>Comparison 4 Selection</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CSEL5</name>
              <description>Comparison 5 Selection</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CSEL6</name>
              <description>Comparison 6 Selection</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CSEL7</name>
              <description>Comparison 7 Selection</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ENA</name>
          <description>PWM Enable Register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CHID0</name>
              <description>Channel ID</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHID1</name>
              <description>Channel ID</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHID2</name>
              <description>Channel ID</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHID3</name>
              <description>Channel ID</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
