betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
        <register>
          <name>ETRG1</name>
          <description>PWM External Trigger Register 1</description>
          <addressOffset>0x42C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MAXCNT</name>
              <description>Maximum Counter value</description>
              <bitRange>[23:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>16777215</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TRGMODE</name>
              <description>External Trigger Mode</description>
              <bitRange>[25:24]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>External trigger is not enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE1</name>
                  <description>External PWM Reset Mode</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE2</name>
                  <description>External PWM Start Mode</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE3</name>
                  <description>Cycle-by-cycle Duty Mode</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRGEDGE</name>
              <description>Edge Selection</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FALLING_ZERO</name>
                  <description>TRGMODE = 1: TRGINx event detection on falling edge.TRGMODE = 2, 3: TRGINx active level is 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING_ONE</name>
                  <description>TRGMODE = 1: TRGINx event detection on rising edge.TRGMODE = 2, 3: TRGINx active level is 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRGFILT</name>
              <description>Filtered input</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TRGSRC</name>
              <description>Trigger Source</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RFEN</name>
              <description>Recoverable Fault Enable</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETRG2</name>
          <description>PWM External Trigger Register 2</description>
          <addressOffset>0x434</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MAXCNT</name>
              <description>Maximum Counter value</description>
              <bitRange>[23:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>16777215</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TRGMODE</name>
              <description>External Trigger Mode</description>
              <bitRange>[25:24]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>External trigger is not enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE1</name>
                  <description>External PWM Reset Mode</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE2</name>
                  <description>External PWM Start Mode</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE3</name>
                  <description>Cycle-by-cycle Duty Mode</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRGEDGE</name>
              <description>Edge Selection</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FALLING_ZERO</name>
                  <description>TRGMODE = 1: TRGINx event detection on falling edge.TRGMODE = 2, 3: TRGINx active level is 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING_ONE</name>
                  <description>TRGMODE = 1: TRGINx event detection on rising edge.TRGMODE = 2, 3: TRGINx active level is 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRGFILT</name>
              <description>Filtered input</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TRGSRC</name>
              <description>Trigger Source</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RFEN</name>
              <description>Recoverable Fault Enable</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCR</name>
          <description>PWM Fault Clear Register</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>FCLR</name>
              <description>Fault Clear</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>FMR</name>
          <description>PWM Fault Mode Register</description>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FPOL</name>
              <description>Fault Polarity</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FMOD</name>
              <description>Fault Activation Mode</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FFIL</name>
              <description>Fault Filtering</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>FPE</name>
          <description>PWM Fault Protection Enable Register</description>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FPE0</name>
              <description>Fault Protection Enable for channel 0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FPE1</name>
              <description>Fault Protection Enable for channel 1</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FPE2</name>
              <description>Fault Protection Enable for channel 2</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FPE3</name>
              <description>Fault Protection Enable for channel 3</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>FPV1</name>
          <description>PWM Fault Protection Value Register 1</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FPVH0</name>
              <description>Fault Protection Value for PWMH output on channel 0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FPVH1</name>
              <description>Fault Protection Value for PWMH output on channel 1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FPVH2</name>
              <description>Fault Protection Value for PWMH output on channel 2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FPVH3</name>
              <description>Fault Protection Value for PWMH output on channel 3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FPVL0</name>
              <description>Fault Protection Value for PWML output on channel 0</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FPVL1</name>
              <description>Fault Protection Value for PWML output on channel 1</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FPVL2</name>
              <description>Fault Protection Value for PWML output on channel 2</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FPVL3</name>
              <description>Fault Protection Value for PWML output on channel 3</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FPV2</name>
          <description>PWM Fault Protection Value 2 Register</description>
          <addressOffset>0xC0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FPZH0</name>
              <description>Fault Protection to Hi-Z for PWMH output on channel 0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FPZH1</name>
              <description>Fault Protection to Hi-Z for PWMH output on channel 1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FPZH2</name>
              <description>Fault Protection to Hi-Z for PWMH output on channel 2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FPZH3</name>
              <description>Fault Protection to Hi-Z for PWMH output on channel 3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FPZL0</name>
              <description>Fault Protection to Hi-Z for PWML output on channel 0</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FPZL1</name>
              <description>Fault Protection to Hi-Z for PWML output on channel 1</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FPZL2</name>
              <description>Fault Protection to Hi-Z for PWML output on channel 2</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FPZL3</name>
              <description>Fault Protection to Hi-Z for PWML output on channel 3</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FSR</name>
          <description>PWM Fault Status Register</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>FIV</name>
              <description>Fault Input Value</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FS</name>
              <description>Fault Status</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>IDR1</name>
          <description>PWM Interrupt Disable Register 1</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CHID0</name>
              <description>Counter Event on Channel 0 Interrupt Disable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHID1</name>
              <description>Counter Event on Channel 1 Interrupt Disable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHID2</name>
              <description>Counter Event on Channel 2 Interrupt Disable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHID3</name>
              <description>Counter Event on Channel 3 Interrupt Disable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FCHID0</name>
              <description>Fault Protection Trigger on Channel 0 Interrupt Disable</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FCHID1</name>
              <description>Fault Protection Trigger on Channel 1 Interrupt Disable</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FCHID2</name>
              <description>Fault Protection Trigger on Channel 2 Interrupt Disable</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FCHID3</name>
              <description>Fault Protection Trigger on Channel 3 Interrupt Disable</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
