betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
        <register>
          <name>IDR2</name>
          <description>PWM Interrupt Disable Register 2</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>WRDY</name>
              <description>Write Ready for Synchronous Channels Update Interrupt Disable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UNRE</name>
              <description>Synchronous Channels Update Underrun Error Interrupt Disable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPM0</name>
              <description>Comparison 0 Match Interrupt Disable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPM1</name>
              <description>Comparison 1 Match Interrupt Disable</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPM2</name>
              <description>Comparison 2 Match Interrupt Disable</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPM3</name>
              <description>Comparison 3 Match Interrupt Disable</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPM4</name>
              <description>Comparison 4 Match Interrupt Disable</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPM5</name>
              <description>Comparison 5 Match Interrupt Disable</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPM6</name>
              <description>Comparison 6 Match Interrupt Disable</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPM7</name>
              <description>Comparison 7 Match Interrupt Disable</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPU0</name>
              <description>Comparison 0 Update Interrupt Disable</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPU1</name>
              <description>Comparison 1 Update Interrupt Disable</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPU2</name>
              <description>Comparison 2 Update Interrupt Disable</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPU3</name>
              <description>Comparison 3 Update Interrupt Disable</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPU4</name>
              <description>Comparison 4 Update Interrupt Disable</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPU5</name>
              <description>Comparison 5 Update Interrupt Disable</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPU6</name>
              <description>Comparison 6 Update Interrupt Disable</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPU7</name>
              <description>Comparison 7 Update Interrupt Disable</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IER1</name>
          <description>PWM Interrupt Enable Register 1</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CHID0</name>
              <description>Counter Event on Channel 0 Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHID1</name>
              <description>Counter Event on Channel 1 Interrupt Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHID2</name>
              <description>Counter Event on Channel 2 Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHID3</name>
              <description>Counter Event on Channel 3 Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FCHID0</name>
              <description>Fault Protection Trigger on Channel 0 Interrupt Enable</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FCHID1</name>
              <description>Fault Protection Trigger on Channel 1 Interrupt Enable</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FCHID2</name>
              <description>Fault Protection Trigger on Channel 2 Interrupt Enable</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FCHID3</name>
              <description>Fault Protection Trigger on Channel 3 Interrupt Enable</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IER2</name>
          <description>PWM Interrupt Enable Register 2</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>WRDY</name>
              <description>Write Ready for Synchronous Channels Update Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UNRE</name>
              <description>Synchronous Channels Update Underrun Error Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPM0</name>
              <description>Comparison 0 Match Interrupt Enable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPM1</name>
              <description>Comparison 1 Match Interrupt Enable</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPM2</name>
              <description>Comparison 2 Match Interrupt Enable</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPM3</name>
              <description>Comparison 3 Match Interrupt Enable</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPM4</name>
              <description>Comparison 4 Match Interrupt Enable</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPM5</name>
              <description>Comparison 5 Match Interrupt Enable</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPM6</name>
              <description>Comparison 6 Match Interrupt Enable</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPM7</name>
              <description>Comparison 7 Match Interrupt Enable</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPU0</name>
              <description>Comparison 0 Update Interrupt Enable</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPU1</name>
              <description>Comparison 1 Update Interrupt Enable</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPU2</name>
              <description>Comparison 2 Update Interrupt Enable</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPU3</name>
              <description>Comparison 3 Update Interrupt Enable</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPU4</name>
              <description>Comparison 4 Update Interrupt Enable</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPU5</name>
              <description>Comparison 5 Update Interrupt Enable</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPU6</name>
              <description>Comparison 6 Update Interrupt Enable</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPU7</name>
              <description>Comparison 7 Update Interrupt Enable</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMR1</name>
          <description>PWM Interrupt Mask Register 1</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>CHID0</name>
              <description>Counter Event on Channel 0 Interrupt Mask</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHID1</name>
              <description>Counter Event on Channel 1 Interrupt Mask</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHID2</name>
              <description>Counter Event on Channel 2 Interrupt Mask</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHID3</name>
              <description>Counter Event on Channel 3 Interrupt Mask</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FCHID0</name>
              <description>Fault Protection Trigger on Channel 0 Interrupt Mask</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FCHID1</name>
              <description>Fault Protection Trigger on Channel 1 Interrupt Mask</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FCHID2</name>
              <description>Fault Protection Trigger on Channel 2 Interrupt Mask</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FCHID3</name>
              <description>Fault Protection Trigger on Channel 3 Interrupt Mask</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMR2</name>
          <description>PWM Interrupt Mask Register 2</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>WRDY</name>
              <description>Write Ready for Synchronous Channels Update Interrupt Mask</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UNRE</name>
              <description>Synchronous Channels Update Underrun Error Interrupt Mask</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPM0</name>
              <description>Comparison 0 Match Interrupt Mask</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPM1</name>
              <description>Comparison 1 Match Interrupt Mask</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPM2</name>
              <description>Comparison 2 Match Interrupt Mask</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPM3</name>
              <description>Comparison 3 Match Interrupt Mask</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPM4</name>
              <description>Comparison 4 Match Interrupt Mask</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPM5</name>
              <description>Comparison 5 Match Interrupt Mask</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPM6</name>
              <description>Comparison 6 Match Interrupt Mask</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPM7</name>
              <description>Comparison 7 Match Interrupt Mask</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPU0</name>
              <description>Comparison 0 Update Interrupt Mask</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPU1</name>
              <description>Comparison 1 Update Interrupt Mask</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPU2</name>
              <description>Comparison 2 Update Interrupt Mask</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPU3</name>
              <description>Comparison 3 Update Interrupt Mask</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPU4</name>
              <description>Comparison 4 Update Interrupt Mask</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPU5</name>
              <description>Comparison 5 Update Interrupt Mask</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPU6</name>
              <description>Comparison 6 Update Interrupt Mask</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPU7</name>
              <description>Comparison 7 Update Interrupt Mask</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ISR1</name>
          <description>PWM Interrupt Status Register 1</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>CHID0</name>
              <description>Counter Event on Channel 0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHID1</name>
              <description>Counter Event on Channel 1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHID2</name>
              <description>Counter Event on Channel 2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHID3</name>
              <description>Counter Event on Channel 3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FCHID0</name>
              <description>Fault Protection Trigger on Channel 0</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FCHID1</name>
              <description>Fault Protection Trigger on Channel 1</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FCHID2</name>
              <description>Fault Protection Trigger on Channel 2</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FCHID3</name>
              <description>Fault Protection Trigger on Channel 3</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
