betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
        <register>
          <name>ISR2</name>
          <description>PWM Interrupt Status Register 2</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>WRDY</name>
              <description>Write Ready for Synchronous Channels Update</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UNRE</name>
              <description>Synchronous Channels Update Underrun Error</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPM0</name>
              <description>Comparison 0 Match</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPM1</name>
              <description>Comparison 1 Match</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPM2</name>
              <description>Comparison 2 Match</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPM3</name>
              <description>Comparison 3 Match</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPM4</name>
              <description>Comparison 4 Match</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPM5</name>
              <description>Comparison 5 Match</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPM6</name>
              <description>Comparison 6 Match</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPM7</name>
              <description>Comparison 7 Match</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPU0</name>
              <description>Comparison 0 Update</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPU1</name>
              <description>Comparison 1 Update</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPU2</name>
              <description>Comparison 2 Update</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPU3</name>
              <description>Comparison 3 Update</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPU4</name>
              <description>Comparison 4 Update</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPU5</name>
              <description>Comparison 5 Update</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPU6</name>
              <description>Comparison 6 Update</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPU7</name>
              <description>Comparison 7 Update</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LEBR1</name>
          <description>PWM Leading-Edge Blanking Register 1</description>
          <addressOffset>0x430</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LEBDELAY</name>
              <description>Leading-Edge Blanking Delay for TRGINx</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PWMLFEN</name>
              <description>PWML Falling Edge Enable</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PWMLREN</name>
              <description>PWML Rising Edge Enable</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PWMHFEN</name>
              <description>PWMH Falling Edge Enable</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PWMHREN</name>
              <description>PWMH Rising Edge Enable</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LEBR2</name>
          <description>PWM Leading-Edge Blanking Register 2</description>
          <addressOffset>0x438</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LEBDELAY</name>
              <description>Leading-Edge Blanking Delay for TRGINx</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PWMLFEN</name>
              <description>PWML Falling Edge Enable</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PWMLREN</name>
              <description>PWML Rising Edge Enable</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PWMHFEN</name>
              <description>PWMH Falling Edge Enable</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PWMHREN</name>
              <description>PWMH Rising Edge Enable</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OOV</name>
          <description>PWM Output Override Value Register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OOVH0</name>
              <description>Output Override Value for PWMH output of the channel 0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OOVH1</name>
              <description>Output Override Value for PWMH output of the channel 1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OOVH2</name>
              <description>Output Override Value for PWMH output of the channel 2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OOVH3</name>
              <description>Output Override Value for PWMH output of the channel 3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OOVL0</name>
              <description>Output Override Value for PWML output of the channel 0</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OOVL1</name>
              <description>Output Override Value for PWML output of the channel 1</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OOVL2</name>
              <description>Output Override Value for PWML output of the channel 2</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OOVL3</name>
              <description>Output Override Value for PWML output of the channel 3</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OS</name>
          <description>PWM Output Selection Register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OSH0</name>
              <description>Output Selection for PWMH output of the channel 0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OSH1</name>
              <description>Output Selection for PWMH output of the channel 1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OSH2</name>
              <description>Output Selection for PWMH output of the channel 2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OSH3</name>
              <description>Output Selection for PWMH output of the channel 3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OSL0</name>
              <description>Output Selection for PWML output of the channel 0</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OSL1</name>
              <description>Output Selection for PWML output of the channel 1</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OSL2</name>
              <description>Output Selection for PWML output of the channel 2</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OSL3</name>
              <description>Output Selection for PWML output of the channel 3</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OSC</name>
          <description>PWM Output Selection Clear Register</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>OSCH0</name>
              <description>Output Selection Clear for PWMH output of the channel 0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OSCH1</name>
              <description>Output Selection Clear for PWMH output of the channel 1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OSCH2</name>
              <description>Output Selection Clear for PWMH output of the channel 2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OSCH3</name>
              <description>Output Selection Clear for PWMH output of the channel 3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OSCL0</name>
              <description>Output Selection Clear for PWML output of the channel 0</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OSCL1</name>
              <description>Output Selection Clear for PWML output of the channel 1</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OSCL2</name>
              <description>Output Selection Clear for PWML output of the channel 2</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OSCL3</name>
              <description>Output Selection Clear for PWML output of the channel 3</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OSCUPD</name>
          <description>PWM Output Selection Clear Update Register</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>OSCUPH0</name>
              <description>Output Selection Clear for PWMH output of the channel 0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OSCUPH1</name>
              <description>Output Selection Clear for PWMH output of the channel 1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OSCUPH2</name>
              <description>Output Selection Clear for PWMH output of the channel 2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OSCUPH3</name>
              <description>Output Selection Clear for PWMH output of the channel 3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OSCUPL0</name>
              <description>Output Selection Clear for PWML output of the channel 0</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OSCUPL1</name>
              <description>Output Selection Clear for PWML output of the channel 1</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OSCUPL2</name>
              <description>Output Selection Clear for PWML output of the channel 2</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OSCUPL3</name>
              <description>Output Selection Clear for PWML output of the channel 3</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OSS</name>
          <description>PWM Output Selection Set Register</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>OSSH0</name>
              <description>Output Selection Set for PWMH output of the channel 0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OSSH1</name>
              <description>Output Selection Set for PWMH output of the channel 1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OSSH2</name>
              <description>Output Selection Set for PWMH output of the channel 2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OSSH3</name>
              <description>Output Selection Set for PWMH output of the channel 3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OSSL0</name>
              <description>Output Selection Set for PWML output of the channel 0</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OSSL1</name>
              <description>Output Selection Set for PWML output of the channel 1</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OSSL2</name>
              <description>Output Selection Set for PWML output of the channel 2</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OSSL3</name>
              <description>Output Selection Set for PWML output of the channel 3</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OSSUPD</name>
          <description>PWM Output Selection Set Update Register</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>OSSUPH0</name>
              <description>Output Selection Set for PWMH output of the channel 0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OSSUPH1</name>
              <description>Output Selection Set for PWMH output of the channel 1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OSSUPH2</name>
              <description>Output Selection Set for PWMH output of the channel 2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OSSUPH3</name>
              <description>Output Selection Set for PWMH output of the channel 3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OSSUPL0</name>
              <description>Output Selection Set for PWML output of the channel 0</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OSSUPL1</name>
              <description>Output Selection Set for PWML output of the channel 1</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OSSUPL2</name>
              <description>Output Selection Set for PWML output of the channel 2</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OSSUPL3</name>
              <description>Output Selection Set for PWML output of the channel 3</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
