betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
        <register>
          <name>SCM</name>
          <description>PWM Sync Channels Mode Register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SYNC0</name>
              <description>Synchronous Channel 0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNC1</name>
              <description>Synchronous Channel 1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNC2</name>
              <description>Synchronous Channel 2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNC3</name>
              <description>Synchronous Channel 3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UPDM</name>
              <description>Synchronous Channels Update Mode</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MODE0</name>
                  <description>Manual write of double buffer registers and manual update of synchronous channels</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE1</name>
                  <description>Manual write of double buffer registers and automatic update of synchronous channels</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE2</name>
                  <description>Automatic write of duty-cycle update registers by the DMA Controller and automatic update of synchronous channels</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTRM</name>
              <description>DMA Controller Transfer Request Mode</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PTRCS</name>
              <description>DMA Controller Transfer Request Comparison Selection</description>
              <bitRange>[23:21]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SCUC</name>
          <description>PWM Sync Channels Update Control Register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>UPDULOCK</name>
              <description>Synchronous Channels Update Unlock</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCUP</name>
          <description>PWM Sync Channels Update Period Register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>UPR</name>
              <description>Update Period</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>UPRCNT</name>
              <description>Update Period Counter</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SCUPUPD</name>
          <description>PWM Sync Channels Update Period Update Register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>UPRUPD</name>
              <description>Update Period Update</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SMMR</name>
          <description>PWM Stepper Motor Mode Register</description>
          <addressOffset>0xB0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>GCEN0</name>
              <description>Gray Count Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GCEN1</name>
              <description>Gray Count Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DOWN0</name>
              <description>Down Count</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DOWN1</name>
              <description>Down Count</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>PWM Status Register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>CHID0</name>
              <description>Channel ID</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHID1</name>
              <description>Channel ID</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHID2</name>
              <description>Channel ID</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHID3</name>
              <description>Channel ID</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SSPR</name>
          <description>PWM Spread Spectrum Register</description>
          <addressOffset>0xA0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SPRD</name>
              <description>Spread Spectrum Limit Value</description>
              <bitRange>[23:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>16777215</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SPRDM</name>
              <description>Spread Spectrum Counter Mode</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SSPUP</name>
          <description>PWM Spread Spectrum Update Register</description>
          <addressOffset>0xA4</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>SPRDUP</name>
              <description>Spread Spectrum Limit Value Update</description>
              <bitRange>[23:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>16777215</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>WPCR</name>
          <description>PWM Write Protection Control Register</description>
          <addressOffset>0xE4</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>WPCMD</name>
              <description>Write Protection Command</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE_SW_PROT</name>
                  <description>Disables the software write protection of the register groups of which the bit WPRGx is at '1'.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_SW_PROT</name>
                  <description>Enables the software write protection of the register groups of which the bit WPRGx is at '1'.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_HW_PROT</name>
                  <description>Enables the hardware write protection of the register groups of which the bit WPRGx is at '1'. Only a hardware reset of the PWM controller can disable the hardware write protection. Moreover, to meet security requirements, the PIO lines associated with the PWM can not be configured through the PIO interface.</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WPRG0</name>
              <description>Write Protection Register Group 0</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WPRG1</name>
              <description>Write Protection Register Group 1</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WPRG2</name>
              <description>Write Protection Register Group 2</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WPRG3</name>
              <description>Write Protection Register Group 3</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WPRG4</name>
              <description>Write Protection Register Group 4</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WPRG5</name>
              <description>Write Protection Register Group 5</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WPKEY</name>
              <description>Write Protection Key</description>
              <bitRange>[31:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PASSWD</name>
                  <description>Writing any other value in this field aborts the write operation of the WPCMD field.Always reads as 0</description>
                  <value>5265229</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WPSR</name>
          <description>PWM Write Protection Status Register</description>
          <addressOffset>0xE8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>WPSWS0</name>
              <description>Write Protect SW Status</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WPSWS1</name>
              <description>Write Protect SW Status</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WPSWS2</name>
              <description>Write Protect SW Status</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WPSWS3</name>
              <description>Write Protect SW Status</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WPSWS4</name>
              <description>Write Protect SW Status</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WPSWS5</name>
              <description>Write Protect SW Status</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WPVS</name>
              <description>Write Protect Violation Status</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WPHWS0</name>
              <description>Write Protect HW Status</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WPHWS1</name>
              <description>Write Protect HW Status</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WPHWS2</name>
              <description>Write Protect HW Status</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WPHWS3</name>
              <description>Write Protect HW Status</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WPHWS4</name>
              <description>Write Protect HW Status</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WPHWS5</name>
              <description>Write Protect HW Status</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WPVSRC</name>
              <description>Write Protect Violation Source</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
