betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>QSPI0</name>
      <description>Quad Serial Peripheral Interface</description>
      <baseAddress>0xF0020000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x24</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x30</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x40</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xE4</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR</name>
          <description>Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>QSPIEN</name>
              <description>QSPI Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>QSPIDIS</name>
              <description>QSPI Disable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWRST</name>
              <description>QSPI Software Reset</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LASTXFER</name>
              <description>Last Transfer</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IAR</name>
          <description>Instruction Address Register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Address</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <description>Instruction Code Register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INST</name>
              <description>Instruction Code</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>OPT</name>
              <description>Option Code</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>IDR</name>
          <description>Interrupt Disable Register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>RDRF</name>
              <description>Receive Data Register Full Interrupt Disable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TDRE</name>
              <description>Transmit Data Register Empty Interrupt Disable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXEMPTY</name>
              <description>Transmission Registers Empty Disable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OVRES</name>
              <description>Overrun Error Interrupt Disable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CSR</name>
              <description>Chip Select Rise Interrupt Disable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CSS</name>
              <description>Chip Select Status Interrupt Disable</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INSTRE</name>
              <description>Instruction End Interrupt Disable</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <description>Interrupt Enable Register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>RDRF</name>
              <description>Receive Data Register Full Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TDRE</name>
              <description>Transmit Data Register Empty Interrupt Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXEMPTY</name>
              <description>Transmission Registers Empty Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OVRES</name>
              <description>Overrun Error Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CSR</name>
              <description>Chip Select Rise Interrupt Enable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CSS</name>
              <description>Chip Select Status Interrupt Enable</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INSTRE</name>
              <description>Instruction End Interrupt Enable</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IFR</name>
          <description>Instruction Frame Register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WIDTH</name>
              <description>Width of Instruction Code, Address, Option Code and Data</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SINGLE_BIT_SPI</name>
                  <description>Instruction: Single-bit SPI / Address-Option: Single-bit SPI / Data: Single-bit SPI</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DUAL_OUTPUT</name>
                  <description>Instruction: Single-bit SPI / Address-Option: Single-bit SPI / Data: Dual SPI</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD_OUTPUT</name>
                  <description>Instruction: Single-bit SPI / Address-Option: Single-bit SPI / Data: Quad SPI</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DUAL_IO</name>
                  <description>Instruction: Single-bit SPI / Address-Option: Dual SPI / Data: Dual SPI</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD_IO</name>
                  <description>Instruction: Single-bit SPI / Address-Option: Quad SPI / Data: Quad SPI</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DUAL_CMD</name>
                  <description>Instruction: Dual SPI / Address-Option: Dual SPI / Data: Dual SPI</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD_CMD</name>
                  <description>Instruction: Quad SPI / Address-Option: Quad SPI / Data: Quad SPI</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INSTEN</name>
              <description>Instruction Enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDREN</name>
              <description>Address Enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OPTEN</name>
              <description>Option Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DATAEN</name>
              <description>Data Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OPTL</name>
              <description>Option Code Length</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OPTION_1BIT</name>
                  <description>The option code is 1 bit long.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPTION_2BIT</name>
                  <description>The option code is 2 bits long.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPTION_4BIT</name>
                  <description>The option code is 4 bits long.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPTION_8BIT</name>
                  <description>The option code is 8 bits long.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDRL</name>
              <description>Address Length</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_24_BIT</name>
                  <description>The address is 24 bits long.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_32_BIT</name>
                  <description>The address is 32 bits long.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TFRTYP</name>
              <description>Data Transfer Type</description>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRSFR_READ</name>
                  <description>Read transfer from the serial memory.Scrambling is not performed.Read at random location (fetch) in the serial Flash memory is not possible.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRSFR_READ_MEMORY</name>
                  <description>Read data transfer from the serial memory.If enabled, scrambling is performed.Read at random location (fetch) in the serial Flash memory is possible.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRSFR_WRITE</name>
                  <description>Write transfer into the serial memory.Scrambling is not performed.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRSFR_WRITE_MEMORY</name>
                  <description>Write data transfer into the serial memory.If enabled, scrambling is performed.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CRM</name>
              <description>Continuous Read Mode</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Continuous Read mode is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Continuous Read mode is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NBDUM</name>
              <description>Number Of Dummy Cycles</description>
              <bitRange>[20:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>IMR</name>
          <description>Interrupt Mask Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RDRF</name>
              <description>Receive Data Register Full Interrupt Mask</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TDRE</name>
              <description>Transmit Data Register Empty Interrupt Mask</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXEMPTY</name>
              <description>Transmission Registers Empty Mask</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OVRES</name>
              <description>Overrun Error Interrupt Mask</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CSR</name>
              <description>Chip Select Rise Interrupt Mask</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CSS</name>
              <description>Chip Select Status Interrupt Mask</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INSTRE</name>
              <description>Instruction End Interrupt Mask</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
