betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
        <register>
          <name>MR</name>
          <description>Mode Register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>HRMOD</name>
              <description>12-/24-hour Mode</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PERSIAN</name>
              <description>PERSIAN Calendar</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UTC</name>
              <description>UTC Time Format</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NEGPPM</name>
              <description>NEGative PPM Correction</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CORRECTION</name>
              <description>Slow Clock Correction</description>
              <bitRange>[14:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>HIGHPPM</name>
              <description>HIGH PPM Correction</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT0</name>
              <description>All ADC Channel Trigger Event Source Selection</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_WAVE</name>
                  <description>No waveform, stuck at '0'</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FREQ1HZ</name>
                  <description>1 Hz square wave</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FREQ32HZ</name>
                  <description>32 Hz square wave</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FREQ64HZ</name>
                  <description>64 Hz square wave</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FREQ512HZ</name>
                  <description>512 Hz square wave</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALARM_TOGGLE</name>
                  <description>Output toggles when alarm flag rises</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALARM_FLAG</name>
                  <description>Output is a copy of the alarm flag</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROG_PULSE</name>
                  <description>Duty cycle programmable pulse</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUT1</name>
              <description>ADC Last Channel Trigger Event Source Selection</description>
              <bitRange>[22:20]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_WAVE</name>
                  <description>No waveform, stuck at '0'</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FREQ1HZ</name>
                  <description>1 Hz square wave</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FREQ32HZ</name>
                  <description>32 Hz square wave</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FREQ64HZ</name>
                  <description>64 Hz square wave</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FREQ512HZ</name>
                  <description>512 Hz square wave</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALARM_TOGGLE</name>
                  <description>Output toggles when alarm flag rises</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALARM_FLAG</name>
                  <description>Output is a copy of the alarm flag</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROG_PULSE</name>
                  <description>Duty cycle programmable pulse</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>THIGH</name>
              <description>High Duration of the Output Pulse</description>
              <bitRange>[26:24]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>H_31MS</name>
                  <description>31.2 ms</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>H_16MS</name>
                  <description>15.6 ms</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>H_4MS</name>
                  <description>3.91 ms</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>H_976US</name>
                  <description>976 us</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>H_488US</name>
                  <description>488 us</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>H_122US</name>
                  <description>122 us</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>H_30US</name>
                  <description>30.5 us</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>H_15US</name>
                  <description>15.2 us</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TPERIOD</name>
              <description>Period of the Output Pulse</description>
              <bitRange>[29:28]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>P_1S</name>
                  <description>1 second</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P_500MS</name>
                  <description>500 ms</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P_250MS</name>
                  <description>250 ms</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P_125MS</name>
                  <description>125 ms</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SCCR</name>
          <description>Status Clear Command Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>ACKCLR</name>
              <description>Acknowledge Clear</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ALRCLR</name>
              <description>Alarm Clear</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SECCLR</name>
              <description>Second Clear</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMCLR</name>
              <description>Time Clear</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CALCLR</name>
              <description>Calendar Clear</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TDERRCLR</name>
              <description>Time and/or Date Free Running Error Clear</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>Status Register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>ACKUPD</name>
              <description>Acknowledge for Update</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FREERUN</name>
                  <description>Time and calendar registers cannot be updated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UPDATE</name>
                  <description>Time and calendar registers can be updated.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALARM</name>
              <description>Alarm Flag</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_ALARMEVENT</name>
                  <description>No alarm matching condition occurred.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALARMEVENT</name>
                  <description>An alarm matching condition has occurred.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC</name>
              <description>Second Event</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_SECEVENT</name>
                  <description>No second event has occurred since the last clear.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECEVENT</name>
                  <description>At least one second event has occurred since the last clear.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMEV</name>
              <description>Time Event</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_TIMEVENT</name>
                  <description>No time event has occurred since the last clear.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMEVENT</name>
                  <description>At least one time event has occurred since the last clear.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CALEV</name>
              <description>Calendar Event</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_CALEVENT</name>
                  <description>No calendar event has occurred since the last clear.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CALEVENT</name>
                  <description>At least one calendar event has occurred since the last clear.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TDERR</name>
              <description>Time and/or Date Free Running Error</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CORRECT</name>
                  <description>The internal free running counters are carrying valid values since the last read of the Status Register (RTC_SR).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERR_TIMEDATE</name>
                  <description>The internal free running counters have been corrupted (invalid date or time, non-BCD values) since the last read and/or they are still invalid.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMALR</name>
          <description>Time Alarm Register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SEC</name>
              <description>Second Alarm</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>UTC_TIME</name>
              <description>UTC_TIME Alarm</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SECEN</name>
              <description>Second Alarm Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MIN</name>
              <description>Minute Alarm</description>
              <bitRange>[14:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MINEN</name>
              <description>Minute Alarm Enable</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HOUR</name>
              <description>Hour Alarm</description>
              <bitRange>[21:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>AMPM</name>
              <description>AM/PM Indicator</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HOUREN</name>
              <description>Hour Alarm Enable</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMR</name>
          <description>Time Register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SEC</name>
              <description>Current Second</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>UTC_TIME</name>
              <description>Current UTC Time</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MIN</name>
              <description>Current Minute</description>
              <bitRange>[14:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>HOUR</name>
              <description>Current Hour</description>
              <bitRange>[21:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>AMPM</name>
              <description>Ante Meridiem Post Meridiem Indicator</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VER</name>
          <description>Valid Entry Register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>NVTIM</name>
              <description>Non-valid Time</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NVCAL</name>
              <description>Non-valid Calendar</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NVTIMALR</name>
              <description>Non-valid Time Alarm</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NVCALALR</name>
              <description>Non-valid Calendar Alarm</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
