betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
        <register>
          <name>EISIER</name>
          <description>Error Interrupt Signal Enable Register</description>
          <addressOffset>0x3A</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CMDTEO</name>
              <description>Command Timeout Error Signal Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKED</name>
                  <description>No interrupt is generated when the CMDTEO status rises in SDMMC_EISTR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>An interrupt is generated when the CMDTEO status rises in SDMMC_EISTR.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMDCRC</name>
              <description>Command CRC Error Signal Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKED</name>
                  <description>No interrupt is generated when the CDMCRC status rises in SDMMC_EISTR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>An interrupt is generated when the CMDCRC status rises in SDMMC_EISTR.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMDEND</name>
              <description>Command End Bit Error Signal Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKED</name>
                  <description>No interrupt is generated when the CMDEND status rises in SDMMC_EISTR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>An interrupt is generated when the CMDEND status rises in SDMMC_EISTR.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMDIDX</name>
              <description>Command Index Error Signal Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKED</name>
                  <description>No interrupt is generated when the CMDIDX status rises in SDMMC_EISTR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>An interrupt is generated when the CMDIDX status rises in SDMMC_EISTR.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATTEO</name>
              <description>Data Timeout Error Signal Enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKED</name>
                  <description>No interrupt is generated when the DATTEO status rises in SDMMC_EISTR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>An interrupt is generated when the DATTEO status rises in SDMMC_EISTR.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATCRC</name>
              <description>Data CRC Error Signal Enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKED</name>
                  <description>No interrupt is generated when the DATCRC status rises in SDMMC_EISTR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>An interrupt is generated when the DATCRC status rises in SDMMC_EISTR.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATEND</name>
              <description>Data End Bit Error Signal Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKED</name>
                  <description>No interrupt is generated when the DATEND status rises in SDMMC_EISTR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>An interrupt is generated when the DATEND status rises in SDMMC_EISTR.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CURLIM</name>
              <description>Current Limit Error Signal Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKED</name>
                  <description>No interrupt is generated when the CURLIM status rises in SDMMC_EISTR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>An interrupt is generated when the CURLIM status rises in SDMMC_EISTR.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACMD</name>
              <description>Auto CMD Error Signal Enable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKED</name>
                  <description>No interrupt is generated when the ACMD status rises in SDMMC_EISTR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>An interrupt is generated when the ACMD status rises in SDMMC_EISTR.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADMA</name>
              <description>ADMA Error Signal Enable</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKED</name>
                  <description>No interrupt is generated when the ADMA status rises in SDMMC_EISTR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>An interrupt is generated when the ADMA status rises in SDMMC_EISTR.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BOOTAE</name>
              <description>Boot Acknowledge Error Signal Enable</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKED</name>
                  <description>No interrupt is generated when the BOOTAE status rises in SDMMC_EISTR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>An interrupt is generated when the BOOTAE status rises in SDMMC_EISTR.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EISTER</name>
          <description>Error Interrupt Status Enable Register</description>
          <addressOffset>0x36</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CMDTEO</name>
              <description>Command Timeout Error Status Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKED</name>
                  <description>The CMDTEO status flag in SDMMC_EISTR is masked.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>The CMDTEO status flag in SDMMC_EISTR is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMDCRC</name>
              <description>Command CRC Error Status Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKED</name>
                  <description>The CMDCRC status flag in SDMMC_EISTR is masked.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>The CMDCRC status flag in SDMMC_EISTR is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMDEND</name>
              <description>Command End Bit Error Status Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKED</name>
                  <description>The CMDEND status flag in SDMMC_EISTR is masked.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>The CMDEND status flag in SDMMC_EISTR is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMDIDX</name>
              <description>Command Index Error Status Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKED</name>
                  <description>The CMDIDX status flag in SDMMC_EISTR is masked.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>The CMDIDX status flag in SDMMC_EISTR is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATTEO</name>
              <description>Data Timeout Error Status Enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKED</name>
                  <description>The DATTEO status flag in SDMMC_EISTR is masked.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>The DATTEO status flag in SDMMC_EISTR is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATCRC</name>
              <description>Data CRC Error Status Enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKED</name>
                  <description>The DATCRC status flag in SDMMC_EISTR is masked.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>The DATCRC status flag in SDMMC_EISTR is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATEND</name>
              <description>Data End Bit Error Status Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKED</name>
                  <description>The DATEND status flag in SDMMC_EISTR is masked.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>The DATEND status flag in SDMMC_EISTR is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CURLIM</name>
              <description>Current Limit Error Status Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKED</name>
                  <description>The CURLIM status flag in SDMMC_EISTR is masked.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>The CURLIM status flag in SDMMC_EISTR is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACMD</name>
              <description>Auto CMD Error Status Enable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKED</name>
                  <description>The ACMD status flag in SDMMC_EISTR is masked.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>The ACMD status flag in SDMMC_EISTR is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADMA</name>
              <description>ADMA Error Status Enable</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKED</name>
                  <description>The ADMA status flag in SDMMC_EISTR is masked.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>The ADMA status flag in SDMMC_EISTR is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BOOTAE</name>
              <description>Boot Acknowledge Error Status Enable</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKED</name>
                  <description>The BOOTAE status flag in SDMMC_EISTR is masked.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>The BOOTAE status flag in SDMMC_EISTR is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EISTR</name>
          <description>Error Interrupt Status Register</description>
          <addressOffset>0x32</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CMDTEO</name>
              <description>Command Timeout Error</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMDCRC</name>
              <description>Command CRC Error</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMDEND</name>
              <description>Command End Bit Error</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMDIDX</name>
              <description>Command Index Error</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DATTEO</name>
              <description>Data Timeout error</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DATCRC</name>
              <description>Data CRC Error</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DATEND</name>
              <description>Data End Bit Error</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CURLIM</name>
              <description>Current Limit Error</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ACMD</name>
              <description>Auto CMD Error</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADMA</name>
              <description>ADMA Error</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BOOTAE</name>
              <description>Boot Acknowledge Error</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
