betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
        <register>
          <name>FERACES</name>
          <description>Force Event Register for Auto CMD Error Status</description>
          <addressOffset>0x50</addressOffset>
          <size>0x10</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>ACMD12NE</name>
              <description>Force Event for Auto CMD12 Not Executed</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ACMDTEO</name>
              <description>Force Event for Auto CMD Timeout Error</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ACMDCRC</name>
              <description>Force Event for Auto CMD CRC Error</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ACMDEND</name>
              <description>Force Event for Auto CMD End Bit Error</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ACMDIDX</name>
              <description>Force Event for Auto CMD Index Error</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMDNI</name>
              <description>Force Event for Command Not Issued by Auto CMD12 Error</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FEREIS</name>
          <description>Force Event Register for Error Interrupt Status</description>
          <addressOffset>0x52</addressOffset>
          <size>0x10</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CMDTEO</name>
              <description>Force Event for Command Timeout Error</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMDCRC</name>
              <description>Force Event for Command CRC Error</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMDEND</name>
              <description>Force Event for Command End Bit Error</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMDIDX</name>
              <description>Force Event for Command Index Error</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DATTEO</name>
              <description>Force Event for Data Timeout error</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DATCRC</name>
              <description>Force Event for Data CRC error</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DATEND</name>
              <description>Force Event for Data End Bit Error</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CURLIM</name>
              <description>Force Event for Current Limit Error</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ACMD</name>
              <description>Force Event for Auto CMD Error</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADMA</name>
              <description>Force Event for ADMA Error</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BOOTAE</name>
              <description>Force Event for Boot Acknowledge Error</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HC1R</name>
          <description>Host Control 1 Register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LEDCTRL</name>
              <description>LED Control</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>LED off.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>LED on.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DW</name>
              <description>Data Width</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_1_BIT</name>
                  <description>1-bit mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_4_BIT</name>
                  <description>4-bit mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSEN</name>
              <description>High Speed Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DMASEL</name>
              <description>DMA Select</description>
              <bitRange>[4:3]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SDMA</name>
                  <description>SDMA is selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADMA32</name>
                  <description>32-bit Address ADMA2 is selected</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTDW</name>
              <description>Extended Data Width</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CARDDTL</name>
              <description>Card Detect Test Level</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CARDDSEL</name>
              <description>Card Detect Signal Selection</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HC2R</name>
          <description>Host Control 2 Register</description>
          <addressOffset>0x3E</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>HS200EN</name>
              <description>HS200 Mode Enable</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>UHSMS</name>
              <description>UHS Mode Select</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SDR12</name>
                  <description>UHS SDR12 Mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDR25</name>
                  <description>UHS SDR25 Mode</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDR50</name>
                  <description>UHS SDR50 Mode</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDR104</name>
                  <description>UHS SDR104 Mode</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DDR50</name>
                  <description>UHS DDR50 Mode</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VS18EN</name>
              <description>1.8V Signaling Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DRVSEL</name>
              <description>Driver Strength Select</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TYPEB</name>
                  <description>Driver Type B is selected (Default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TYPEA</name>
                  <description>Driver Type A is selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TYPEC</name>
                  <description>Driver Type C is selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TYPED</name>
                  <description>Driver Type D is selected</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTUN</name>
              <description>Execute Tuning</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCLKSEL</name>
              <description>Sampling Clock Select</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ASINTEN</name>
              <description>Asynchronous Interrupt Enable</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PVALEN</name>
              <description>Preset Value Enable</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HCVR</name>
          <description>Host Controller Version Register</description>
          <addressOffset>0xFE</addressOffset>
          <size>0x10</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>SVER</name>
              <description>Specification Version Number</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>VVER</name>
              <description>Vendor Version Number</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MC1R</name>
          <description>e.MMC Control 1 Register</description>
          <addressOffset>0x204</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CMDTYP</name>
              <description>e.MMC Command Type</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>The command is not an e.MMC specific command.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAITIRQ</name>
                  <description>This bit must be set to 1 when the e.MMC is in Interrupt mode (CMD40). Refer to "Interrupt Mode" in the "Embedded MultiMedia Card (e.MMC) Electrical Standard 4.51" .</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STREAM</name>
                  <description>This bit must be set to 1 in the case of Stream Read(CMD11) or Stream Write (CMD20). Only effective for e.MMC up to revision 4.41.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOOT</name>
                  <description>Starts a Boot Operation mode at the next write to SDMMC_CR. Boot data are read directly from e.MMC device.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DDR</name>
              <description>e.MMC HSDDR Mode</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OPD</name>
              <description>e.MMC Open Drain Mode</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BOOTA</name>
              <description>e.MMC Boot Acknowledge Enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RSTN</name>
              <description>e.MMC Reset Signal</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FCD</name>
              <description>e.MMC Force Card Detect</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MC2R</name>
          <description>e.MMC Control 2 Register</description>
          <addressOffset>0x205</addressOffset>
          <size>0x8</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>SRESP</name>
              <description>e.MMC Abort Wait IRQ</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ABOOT</name>
              <description>e.MMC Abort Boot</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MCCAR</name>
          <description>Maximum Current Capabilities Register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MAXCUR33V</name>
              <description>Maximum Current for 3.3V</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MAXCUR30V</name>
              <description>Maximum Current for 3.0V</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MAXCUR18V</name>
              <description>Maximum Current for 1.8V</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
