betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
        <register>
          <name>NISIER</name>
          <description>Normal Interrupt Signal Enable Register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CMDC</name>
              <description>Command Complete Signal Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKED</name>
                  <description>No interrupt is generated when the CMDC status rises in SDMMC_NISTR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>An interrupt is generated when the CMDC status rises in SDMMC_NISTR.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRFC</name>
              <description>Transfer Complete Signal Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKED</name>
                  <description>No interrupt is generated when the TRFC status rises in SDMMC_NISTR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>An interrupt is generated when the TRFC status rises in SDMMC_NISTR.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BLKGE</name>
              <description>Block Gap Event Signal Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKED</name>
                  <description>No interrupt is generated when the BLKGE status rises in SDMMC_NISTR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>An interrupt is generated when the BLKGE status rises in SDMMC_NISTR.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMAINT</name>
              <description>DMA Interrupt Signal Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKED</name>
                  <description>No interrupt is generated when the DMAINT status rises in SDMMC_NISTR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>An interrupt is generated when the DMAINT status rises in SDMMC_NISTR.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BWRRDY</name>
              <description>Buffer Write Ready Signal Enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKED</name>
                  <description>No interrupt is generated when the BWRRDY status rises in SDMMC_NISTR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>An interrupt is generated when the BWRRDY status rises in SDMMC_NISTR.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BRDRDY</name>
              <description>Buffer Read Ready Signal Enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKED</name>
                  <description>No interrupt is generated when the BRDRDY status rises in SDMMC_NISTR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>An interrupt is generated when the BRDRDY status rises in SDMMC_NISTR.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CINS</name>
              <description>Card Insertion Signal Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKED</name>
                  <description>No interrupt is generated when the CINS status rises in SDMMC_NISTR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>An interrupt is generated when the CINS status rises in SDMMC_NISTR.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CREM</name>
              <description>Card Removal Signal Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKED</name>
                  <description>No interrupt is generated when the CREM status rises in SDMMC_NISTR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>An interrupt is generated when the CREM status rises in SDMMC_NISTR.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CINT</name>
              <description>Card Interrupt Signal Enable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKED</name>
                  <description>No interrupt is generated when the CINT status rises in SDMMC_NISTR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>An interrupt is generated when the CINT status rises in SDMMC_NISTR.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BOOTAR</name>
              <description>Boot Acknowledge Received Signal Enable</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKED</name>
                  <description>No interrupt is generated when the BOOTAR status rises in SDMMC_NISTR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>An interrupt is generated when the BOOTAR status rises in SDMMC_NISTR.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>NISTER</name>
          <description>Normal Interrupt Status Enable Register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CMDC</name>
              <description>Command Complete Status Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKED</name>
                  <description>The CMDC status flag in SDMMC_NISTR is masked.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>The CMDC status flag in SDMMC_NISTR is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRFC</name>
              <description>Transfer Complete Status Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKED</name>
                  <description>The TRFC status flag in SDMMC_NISTR is masked.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>The TRFC status flag in SDMMC_NISTR is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BLKGE</name>
              <description>Block Gap Event Status Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKED</name>
                  <description>The BLKGE status flag in SDMMC_NISTR is masked.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>The BLKGE status flag in SDMMC_NISTR is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMAINT</name>
              <description>DMA Interrupt Status Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKED</name>
                  <description>The DMAINT status flag in SDMMC_NISTR is masked.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>The DMAINT status flag in SDMMC_NISTR is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BWRRDY</name>
              <description>Buffer Write Ready Status Enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKED</name>
                  <description>The BWRRDY status flag in SDMMC_NISTR is masked.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>The BWRRDY status flag in SDMMC_NISTR is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BRDRDY</name>
              <description>Buffer Read Ready Status Enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKED</name>
                  <description>The BRDRDY status flag in SDMMC_NISTR is masked.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>The BRDRDY status flag in SDMMC_NISTR is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CINS</name>
              <description>Card Insertion Status Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKED</name>
                  <description>The CINS status flag in SDMMC_NISTR is masked.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>The CINS status flag in SDMMC_NISTR is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CREM</name>
              <description>Card Removal Status Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKED</name>
                  <description>The CREM status flag in SDMMC_NISTR is masked.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>The CREM status flag in SDMMC_NISTR is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CINT</name>
              <description>Card Interrupt Status Enable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKED</name>
                  <description>The CINT status flag in SDMMC_NISTR is masked.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>The CINT status flag in SDMMC_NISTR is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BOOTAR</name>
              <description>Boot Acknowledge Received Status Enable</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKED</name>
                  <description>The BOOTAR status flag in SDMMC_NISTR is masked.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>The BOOTAR status flag in SDMMC_NISTR is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>NISTR</name>
          <description>Normal Interrupt Status Register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CMDC</name>
              <description>Command Complete</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TRFC</name>
              <description>Transfer Complete</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BLKGE</name>
              <description>Block Gap Event</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DMAINT</name>
              <description>DMA Interrupt</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BWRRDY</name>
              <description>Buffer Write Ready</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BRDRDY</name>
              <description>Buffer Read Ready</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CINS</name>
              <description>Card Insertion</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CREM</name>
              <description>Card Removal</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CINT</name>
              <description>Card Interrupt</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BOOTAR</name>
              <description>Boot Acknowledge Received</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ERRINT</name>
              <description>Error Interrupt</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PCR</name>
          <description>Power Control Register</description>
          <addressOffset>0x29</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SDBPWR</name>
              <description>SD Bus Power</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
