betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SHDWC</name>
      <description>Shutdown Controller</description>
      <baseAddress>0xF8048010</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR</name>
          <description>Shutdown Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>SHDW</name>
              <description>Shutdown Command</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>KEY</name>
              <description>Password</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PASSWD</name>
                  <description>Writing any other value in this field aborts the write operation.</description>
                  <value>165</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MR</name>
          <description>Shutdown Mode Register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RTCWKEN</name>
              <description>Real-time Clock Wake-up Enable</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ACCWKEN</name>
              <description>Analog Comparator Controller Wake-up Enable</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXLPWKEN</name>
              <description>Debug Unit Wake-up Enable</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WKUPDBC</name>
              <description>Wake-up Inputs Debouncer Period</description>
              <bitRange>[26:24]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IMMEDIATE</name>
                  <description>Immediate, no debouncing, detected active at least on one Slow Clock edge</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_3_SLCK</name>
                  <description>PIOBUx shall be in its active state for at least 3 SLCK periods</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_32_SLCK</name>
                  <description>PIOBUx shall be in its active state for at least 32 SLCK periods</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_512_SLCK</name>
                  <description>PIOBUx shall be in its active state for at least 512 SLCK periods</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_4096_SLCK</name>
                  <description>PIOBUx shall be in its active state for at least 4,096 SLCK periods</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_32768_SLCK</name>
                  <description>PIOBUx shall be in its active state for at least 32,768 SLCK periods</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>Shutdown Status Register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>WKUPS</name>
              <description>PIOBU, WKUP Wake-up Status</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No wake-up due to the assertion of the PIOBU, WKUP pins has occurred since the last read of SHDW_SR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESENT</name>
                  <description>At least one wake-up due to the assertion of the PIOBU, WKUP pins has occurred since the last read of SHDW_SR.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTCWK</name>
              <description>No Description.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ACCWK</name>
              <description>Analog Comparator Controller Wake-up</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXLPWK</name>
              <description>Debug Unit Wake-up</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WKUPIS0</name>
              <description>Wake-up 0 Input Status</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>The corresponding wake-up input was active at the time the debouncer triggered a wake-up event.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WKUPIS1</name>
              <description>Wake-up 1 Input Status</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>The corresponding wake-up input was active at the time the debouncer triggered a wake-up event.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WKUPIS2</name>
              <description>Wake-up 2 Input Status</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>The corresponding wake-up input was active at the time the debouncer triggered a wake-up event.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WKUPIS3</name>
              <description>Wake-up 3 Input Status</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>The corresponding wake-up input was active at the time the debouncer triggered a wake-up event.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WKUPIS4</name>
              <description>Wake-up 4 Input Status</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>The corresponding wake-up input was active at the time the debouncer triggered a wake-up event.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WKUPIS5</name>
              <description>Wake-up 5 Input Status</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>The corresponding wake-up input was active at the time the debouncer triggered a wake-up event.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WKUPIS6</name>
              <description>Wake-up 6 Input Status</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>The corresponding wake-up input was active at the time the debouncer triggered a wake-up event.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WKUPIS7</name>
              <description>Wake-up 7 Input Status</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>The corresponding wake-up input was active at the time the debouncer triggered a wake-up event.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WKUPIS8</name>
              <description>Wake-up 8 Input Status</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>The corresponding wake-up input was active at the time the debouncer triggered a wake-up event.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WKUPIS9</name>
              <description>Wake-up 9 Input Status</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>The corresponding wake-up input was active at the time the debouncer triggered a wake-up event.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
