betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SMC</name>
      <description>Static Memory Controller</description>
      <baseAddress>0xF8014000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x20</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x70</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x84</offset>
        <size>0x18</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x500</offset>
        <size>0x24</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x528</offset>
        <size>0x88</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x7A0</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x7E4</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ADDR</name>
          <description>NFC Address Cycle Zero Register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADDR_CYCLE0</name>
              <description>NAND Flash Array Address Cycle 0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>BANK</name>
          <description>Bank Address Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BANK</name>
              <description>Bank Identifier</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG</name>
          <description>NFC Configuration Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PAGESIZE</name>
              <description>Page Size of the NAND Flash Device</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PS512</name>
                  <description>Main area 512 bytes</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PS1024</name>
                  <description>Main area 1024 bytes</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PS2048</name>
                  <description>Main area 2048 bytes</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PS4096</name>
                  <description>Main area 4096 bytes</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PS8192</name>
                  <description>Main area 8192 bytes</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WSPARE</name>
              <description>Write Spare Area</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RSPARE</name>
              <description>Read Spare Area</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EDGECTRL</name>
              <description>Rising/Falling Edge Detection Control</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RBEDGE</name>
              <description>Ready/Busy Signal Edge Detection</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DTOCYC</name>
              <description>Data Timeout Cycle Number</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DTOMUL</name>
              <description>Data Timeout Multiplier</description>
              <bitRange>[22:20]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>X1</name>
                  <description>DTOCYC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>X16</name>
                  <description>DTOCYC x 16</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>X128</name>
                  <description>DTOCYC x 128</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>X256</name>
                  <description>DTOCYC x 256</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>X1024</name>
                  <description>DTOCYC x 1024</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>X4096</name>
                  <description>DTOCYC x 4096</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>X65536</name>
                  <description>DTOCYC x 65536</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>X1048576</name>
                  <description>DTOCYC x 1048576</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NFCSPARESIZE</name>
              <description>NAND Flash Spare Area Size Retrieved by the Host Controller</description>
              <bitRange>[30:24]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL</name>
          <description>NFC Control Register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>NFCEN</name>
              <description>NAND Flash Controller Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NFCDIS</name>
              <description>NAND Flash Controller Disable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELCFG</name>
          <description>PMECC Error Location Configuration Register</description>
          <addressOffset>0x500</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SECTORSZ</name>
              <description>Sector Size</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SECTORSZ0</name>
                  <description>Use  512 Byte Sector in Location Computation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECTORSZ1</name>
                  <description>Use 1024 Byte Sector in Location Computation</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERRNUM</name>
              <description>Number of Errors</description>
              <bitRange>[20:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ELDIS</name>
          <description>PMECC Error Location Disable Register</description>
          <addressOffset>0x50C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>DIS</name>
              <description>Disable Error Location Engine</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELEN</name>
          <description>PMECC Error Location Enable Register</description>
          <addressOffset>0x508</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>ENINIT</name>
              <description>Error Location Enable</description>
              <bitRange>[13:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>16383</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ELIDR</name>
          <description>PMECC Error Location Interrupt Disable Register</description>
          <addressOffset>0x518</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>DONE</name>
              <description>Computation Terminated Interrupt Disable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELIER</name>
          <description>PMECC Error Location Interrupt Enable register</description>
          <addressOffset>0x514</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>DONE</name>
              <description>Computation Terminated Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELIMR</name>
          <description>PMECC Error Location Interrupt Mask Register</description>
          <addressOffset>0x51C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>DONE</name>
              <description>Computation Terminated Interrupt Mask</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELISR</name>
          <description>PMECC Error Location Interrupt Status Register</description>
          <addressOffset>0x520</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>DONE</name>
              <description>Computation Terminated Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ERR_CNT</name>
              <description>Error Counter value</description>
              <bitRange>[13:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ELPRIM</name>
          <description>PMECC Error Location Primitive Register</description>
          <addressOffset>0x504</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>PRIMITIV</name>
              <description>Primitive Polynomial</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ELSR</name>
          <description>PMECC Error Location Status Register</description>
          <addressOffset>0x510</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>BUSY</name>
              <description>Error Location Engine Busy</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ERRLOC</name>
          <description>PMECC Error Location 0 Register</description>
          <addressOffset>0x5AC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>ERRLOCN</name>
              <description>Error Position within the Set {sector area, spare area}</description>
              <bitRange>[13:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>16383</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>IDR</name>
          <description>NFC Interrupt Disable Register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>RB_RISE</name>
              <description>Ready Busy Rising Edge Detection Interrupt Disable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RB_FALL</name>
              <description>Ready Busy Falling Edge Detection Interrupt Disable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XFRDONE</name>
              <description>Transfer Done Interrupt Disable</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMDDONE</name>
              <description>Command Done Interrupt Disable</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DTOE</name>
              <description>Data Timeout Error Interrupt Disable</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UNDEF</name>
              <description>Undefined Area Access Interrupt Disable</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AWB</name>
              <description>Accessing While Busy Interrupt Disable</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NFCASE</name>
              <description>NFC Access Size Error Interrupt Disable</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RB_EDGE0</name>
              <description>Ready/Busy Line 0 Interrupt Disable</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <description>NFC Interrupt Enable Register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>RB_RISE</name>
              <description>Ready Busy Rising Edge Detection Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RB_FALL</name>
              <description>Ready Busy Falling Edge Detection Interrupt Enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XFRDONE</name>
              <description>Transfer Done Interrupt Enable</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMDDONE</name>
              <description>Command Done Interrupt Enable</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DTOE</name>
              <description>Data Timeout Error Interrupt Enable</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UNDEF</name>
              <description>Undefined Area Access Interrupt Enable</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AWB</name>
              <description>Accessing While Busy Interrupt Enable</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NFCASE</name>
              <description>NFC Access Size Error Interrupt Enable</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RB_EDGE0</name>
              <description>Ready/Busy Line 0 Interrupt Enable</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMR</name>
          <description>NFC Interrupt Mask Register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RB_RISE</name>
              <description>Ready Busy Rising Edge Detection Interrupt Mask</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RB_FALL</name>
              <description>Ready Busy Falling Edge Detection Interrupt Mask</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XFRDONE</name>
              <description>Transfer Done Interrupt Mask</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMDDONE</name>
              <description>Command Done Interrupt Mask</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DTOE</name>
              <description>Data Timeout Error Interrupt Mask</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UNDEF</name>
              <description>Undefined Area Access Interrupt Mask5</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AWB</name>
              <description>Accessing While Busy Interrupt Mask</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NFCASE</name>
              <description>NFC Access Size Error Interrupt Mask</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RB_EDGE0</name>
              <description>Ready/Busy Line 0 Interrupt Mask</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
