betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
        <register>
          <name>KEY1</name>
          <description>Off Chip Memory Scrambling KEY1 Register</description>
          <addressOffset>0x7A4</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>KEY1</name>
              <description>Off Chip Memory Scrambling (OCMS) Key Part 1</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY2</name>
          <description>Off Chip Memory Scrambling KEY2 Register</description>
          <addressOffset>0x7A8</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>KEY2</name>
              <description>Off Chip Memory Scrambling (OCMS) Key Part 2</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>OCMS</name>
          <description>Off Chip Memory Scrambling Register</description>
          <addressOffset>0x7A0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SMSE</name>
              <description>Static Memory Controller Scrambling Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SRSE</name>
              <description>NFC Internal SRAM Scrambling Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMECCEADDR</name>
          <description>PMECC End Address Register</description>
          <addressOffset>0x7C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENDADDR</name>
              <description>ECC Area End Address</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>511</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PMECCFG</name>
          <description>PMECC Configuration Register</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BCH_ERR</name>
              <description>Error Correcting Capability</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BCH_ERR2</name>
                  <description>2 errors</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BCH_ERR4</name>
                  <description>4 errors</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BCH_ERR8</name>
                  <description>8 errors</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BCH_ERR12</name>
                  <description>12 errors</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BCH_ERR24</name>
                  <description>24 errors</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BCH_ERR32</name>
                  <description>32 errors</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SECTORSZ</name>
              <description>Sector Size</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SECTORSZ0</name>
                  <description>Use  512 Byte Sector in ECC Computation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECTORSZ1</name>
                  <description>Use 1024 Byte Sector in ECC Computation</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAGESIZE</name>
              <description>Number of Sectors in the Page</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PAGESIZE_1SEC</name>
                  <description>1 sector for main area (512 or 1024 bytes)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAGESIZE_2SEC</name>
                  <description>2 sectors for main area (1024 or 2048 bytes)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAGESIZE_4SEC</name>
                  <description>4 sectors for main area (2048 or 4096 bytes)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAGESIZE_8SEC</name>
                  <description>8 sectors for main area (4096 or 8192 bytes)</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NANDWR</name>
              <description>NAND Write Access</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SPAREEN</name>
              <description>Spare Enable</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AUTO</name>
              <description>Automatic Mode Enable</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMECCIDR</name>
          <description>PMECC Interrupt Disable Register</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>ERRID</name>
              <description>Error Interrupt Disable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMECCIER</name>
          <description>PMECC Interrupt Enable register</description>
          <addressOffset>0x8C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>ERRIE</name>
              <description>Error Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMECCIMR</name>
          <description>PMECC Interrupt Mask Register</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>ERRIM</name>
              <description>Error Interrupt Mask</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMECCISR</name>
          <description>PMECC Interrupt Status Register</description>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>ERRIS</name>
              <description>Error Interrupt Status Register</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PMECCSADDR</name>
          <description>PMECC Start Address Register</description>
          <addressOffset>0x78</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>STARTADDR</name>
              <description>ECC Area Start Address</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>511</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PMECCSAREA</name>
          <description>PMECC Spare Area Size Register</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SPARESIZE</name>
              <description>Spare Area Size</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>511</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PMECCSR</name>
          <description>PMECC Status Register</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>BUSY</name>
              <description>The kernel of the PMECC is busy</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>PMECC Enable bit</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMECCTRL</name>
          <description>PMECC Control Register</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>RST</name>
              <description>Reset the PMECC Module</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA</name>
              <description>Start a Data Phase</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>USER</name>
              <description>Start a User Mode Phase</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>PMECC Enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DISABLE</name>
              <description>PMECC Enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SIGMA0</name>
          <description>PMECC Error Location SIGMA 0 Register</description>
          <addressOffset>0x528</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>SIGMA0</name>
              <description>Coefficient of degree 0 in the SIGMA polynomial</description>
              <bitRange>[13:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>16383</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SIGMA1</name>
          <description>PMECC Error Location SIGMA 1 Register</description>
          <addressOffset>0x52C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SIGMA1</name>
              <description>Coefficient of degree x in the SIGMA polynomial</description>
              <bitRange>[13:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>16383</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SIGMA10</name>
          <description>PMECC Error Location SIGMA 10 Register</description>
          <addressOffset>0x550</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SIGMA10</name>
              <description>Coefficient of degree x in the SIGMA polynomial</description>
              <bitRange>[13:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>16383</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SIGMA11</name>
          <description>PMECC Error Location SIGMA 11 Register</description>
          <addressOffset>0x554</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SIGMA11</name>
              <description>Coefficient of degree x in the SIGMA polynomial</description>
              <bitRange>[13:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>16383</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SIGMA12</name>
          <description>PMECC Error Location SIGMA 12 Register</description>
          <addressOffset>0x558</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SIGMA12</name>
              <description>Coefficient of degree x in the SIGMA polynomial</description>
              <bitRange>[13:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>16383</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SIGMA13</name>
          <description>PMECC Error Location SIGMA 13 Register</description>
          <addressOffset>0x55C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SIGMA13</name>
              <description>Coefficient of degree x in the SIGMA polynomial</description>
              <bitRange>[13:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>16383</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SIGMA14</name>
          <description>PMECC Error Location SIGMA 14 Register</description>
          <addressOffset>0x560</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SIGMA14</name>
              <description>Coefficient of degree x in the SIGMA polynomial</description>
              <bitRange>[13:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>16383</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SIGMA15</name>
          <description>PMECC Error Location SIGMA 15 Register</description>
          <addressOffset>0x564</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SIGMA15</name>
              <description>Coefficient of degree x in the SIGMA polynomial</description>
              <bitRange>[13:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>16383</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SIGMA16</name>
          <description>PMECC Error Location SIGMA 16 Register</description>
          <addressOffset>0x568</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SIGMA16</name>
              <description>Coefficient of degree x in the SIGMA polynomial</description>
              <bitRange>[13:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>16383</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SIGMA17</name>
          <description>PMECC Error Location SIGMA 17 Register</description>
          <addressOffset>0x56C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SIGMA17</name>
              <description>Coefficient of degree x in the SIGMA polynomial</description>
              <bitRange>[13:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>16383</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SIGMA18</name>
          <description>PMECC Error Location SIGMA 18 Register</description>
          <addressOffset>0x570</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SIGMA18</name>
              <description>Coefficient of degree x in the SIGMA polynomial</description>
              <bitRange>[13:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>16383</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SIGMA19</name>
          <description>PMECC Error Location SIGMA 19 Register</description>
          <addressOffset>0x574</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SIGMA19</name>
              <description>Coefficient of degree x in the SIGMA polynomial</description>
              <bitRange>[13:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>16383</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SIGMA2</name>
          <description>PMECC Error Location SIGMA 2 Register</description>
          <addressOffset>0x530</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SIGMA2</name>
              <description>Coefficient of degree x in the SIGMA polynomial</description>
              <bitRange>[13:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>16383</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SIGMA20</name>
          <description>PMECC Error Location SIGMA 20 Register</description>
          <addressOffset>0x578</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SIGMA20</name>
              <description>Coefficient of degree x in the SIGMA polynomial</description>
              <bitRange>[13:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>16383</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
