betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SSC0</name>
      <description>Synchronous Serial Controller</description>
      <baseAddress>0xF8004000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x18</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x30</offset>
        <size>0x20</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xE4</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CMR</name>
          <description>Clock Mode Register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DIV</name>
              <description>Clock Divider</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <description>Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>RXEN</name>
              <description>Receive Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXDIS</name>
              <description>Receive Disable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXEN</name>
              <description>Transmit Enable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXDIS</name>
              <description>Transmit Disable</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWRST</name>
              <description>Software Reset</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDR</name>
          <description>Interrupt Disable Register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>TXRDY</name>
              <description>Transmit Ready Interrupt Disable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXEMPTY</name>
              <description>Transmit Empty Interrupt Disable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXRDY</name>
              <description>Receive Ready Interrupt Disable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OVRUN</name>
              <description>Receive Overrun Interrupt Disable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CP0</name>
              <description>Compare 0 Interrupt Disable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CP1</name>
              <description>Compare 1 Interrupt Disable</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXSYN</name>
              <description>Tx Sync Interrupt Enable</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXSYN</name>
              <description>Rx Sync Interrupt Enable</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <description>Interrupt Enable Register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>TXRDY</name>
              <description>Transmit Ready Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXEMPTY</name>
              <description>Transmit Empty Interrupt Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXRDY</name>
              <description>Receive Ready Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OVRUN</name>
              <description>Receive Overrun Interrupt Enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CP0</name>
              <description>Compare 0 Interrupt Enable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CP1</name>
              <description>Compare 1 Interrupt Enable</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXSYN</name>
              <description>Tx Sync Interrupt Enable</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXSYN</name>
              <description>Rx Sync Interrupt Enable</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMR</name>
          <description>Interrupt Mask Register</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>TXRDY</name>
              <description>Transmit Ready Interrupt Mask</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXEMPTY</name>
              <description>Transmit Empty Interrupt Mask</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXRDY</name>
              <description>Receive Ready Interrupt Mask</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OVRUN</name>
              <description>Receive Overrun Interrupt Mask</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CP0</name>
              <description>Compare 0 Interrupt Mask</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CP1</name>
              <description>Compare 1 Interrupt Mask</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXSYN</name>
              <description>Tx Sync Interrupt Mask</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXSYN</name>
              <description>Rx Sync Interrupt Mask</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RC0R</name>
          <description>Receive Compare 0 Register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CP0</name>
              <description>Receive Compare Data 0</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RC1R</name>
          <description>Receive Compare 1 Register</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CP1</name>
              <description>Receive Compare Data 1</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RCMR</name>
          <description>Receive Clock Mode Register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CKS</name>
              <description>Receive Clock Selection</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MCK</name>
                  <description>Divided Clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TK</name>
                  <description>TK Clock signal</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RK</name>
                  <description>RK pin</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CKO</name>
              <description>Receive Clock Output Mode Selection</description>
              <bitRange>[4:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>None, RK pin is an input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONTINUOUS</name>
                  <description>Continuous Receive Clock, RK pin is an output</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRANSFER</name>
                  <description>Receive Clock only during data transfers, RK pin is an output</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CKI</name>
              <description>Receive Clock Inversion</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CKG</name>
              <description>Receive Clock Gating Selection</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CONTINUOUS</name>
                  <description>None</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_RF_LOW</name>
                  <description>Receive Clock enabled only if RF Low</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_RF_HIGH</name>
                  <description>Receive Clock enabled only if RF High</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>START</name>
              <description>Receive Start Selection</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CONTINUOUS</name>
                  <description>Continuous, as soon as the receiver is enabled, and immediately after the end of transfer of the previous data.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRANSMIT</name>
                  <description>Transmit start</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RF_LOW</name>
                  <description>Detection of a low level on RF signal</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RF_HIGH</name>
                  <description>Detection of a high level on RF signal</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RF_FALLING</name>
                  <description>Detection of a falling edge on RF signal</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RF_RISING</name>
                  <description>Detection of a rising edge on RF signal</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RF_LEVEL</name>
                  <description>Detection of any level change on RF signal</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RF_EDGE</name>
                  <description>Detection of any edge on RF signal</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMP_0</name>
                  <description>Compare 0</description>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOP</name>
              <description>Receive Stop Selection</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>STTDLY</name>
              <description>Receive Start Delay</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PERIOD</name>
              <description>Receive Period Divider Selection</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RFMR</name>
          <description>Receive Frame Mode Register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DATLEN</name>
              <description>Data Length</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>LOOP</name>
              <description>Loop Mode</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MSBF</name>
              <description>Most Significant Bit First</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DATNB</name>
              <description>Data Number per Frame</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FSLEN</name>
              <description>Receive Frame Sync Length</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FSOS</name>
              <description>Receive Frame Sync Output Selection</description>
              <bitRange>[22:20]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>None, RF pin is an input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEGATIVE</name>
                  <description>Negative Pulse, RF pin is an output</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POSITIVE</name>
                  <description>Positive Pulse, RF pin is an output</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Driven Low during data transfer, RF pin is an output</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>Driven High during data transfer, RF pin is an output</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOGGLING</name>
                  <description>Toggling at each start of data transfer, RF pin is an output</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FSEDGE</name>
              <description>Frame Sync Edge Detection</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POSITIVE</name>
                  <description>Positive Edge Detection</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEGATIVE</name>
                  <description>Negative Edge Detection</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FSLEN_EXT</name>
              <description>FSLEN Field Extension</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RHR</name>
          <description>Receive Holding Register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RDAT</name>
              <description>Receive Data</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
