betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
        <register>
          <name>RSHR</name>
          <description>Receive Sync. Holding Register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RSDAT</name>
              <description>Receive Synchronization Data</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>Status Register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>TXRDY</name>
              <description>Transmit Ready</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXEMPTY</name>
              <description>Transmit Empty</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXRDY</name>
              <description>Receive Ready</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OVRUN</name>
              <description>Receive Overrun</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CP0</name>
              <description>Compare 0</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CP1</name>
              <description>Compare 1</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXSYN</name>
              <description>Transmit Sync</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXSYN</name>
              <description>Receive Sync</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXEN</name>
              <description>Transmit Enable</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXEN</name>
              <description>Receive Enable</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TCMR</name>
          <description>Transmit Clock Mode Register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CKS</name>
              <description>Transmit Clock Selection</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MCK</name>
                  <description>Divided Clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RK</name>
                  <description>RK Clock signal</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TK</name>
                  <description>TK pin</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CKO</name>
              <description>Transmit Clock Output Mode Selection</description>
              <bitRange>[4:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>None, TK pin is an input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONTINUOUS</name>
                  <description>Continuous Transmit Clock, TK pin is an output</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRANSFER</name>
                  <description>Transmit Clock only during data transfers, TK pin is an output</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CKI</name>
              <description>Transmit Clock Inversion</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CKG</name>
              <description>Transmit Clock Gating Selection</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CONTINUOUS</name>
                  <description>None</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_TF_LOW</name>
                  <description>Transmit Clock enabled only if TF Low</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_TF_HIGH</name>
                  <description>Transmit Clock enabled only if TF High</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>START</name>
              <description>Transmit Start Selection</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CONTINUOUS</name>
                  <description>Continuous, as soon as a word is written in the SSC_THR (if Transmit is enabled), and immediately after the end of transfer of the previous data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RECEIVE</name>
                  <description>Receive start</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TF_LOW</name>
                  <description>Detection of a low level on TF signal</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TF_HIGH</name>
                  <description>Detection of a high level on TF signal</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TF_FALLING</name>
                  <description>Detection of a falling edge on TF signal</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TF_RISING</name>
                  <description>Detection of a rising edge on TF signal</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TF_LEVEL</name>
                  <description>Detection of any level change on TF signal</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TF_EDGE</name>
                  <description>Detection of any edge on TF signal</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STTDLY</name>
              <description>Transmit Start Delay</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PERIOD</name>
              <description>Transmit Period Divider Selection</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TFMR</name>
          <description>Transmit Frame Mode Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DATLEN</name>
              <description>Data Length</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DATDEF</name>
              <description>Data Default Value</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MSBF</name>
              <description>Most Significant Bit First</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DATNB</name>
              <description>Data Number per Frame</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FSLEN</name>
              <description>Transmit Frame Sync Length</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FSOS</name>
              <description>Transmit Frame Sync Output Selection</description>
              <bitRange>[22:20]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>None, TF pin is an input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEGATIVE</name>
                  <description>Negative Pulse, TF pin is an output</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POSITIVE</name>
                  <description>Positive Pulse, TF pin is an output</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Driven Low during data transfer</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>Driven High during data transfer</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOGGLING</name>
                  <description>Toggling at each start of data transfer</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FSDEN</name>
              <description>Frame Sync Data Enable</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FSEDGE</name>
              <description>Frame Sync Edge Detection</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POSITIVE</name>
                  <description>Positive Edge Detection</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEGATIVE</name>
                  <description>Negative Edge Detection</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FSLEN_EXT</name>
              <description>FSLEN Field Extension</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>THR</name>
          <description>Transmit Holding Register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>TDAT</name>
              <description>Transmit Data</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TSHR</name>
          <description>Transmit Sync. Holding Register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TSDAT</name>
              <description>Transmit Synchronization Data</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>WPMR</name>
          <description>Write Protection Mode Register</description>
          <addressOffset>0xE4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WPEN</name>
              <description>Write Protection Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WPKEY</name>
              <description>Write Protection Key</description>
              <bitRange>[31:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PASSWD</name>
                  <description>Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0.</description>
                  <value>5460803</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WPSR</name>
          <description>Write Protection Status Register</description>
          <addressOffset>0xE8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>WPVS</name>
              <description>Write Protection Violation Status</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WPVSRC</name>
              <description>Write Protect Violation Source</description>
              <bitRange>[23:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
