betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="SSC0">
      <name>SSC1</name>
      <description>Synchronous Serial Controller</description>
      <baseAddress>0xFC004000</baseAddress>
    </peripheral>
    <peripheral>
      <name>TC0</name>
      <description>Timer Counter</description>
      <baseAddress>0xF800C000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1C</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x24</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>BCR</name>
          <description>Block Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>SYNC</name>
              <description>Synchro Command</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BMR</name>
          <description>Block Mode Register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TC0XC0S</name>
              <description>External Clock Signal 0 Selection</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TCLK0</name>
                  <description>Signal connected to XC0: TCLK0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIOA1</name>
                  <description>Signal connected to XC0: TIOA1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIOA2</name>
                  <description>Signal connected to XC0: TIOA2</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TC1XC1S</name>
              <description>External Clock Signal 1 Selection</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TCLK1</name>
                  <description>Signal connected to XC1: TCLK1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIOA0</name>
                  <description>Signal connected to XC1: TIOA0</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIOA2</name>
                  <description>Signal connected to XC1: TIOA2</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TC2XC2S</name>
              <description>External Clock Signal 2 Selection</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TCLK2</name>
                  <description>Signal connected to XC2: TCLK2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIOA0</name>
                  <description>Signal connected to XC2: TIOA0</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIOA1</name>
                  <description>Signal connected to XC2: TIOA1</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QDEN</name>
              <description>Quadrature Decoder Enabled</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>POSEN</name>
              <description>Position Enabled</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SPEEDEN</name>
              <description>Speed Enabled</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>QDTRANS</name>
              <description>Quadrature Decoding Transparent</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EDGPHA</name>
              <description>Edge on PHA Count Mode</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INVA</name>
              <description>Inverted PHA</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INVB</name>
              <description>Inverted PHB</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INVIDX</name>
              <description>Inverted Index</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWAP</name>
              <description>Swap PHA and PHB</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IDXPHB</name>
              <description>Index Pin is PHB Pin</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AUTOC</name>
              <description>AutoCorrection of missing pulses</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>The detection and autocorrection function is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>The detection and autocorrection function is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MAXFILT</name>
              <description>Maximum Filter</description>
              <bitRange>[25:20]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MAXCMP</name>
              <description>Maximum Consecutive Missing Pulses</description>
              <bitRange>[29:26]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>FMR</name>
          <description>Fault Mode Register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENCF0</name>
              <description>Enable Compare Fault Channel 0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENCF1</name>
              <description>Enable Compare Fault Channel 1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>QIDR</name>
          <description>QDEC Interrupt Disable Register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>IDX</name>
              <description>Index</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DIRCHG</name>
              <description>Direction Change</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>QERR</name>
              <description>Quadrature Error</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MPE</name>
              <description>Consecutive Missing Pulse Error</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>QIER</name>
          <description>QDEC Interrupt Enable Register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>IDX</name>
              <description>Index</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DIRCHG</name>
              <description>Direction Change</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>QERR</name>
              <description>Quadrature Error</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MPE</name>
              <description>Consecutive Missing Pulse Error</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>QIMR</name>
          <description>QDEC Interrupt Mask Register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>IDX</name>
              <description>Index</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DIRCHG</name>
              <description>Direction Change</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>QERR</name>
              <description>Quadrature Error</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MPE</name>
              <description>Consecutive Missing Pulse Error</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>QISR</name>
          <description>QDEC Interrupt Status Register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>IDX</name>
              <description>Index</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DIRCHG</name>
              <description>Direction Change</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>QERR</name>
              <description>Quadrature Error</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MPE</name>
              <description>Consecutive Missing Pulse Error</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DIR</name>
              <description>Direction</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WPMR</name>
          <description>Write Protection Mode Register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WPEN</name>
              <description>Write Protection Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WPKEY</name>
              <description>Write Protection Key</description>
              <bitRange>[31:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PASSWD</name>
                  <description>Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0.</description>
                  <value>5523789</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR0</name>
          <description>Channel Control Register.</description>
          <addressOffset>0x00</addressOffset>
          <fields>
            <field>
              <name>CLKEN</name>
              <description>Counter Clock Enable Command.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLKDIS</name>
              <description>Counter Clock Disable Command.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWTRG</name>
              <description>Software Trigger Command.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR1</name>
          <description>Channel Control Register.</description>
          <addressOffset>0x40</addressOffset>
          <fields>
            <field>
              <name>CLKEN</name>
              <description>Counter Clock Enable Command.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLKDIS</name>
              <description>Counter Clock Disable Command.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWTRG</name>
              <description>Software Trigger Command.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR2</name>
          <description>Channel Control Register.</description>
          <addressOffset>0x80</addressOffset>
          <fields>
            <field>
              <name>CLKEN</name>
              <description>Counter Clock Enable Command.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLKDIS</name>
              <description>Counter Clock Disable Command.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWTRG</name>
              <description>Software Trigger Command.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CMR0</name>
          <description>Channel Mode Register.</description>
          <addressOffset>0x04</addressOffset>
        </register>
        <register>
          <name>CMR1</name>
          <description>Channel Mode Register.</description>
          <addressOffset>0x44</addressOffset>
        </register>
        <register>
          <name>CMR2</name>
          <description>Channel Mode Register.</description>
          <addressOffset>0x84</addressOffset>
        </register>
        <register>
          <name>SMMR0</name>
          <description>Stepper Motor Mode Register.</description>
          <addressOffset>0x08</addressOffset>
          <fields>
            <field>
              <name>GCEN</name>
              <description>Gray Count Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DOWN</name>
              <description>Down Count</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SMMR1</name>
          <description>Stepper Motor Mode Register.</description>
          <addressOffset>0x48</addressOffset>
          <fields>
            <field>
              <name>GCEN</name>
              <description>Gray Count Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DOWN</name>
              <description>Down Count</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SMMR2</name>
          <description>Stepper Motor Mode Register.</description>
          <addressOffset>0x88</addressOffset>
          <fields>
            <field>
              <name>GCEN</name>
              <description>Gray Count Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DOWN</name>
              <description>Down Count</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RAB0</name>
          <description>Register A or B.</description>
          <addressOffset>0x0C</addressOffset>
        </register>
        <register>
          <name>RAB1</name>
          <description>Register A or B.</description>
          <addressOffset>0x4C</addressOffset>
        </register>
        <register>
          <name>RAB2</name>
          <description>Register A or B.</description>
          <addressOffset>0x8C</addressOffset>
        </register>
        <register>
          <name>CV0</name>
          <description>Counter Value.</description>
          <addressOffset>0x10</addressOffset>
        </register>
        <register>
          <name>CV1</name>
          <description>Counter Value.</description>
          <addressOffset>0x50</addressOffset>
        </register>
        <register>
          <name>CV2</name>
          <description>Counter Value.</description>
          <addressOffset>0x90</addressOffset>
        </register>
        <register>
          <name>RA0</name>
          <description>Register A.</description>
          <addressOffset>0x14</addressOffset>
        </register>
        <register>
          <name>RA1</name>
          <description>Register A.</description>
          <addressOffset>0x54</addressOffset>
        </register>
        <register>
          <name>RA2</name>
          <description>Register A.</description>
          <addressOffset>0x84</addressOffset>
        </register>
        <register>
          <name>RB0</name>
          <description>Register B.</description>
          <addressOffset>0x18</addressOffset>
        </register>
        <register>
          <name>RB1</name>
          <description>Register B.</description>
          <addressOffset>0x58</addressOffset>
        </register>
        <register>
          <name>RB2</name>
          <description>Register B.</description>
          <addressOffset>0x88</addressOffset>
        </register>
        <register>
          <name>RC0</name>
          <description>Register C.</description>
          <addressOffset>0x1C</addressOffset>
        </register>
        <register>
          <name>RC1</name>
          <description>Register C.</description>
          <addressOffset>0x5C</addressOffset>
        </register>
        <register>
          <name>RC2</name>
          <description>Register C.</description>
          <addressOffset>0x8C</addressOffset>
        </register>
