betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
        <register>
          <name>SR0</name>
          <description>Interrupt Status Register.</description>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>COVFS</name>
              <description>Counter Overflow Status (cleared on read)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LOVRS</name>
              <description>Load Overrun Status (cleared on read)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPAS</name>
              <description>RA Compare Status (cleared on read)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPBS</name>
              <description>RB Compare Status (cleared on read)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPCS</name>
              <description>RC Compare Status (cleared on read)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LDRAS</name>
              <description>RA Loading Status (cleared on read)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LDRBS</name>
              <description>RB Loading Status (cleared on read)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ETRGS</name>
              <description>External Trigger Status (cleared on read)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLKSTA</name>
              <description>Clock Enabling Status</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MTIOA</name>
              <description>TIOAx Mirror</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MTIOB</name>
              <description>TIOBx Mirror</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR1</name>
          <description>Interrupt Status Register.</description>
          <addressOffset>0x60</addressOffset>
          <fields>
            <field>
              <name>COVFS</name>
              <description>Counter Overflow Status (cleared on read)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LOVRS</name>
              <description>Load Overrun Status (cleared on read)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPAS</name>
              <description>RA Compare Status (cleared on read)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPBS</name>
              <description>RB Compare Status (cleared on read)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPCS</name>
              <description>RC Compare Status (cleared on read)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LDRAS</name>
              <description>RA Loading Status (cleared on read)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LDRBS</name>
              <description>RB Loading Status (cleared on read)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ETRGS</name>
              <description>External Trigger Status (cleared on read)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLKSTA</name>
              <description>Clock Enabling Status</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MTIOA</name>
              <description>TIOAx Mirror</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MTIOB</name>
              <description>TIOBx Mirror</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR2</name>
          <description>Interrupt Status Register.</description>
          <addressOffset>0xA0</addressOffset>
          <fields>
            <field>
              <name>COVFS</name>
              <description>Counter Overflow Status (cleared on read)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LOVRS</name>
              <description>Load Overrun Status (cleared on read)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPAS</name>
              <description>RA Compare Status (cleared on read)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPBS</name>
              <description>RB Compare Status (cleared on read)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPCS</name>
              <description>RC Compare Status (cleared on read)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LDRAS</name>
              <description>RA Loading Status (cleared on read)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LDRBS</name>
              <description>RB Loading Status (cleared on read)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ETRGS</name>
              <description>External Trigger Status (cleared on read)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLKSTA</name>
              <description>Clock Enabling Status</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MTIOA</name>
              <description>TIOAx Mirror</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MTIOB</name>
              <description>TIOBx Mirror</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IER0</name>
          <description>Interrupt Enable Register</description>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>COVFS</name>
              <description>Counter Overflow</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LOVRS</name>
              <description>Load Overrun</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPAS</name>
              <description>RA Compare</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPBS</name>
              <description>RB Compare</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPCS</name>
              <description>RC Compare</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LDRAS</name>
              <description>RA Loading</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LDRBS</name>
              <description>RB Loading</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ETRGS</name>
              <description>External Trigger</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IER1</name>
          <description>Interrupt Enable Register</description>
          <addressOffset>0x64</addressOffset>
          <fields>
            <field>
              <name>COVFS</name>
              <description>Counter Overflow</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LOVRS</name>
              <description>Load Overrun</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPAS</name>
              <description>RA Compare</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPBS</name>
              <description>RB Compare</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPCS</name>
              <description>RC Compare</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LDRAS</name>
              <description>RA Loading</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LDRBS</name>
              <description>RB Loading</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ETRGS</name>
              <description>External Trigger</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IER2</name>
          <description>Interrupt Enable Register</description>
          <addressOffset>0xA4</addressOffset>
          <fields>
            <field>
              <name>COVFS</name>
              <description>Counter Overflow</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LOVRS</name>
              <description>Load Overrun</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPAS</name>
              <description>RA Compare</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPBS</name>
              <description>RB Compare</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPCS</name>
              <description>RC Compare</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LDRAS</name>
              <description>RA Loading</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LDRBS</name>
              <description>RB Loading</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ETRGS</name>
              <description>External Trigger</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IDR0</name>
          <description>Interrupt Disable Register</description>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>COVFS</name>
              <description>Counter Overflow</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LOVRS</name>
              <description>Load Overrun</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPAS</name>
              <description>RA Compare</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPBS</name>
              <description>RB Compare</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPCS</name>
              <description>RC Compare</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LDRAS</name>
              <description>RA Loading</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LDRBS</name>
              <description>RB Loading</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ETRGS</name>
              <description>External Trigger</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IDR1</name>
          <description>Interrupt Disable Register</description>
          <addressOffset>0x68</addressOffset>
          <fields>
            <field>
              <name>COVFS</name>
              <description>Counter Overflow</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LOVRS</name>
              <description>Load Overrun</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPAS</name>
              <description>RA Compare</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPBS</name>
              <description>RB Compare</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPCS</name>
              <description>RC Compare</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LDRAS</name>
              <description>RA Loading</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LDRBS</name>
              <description>RB Loading</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ETRGS</name>
              <description>External Trigger</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IDR2</name>
          <description>Interrupt Disable Register</description>
          <addressOffset>0xA8</addressOffset>
          <fields>
            <field>
              <name>COVFS</name>
              <description>Counter Overflow</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LOVRS</name>
              <description>Load Overrun</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPAS</name>
              <description>RA Compare</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPBS</name>
              <description>RB Compare</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPCS</name>
              <description>RC Compare</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LDRAS</name>
              <description>RA Loading</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LDRBS</name>
              <description>RB Loading</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ETRGS</name>
              <description>External Trigger</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IMR0</name>
          <description>Interrupt Mask Register</description>
          <addressOffset>0x2C</addressOffset>
          <fields>
            <field>
              <name>COVFS</name>
              <description>Counter Overflow</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LOVRS</name>
              <description>Load Overrun</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPAS</name>
              <description>RA Compare</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPBS</name>
              <description>RB Compare</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPCS</name>
              <description>RC Compare</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LDRAS</name>
              <description>RA Loading</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LDRBS</name>
              <description>RB Loading</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ETRGS</name>
              <description>External Trigger</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IMR1</name>
          <description>Interrupt Mask Register</description>
          <addressOffset>0x6C</addressOffset>
          <fields>
            <field>
              <name>COVFS</name>
              <description>Counter Overflow</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LOVRS</name>
              <description>Load Overrun</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPAS</name>
              <description>RA Compare</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPBS</name>
              <description>RB Compare</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPCS</name>
              <description>RC Compare</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LDRAS</name>
              <description>RA Loading</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LDRBS</name>
              <description>RB Loading</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ETRGS</name>
              <description>External Trigger</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
