betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
        <register>
          <name>IMR2</name>
          <description>Interrupt Mask Register</description>
          <addressOffset>0xAC</addressOffset>
          <fields>
            <field>
              <name>COVFS</name>
              <description>Counter Overflow</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LOVRS</name>
              <description>Load Overrun</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPAS</name>
              <description>RA Compare</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPBS</name>
              <description>RB Compare</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPCS</name>
              <description>RC Compare</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LDRAS</name>
              <description>RA Loading</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LDRBS</name>
              <description>RB Loading</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ETRGS</name>
              <description>External Trigger</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EMR0</name>
          <description>Extended Mode Register.</description>
          <addressOffset>0x30</addressOffset>
          <fields>
            <field>
              <name>TRIGSRCA</name>
              <description>Trigger Source for Input A.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TRIGSRCB</name>
              <description>Trigger Source for Input B.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>NODIVCLK</name>
              <description>No Divided Clock.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EMR1</name>
          <description>Extended Mode Register.</description>
          <addressOffset>0xB0</addressOffset>
          <fields>
            <field>
              <name>TRIGSRCA</name>
              <description>Trigger Source for Input A.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TRIGSRCB</name>
              <description>Trigger Source for Input B.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>NODIVCLK</name>
              <description>No Divided Clock.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EMR2</name>
          <description>Extended Mode Register.</description>
          <addressOffset>0xF0</addressOffset>
          <fields>
            <field>
              <name>TRIGSRCA</name>
              <description>Trigger Source for Input A.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TRIGSRCB</name>
              <description>Trigger Source for Input B.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>NODIVCLK</name>
              <description>No Divided Clock.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="TC0">
      <name>TC1</name>
      <description>Timer Counter</description>
      <baseAddress>0xF8010000</baseAddress>
    </peripheral>
    <peripheral>
      <name>TDES</name>
      <description>Triple Data Encryption Standard</description>
      <baseAddress>0xFC044000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x14</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x28</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x30</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x40</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x50</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x60</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x70</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR</name>
          <description>Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>START</name>
              <description>Start Processing</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWRST</name>
              <description>Software Reset</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDATAR</name>
          <description>Input Data Register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>IDATA</name>
              <description>Input Data</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>IDR</name>
          <description>Interrupt Disable Register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>DATRDY</name>
              <description>Data Ready Interrupt Disable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>URAD</name>
              <description>Unspecified Register Access Detection Interrupt Disable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <description>Interrupt Enable Register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>DATRDY</name>
              <description>Data Ready Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>URAD</name>
              <description>Unspecified Register Access Detection Interrupt Enable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMR</name>
          <description>Interrupt Mask Register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>DATRDY</name>
              <description>Data Ready Interrupt Mask</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>URAD</name>
              <description>Unspecified Register Access Detection Interrupt Mask</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ISR</name>
          <description>Interrupt Status Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>DATRDY</name>
              <description>Data Ready (cleared by setting bit START or bit SWRST in TDES_CR or by reading TDES_ODATARx)</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>URAD</name>
              <description>Unspecified Register Access Detection Status (cleared by setting bit TDES_CR.SWRST)</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>URAT</name>
              <description>Unspecified Register Access (cleared by setting bit TDES_CR.SWRST)</description>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDR_WR_PROCESSING</name>
                  <description>Input Data Register written during data processing when SMOD = 0x2 mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ODR_RD_PROCESSING</name>
                  <description>Output Data Register read during data processing.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MR_WR_PROCESSING</name>
                  <description>Mode Register written during data processing.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WOR_RD_ACCESS</name>
                  <description>Write-only register read access.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IVR</name>
          <description>Initialization Vector Register</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>IV</name>
              <description>Initialization Vector</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY1WR</name>
          <description>Key 1 Word Register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>KEY1W</name>
              <description>Key 1 Word</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY2WR</name>
          <description>Key 2 Word Register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>KEY2W</name>
              <description>Key 2 Word</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY3WR</name>
          <description>Key 3 Word Register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>KEY3W</name>
              <description>Key 3 Word</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MR</name>
          <description>Mode Register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CIPHER</name>
              <description>Processing Mode</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DECRYPT</name>
                  <description>Decrypts data.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENCRYPT</name>
                  <description>Encrypts data.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TDESMOD</name>
              <description>ALGORITHM Mode</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SINGLE_DES</name>
                  <description>Single DES processing using Key 1 Registers</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIPLE_DES</name>
                  <description>Triple DES processing using Key 1, Key 2 and Key 3 Registers</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTEA</name>
                  <description>XTEA processing using Key 1 and Key 2 Registers</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>KEYMOD</name>
              <description>Key Mode</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMOD</name>
              <description>Start Mode</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MANUAL_START</name>
                  <description>Manual Mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUTO_START</name>
                  <description>Auto Mode</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDATAR0_START</name>
                  <description>TDES_IDATAR0 accesses only Auto Mode</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPMOD</name>
              <description>Operating Mode</description>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ECB</name>
                  <description>Electronic Code Book mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBC</name>
                  <description>Cipher Block Chaining mode</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFB</name>
                  <description>Output Feedback mode</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CFB</name>
                  <description>Cipher Feedback mode</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOD</name>
              <description>Last Output Data Mode</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFBS</name>
              <description>Cipher Feedback Data Size</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SIZE_64BIT</name>
                  <description>64-bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE_32BIT</name>
                  <description>32-bit</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE_16BIT</name>
                  <description>16-bit</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE_8BIT</name>
                  <description>8-bit</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ODATAR</name>
          <description>Output Data Register</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>ODATA</name>
              <description>Output Data</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>XTEA_RNDR</name>
          <description>XTEA Rounds Register</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>XTEA_RNDS</name>
              <description>Number of Rounds</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
