betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
        <register>
          <name>RHR</name>
          <description>Receive Holding Register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RXDATA</name>
              <description>Master or Slave Receive Holding Data</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RXDATA0</name>
              <description>Master or Slave Receive Holding Data 0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RXDATA1</name>
              <description>Master or Slave Receive Holding Data 1</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RXDATA2</name>
              <description>Master or Slave Receive Holding Data 2</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RXDATA3</name>
              <description>Master or Slave Receive Holding Data 3</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SMBTR</name>
          <description>SMBus Timing Register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PRESC</name>
              <description>SMBus Clock Prescaler</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TLOWS</name>
              <description>Slave Clock Stretch Maximum Cycles</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TLOWM</name>
              <description>Master Clock Stretch Maximum Cycles</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>THMAX</name>
              <description>Clock High Maximum Cycles</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SMR</name>
          <description>Slave Mode Register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>NACKEN</name>
              <description>Slave Receiver Data Phase NACK enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMDA</name>
              <description>SMBus Default Address</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMHH</name>
              <description>SMBus Host Header</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCLWSDIS</name>
              <description>Clock Wait State Disable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK</name>
              <description>Slave Address Mask</description>
              <bitRange>[14:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SADR</name>
              <description>Slave Address</description>
              <bitRange>[22:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SADR1EN</name>
              <description>Slave Address 1 Enable</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SADR2EN</name>
              <description>Slave Address 2 Enable</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SADR3EN</name>
              <description>Slave Address 3 Enable</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DATAMEN</name>
              <description>Data Matching Enable</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>Status Register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>TXCOMP</name>
              <description>Transmission Completed (cleared by writing TWIHS_THR)</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXRDY</name>
              <description>Receive Holding Register Ready (cleared by reading TWIHS_RHR)</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXRDY</name>
              <description>Transmit Holding Register Ready (cleared by writing TWIHS_THR)</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SVREAD</name>
              <description>Slave Read</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SVACC</name>
              <description>Slave Access</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GACC</name>
              <description>General Call Access (cleared on read)</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OVRE</name>
              <description>Overrun Error (cleared on read)</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UNRE</name>
              <description>Underrun Error (cleared on read)</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NACK</name>
              <description>Not Acknowledged (cleared on read)</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ARBLST</name>
              <description>Arbitration Lost (cleared on read)</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCLWS</name>
              <description>Clock Wait State</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EOSACC</name>
              <description>End Of Slave Access (cleared on read)</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MCACK</name>
              <description>Master Code Acknowledge (cleared on read)</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TOUT</name>
              <description>Timeout Error (cleared on read)</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PECERR</name>
              <description>PEC Error (cleared on read)</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMBDAM</name>
              <description>SMBus Default Address Match (cleared on read)</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SMBHHM</name>
              <description>SMBus Host Header Address Match (cleared on read)</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK</name>
              <description>TWIHS Lock due to Frame Errors (cleared by writing a one to bit LOCKCLR in TWIHS_CR)</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFLOCK</name>
              <description>Transmit FIFO Lock</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCL</name>
              <description>SCL Line Value</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SDA</name>
              <description>SDA Line Value</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWMR</name>
          <description>SleepWalking Matching Register</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SADR1</name>
              <description>Slave Address 1</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SADR2</name>
              <description>Slave Address 2</description>
              <bitRange>[14:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SADR3</name>
              <description>Slave Address 3</description>
              <bitRange>[22:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>DATAM</name>
              <description>Data Match</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>THR</name>
          <description>Transmit Holding Register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>TXDATA</name>
              <description>Master or Slave Transmit Holding Data</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TXDATA0</name>
              <description>Master or Slave Transmit Holding Data 02</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TXDATA1</name>
              <description>Master or Slave Transmit Holding Data 1</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TXDATA2</name>
              <description>Master or Slave Transmit Holding Data 2</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>TXDATA3</name>
              <description>Master or Slave Transmit Holding Data 3</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>WPMR</name>
          <description>Write Protection Mode Register</description>
          <addressOffset>0xE4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WPEN</name>
              <description>Write Protection Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WPKEY</name>
              <description>Write Protection Key</description>
              <bitRange>[31:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PASSWD</name>
                  <description>Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0</description>
                  <value>5527369</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WPSR</name>
          <description>Write Protection Status Register</description>
          <addressOffset>0xE8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>WPVS</name>
              <description>Write Protection Violation Status</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WPVSRC</name>
              <description>Write Protection Violation Source</description>
              <bitRange>[31:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>16777215</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
