betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="UART0">
      <name>UART1</name>
      <description>Universal Asynchronous Receiver Transmitter</description>
      <baseAddress>0xF8020000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="UART0">
      <name>UART2</name>
      <description>Universal Asynchronous Receiver Transmitter</description>
      <baseAddress>0xF8024000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="UART0">
      <name>UART3</name>
      <description>Universal Asynchronous Receiver Transmitter</description>
      <baseAddress>0xFC008000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="UART0">
      <name>UART4</name>
      <description>Universal Asynchronous Receiver Transmitter</description>
      <baseAddress>0xFC00C000</baseAddress>
    </peripheral>
    <peripheral>
      <name>UDPHS</name>
      <description>USB High Speed Device Port</description>
      <baseAddress>0xFC02C000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xE0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xEC</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xF8</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ADDRSIZE</name>
          <description>UDPHS IP Address Size Register</description>
          <addressOffset>0xEC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>ADDRSIZE</name>
              <description>Peripheral Bus Address Size</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CLRINT</name>
          <description>UDPHS Clear Interrupt Register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>DET_SUSPD</name>
              <description>Suspend Interrupt Clear</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MICRO_SOF</name>
              <description>Micro Start Of Frame Interrupt Clear</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INT_SOF</name>
              <description>Start Of Frame Interrupt Clear</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENDRESET</name>
              <description>End Of Reset Interrupt Clear</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WAKE_UP</name>
              <description>Wake Up CPU Interrupt Clear</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENDOFRSM</name>
              <description>End Of Resume Interrupt Clear</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UPSTR_RES</name>
              <description>Upstream Resume Interrupt Clear</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL</name>
          <description>UDPHS Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DEV_ADDR</name>
              <description>UDPHS Address (cleared upon USB reset)</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FADDR_EN</name>
              <description>Function Address Enable (cleared upon USB reset)</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_UDPHS</name>
              <description>UDPHS Enable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DETACH</name>
              <description>Detach Command</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REWAKEUP</name>
              <description>Send Remote Wakeup (cleared upon USB reset)</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PULLD_DIS</name>
              <description>Pulldown Disable (cleared upon USB reset)</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EPTRST</name>
          <description>UDPHS Endpoints Reset Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>EPT_0</name>
              <description>Endpoint 0 Reset</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EPT_1</name>
              <description>Endpoint 1 Reset</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EPT_2</name>
              <description>Endpoint 2 Reset</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EPT_3</name>
              <description>Endpoint 3 Reset</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EPT_4</name>
              <description>Endpoint 4 Reset</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EPT_5</name>
              <description>Endpoint 5 Reset</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EPT_6</name>
              <description>Endpoint 6 Reset</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EPT_7</name>
              <description>Endpoint 7 Reset</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EPT_8</name>
              <description>Endpoint 8 Reset</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EPT_9</name>
              <description>Endpoint 9 Reset</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EPT_10</name>
              <description>Endpoint 10 Reset</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EPT_11</name>
              <description>Endpoint 11 Reset</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EPT_12</name>
              <description>Endpoint 12 Reset</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EPT_13</name>
              <description>Endpoint 13 Reset</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EPT_14</name>
              <description>Endpoint 14 Reset</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EPT_15</name>
              <description>Endpoint 15 Reset</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FEATURES</name>
          <description>UDPHS Features Register</description>
          <addressOffset>0xF8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>4294967295</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>FNUM</name>
          <description>UDPHS Frame Number Register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>MICRO_FRAME_NUM</name>
              <description>Microframe Number (cleared upon USB reset)</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FRAME_NUMBER</name>
              <description>Frame Number as defined in the Packet Field Formats (cleared upon USB reset)</description>
              <bitRange>[13:3]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>2047</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FNUM_ERR</name>
              <description>Frame Number CRC Error (cleared upon USB reset)</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IEN</name>
          <description>UDPHS Interrupt Enable Register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DET_SUSPD</name>
              <description>Suspend Interrupt Enable (cleared upon USB reset)</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MICRO_SOF</name>
              <description>Micro-SOF Interrupt Enable (cleared upon USB reset)</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INT_SOF</name>
              <description>SOF Interrupt Enable (cleared upon USB reset)</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENDRESET</name>
              <description>End Of Reset Interrupt Enable (cleared upon USB reset)</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WAKE_UP</name>
              <description>Wake Up CPU Interrupt Enable (cleared upon USB reset)</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENDOFRSM</name>
              <description>End Of Resume Interrupt Enable (cleared upon USB reset)</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UPSTR_RES</name>
              <description>Upstream Resume Interrupt Enable (cleared upon USB reset)</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EPT_0</name>
              <description>Endpoint 0 Interrupt Enable (cleared upon USB reset)</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EPT_1</name>
              <description>Endpoint 1 Interrupt Enable (cleared upon USB reset)</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EPT_2</name>
              <description>Endpoint 2 Interrupt Enable (cleared upon USB reset)</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EPT_3</name>
              <description>Endpoint 3 Interrupt Enable (cleared upon USB reset)</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EPT_4</name>
              <description>Endpoint 4 Interrupt Enable (cleared upon USB reset)</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EPT_5</name>
              <description>Endpoint 5 Interrupt Enable (cleared upon USB reset)</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EPT_6</name>
              <description>Endpoint 6 Interrupt Enable (cleared upon USB reset)</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EPT_7</name>
              <description>Endpoint 7 Interrupt Enable (cleared upon USB reset)</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EPT_8</name>
              <description>Endpoint 8 Interrupt Enable (cleared upon USB reset)</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EPT_9</name>
              <description>Endpoint 9 Interrupt Enable (cleared upon USB reset)</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EPT_10</name>
              <description>Endpoint 10 Interrupt Enable (cleared upon USB reset)</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EPT_11</name>
              <description>Endpoint 11 Interrupt Enable (cleared upon USB reset)</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EPT_12</name>
              <description>Endpoint 12 Interrupt Enable (cleared upon USB reset)</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EPT_13</name>
              <description>Endpoint 13 Interrupt Enable (cleared upon USB reset)</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EPT_14</name>
              <description>Endpoint 14 Interrupt Enable (cleared upon USB reset)</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EPT_15</name>
              <description>Endpoint 15 Interrupt Enable (cleared upon USB reset)</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_1</name>
              <description>DMA Channel 1 Interrupt Enable (cleared upon USB reset)</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_2</name>
              <description>DMA Channel 2 Interrupt Enable (cleared upon USB reset)</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_3</name>
              <description>DMA Channel 3 Interrupt Enable (cleared upon USB reset)</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_4</name>
              <description>DMA Channel 4 Interrupt Enable (cleared upon USB reset)</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_5</name>
              <description>DMA Channel 5 Interrupt Enable (cleared upon USB reset)</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_6</name>
              <description>DMA Channel 6 Interrupt Enable (cleared upon USB reset)</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_7</name>
              <description>DMA Channel 7 Interrupt Enable (cleared upon USB reset)</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
