betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
        <register>
          <name>INTSTA</name>
          <description>UDPHS Interrupt Status Register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>SPEED</name>
              <description>Speed Status</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DET_SUSPD</name>
              <description>Suspend Interrupt</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MICRO_SOF</name>
              <description>Micro Start Of Frame Interrupt</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INT_SOF</name>
              <description>Start Of Frame Interrupt</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENDRESET</name>
              <description>End Of Reset Interrupt</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WAKE_UP</name>
              <description>Wake Up CPU Interrupt</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENDOFRSM</name>
              <description>End Of Resume Interrupt</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UPSTR_RES</name>
              <description>Upstream Resume Interrupt</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EPT_0</name>
              <description>Endpoint 0 Interrupt (cleared upon USB reset)</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EPT_1</name>
              <description>Endpoint 1 Interrupt (cleared upon USB reset)</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EPT_2</name>
              <description>Endpoint 2 Interrupt (cleared upon USB reset)</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EPT_3</name>
              <description>Endpoint 3 Interrupt (cleared upon USB reset)</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EPT_4</name>
              <description>Endpoint 4 Interrupt (cleared upon USB reset)</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EPT_5</name>
              <description>Endpoint 5 Interrupt (cleared upon USB reset)</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EPT_6</name>
              <description>Endpoint 6 Interrupt (cleared upon USB reset)</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EPT_7</name>
              <description>Endpoint 7 Interrupt (cleared upon USB reset)</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EPT_8</name>
              <description>Endpoint 8 Interrupt (cleared upon USB reset)</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EPT_9</name>
              <description>Endpoint 9 Interrupt (cleared upon USB reset)</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EPT_10</name>
              <description>Endpoint 10 Interrupt (cleared upon USB reset)</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EPT_11</name>
              <description>Endpoint 11 Interrupt (cleared upon USB reset)</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EPT_12</name>
              <description>Endpoint 12 Interrupt (cleared upon USB reset)</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EPT_13</name>
              <description>Endpoint 13 Interrupt (cleared upon USB reset)</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EPT_14</name>
              <description>Endpoint 14 Interrupt (cleared upon USB reset)</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EPT_15</name>
              <description>Endpoint 15 Interrupt (cleared upon USB reset)</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_1</name>
              <description>DMA Channel 1 Interrupt</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_2</name>
              <description>DMA Channel 2 Interrupt</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_3</name>
              <description>DMA Channel 3 Interrupt</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_4</name>
              <description>DMA Channel 4 Interrupt</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_5</name>
              <description>DMA Channel 5 Interrupt</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_6</name>
              <description>DMA Channel 6 Interrupt</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_7</name>
              <description>DMA Channel 7 Interrupt</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IPNAME</name>
          <description>UDPHS IP Name1 Register</description>
          <addressOffset>0xF0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>IPNAME</name>
              <description>IP Name in ASCII Format</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TST</name>
          <description>UDPHS Test Register</description>
          <addressOffset>0xE0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SPEED_CFG</name>
              <description>Speed Configuration</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Normal mode: The macro is in Full Speed mode, ready to make a High Speed identification, if the host supports it and then to automatically switch to High Speed mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH_SPEED</name>
                  <description>Force High Speed: Set this value to force the hardware to work in High Speed mode. Only for debug or test purpose.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FULL_SPEED</name>
                  <description>Force Full Speed: Set this value to force the hardware to work only in Full Speed mode. In this configuration, the macro will not respond to a High Speed reset handshake.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TST_J</name>
              <description>Test J Mode</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TST_K</name>
              <description>Test K Mode</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TST_PKT</name>
              <description>Test Packet Mode</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OPMODE2</name>
              <description>OpMode2</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
