betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>WDT</name>
      <description>Watchdog Timer</description>
      <baseAddress>0xF8048040</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR</name>
          <description>Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>WDRSTT</name>
              <description>Watchdog Restart</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCKMR</name>
              <description>Lock Mode Register Write Access</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>KEY</name>
              <description>Password</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PASSWD</name>
                  <description>Writing any other value in this field aborts the write operation.</description>
                  <value>165</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MR</name>
          <description>Mode Register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WDV</name>
              <description>Watchdog Counter Value</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>WDFIEN</name>
              <description>Watchdog Fault Interrupt Enable</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WDRSTEN</name>
              <description>Watchdog Reset Enable</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WDDIS</name>
              <description>Watchdog Disable</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WDD</name>
              <description>Watchdog Delta Value</description>
              <bitRange>[27:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>WDDBGHLT</name>
              <description>Watchdog Debug Halt</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WDIDLEHLT</name>
              <description>Watchdog Idle Halt</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>Status Register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>WDUNF</name>
              <description>Watchdog Underflow (cleared on read)</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WDERR</name>
              <description>Watchdog Error (cleared on read)</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>XDMAC0</name>
      <description>Extensible DMA Controller</description>
      <baseAddress>0xF0010000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x44</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>XDMAC_GCFG</name>
          <description>Global Configuration Register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CGDISREG</name>
              <description>Configuration Registers Clock Gating Disable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CGDISPIPE</name>
              <description>Pipeline Clock Gating Disable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CGDISFIFO</name>
              <description>FIFO Clock Gating Disable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CGDISIF</name>
              <description>Bus Interface Clock Gating Disable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BXKBEN</name>
              <description>Boundary X Kilobyte Enable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XDMAC_GD</name>
          <description>Global Channel Disable Register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>DI0</name>
              <description>XDMAC Channel 0 Disable Bit</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DI1</name>
              <description>XDMAC Channel 1 Disable Bit</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DI2</name>
              <description>XDMAC Channel 2 Disable Bit</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DI3</name>
              <description>XDMAC Channel 3 Disable Bit</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DI4</name>
              <description>XDMAC Channel 4 Disable Bit</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DI5</name>
              <description>XDMAC Channel 5 Disable Bit</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DI6</name>
              <description>XDMAC Channel 6 Disable Bit</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DI7</name>
              <description>XDMAC Channel 7 Disable Bit</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DI8</name>
              <description>XDMAC Channel 8 Disable Bit</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DI9</name>
              <description>XDMAC Channel 9 Disable Bit</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DI10</name>
              <description>XDMAC Channel 10 Disable Bit</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DI11</name>
              <description>XDMAC Channel 11 Disable Bit</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DI12</name>
              <description>XDMAC Channel 12 Disable Bit</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DI13</name>
              <description>XDMAC Channel 13 Disable Bit</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DI14</name>
              <description>XDMAC Channel 14 Disable Bit</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DI15</name>
              <description>XDMAC Channel 15 Disable Bit</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XDMAC_GE</name>
          <description>Global Channel Enable Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>EN0</name>
              <description>XDMAC Channel 0 Enable Bit</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN1</name>
              <description>XDMAC Channel 1 Enable Bit</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN2</name>
              <description>XDMAC Channel 2 Enable Bit</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN3</name>
              <description>XDMAC Channel 3 Enable Bit</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN4</name>
              <description>XDMAC Channel 4 Enable Bit</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN5</name>
              <description>XDMAC Channel 5 Enable Bit</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN6</name>
              <description>XDMAC Channel 6 Enable Bit</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN7</name>
              <description>XDMAC Channel 7 Enable Bit</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN8</name>
              <description>XDMAC Channel 8 Enable Bit</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN9</name>
              <description>XDMAC Channel 9 Enable Bit</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN10</name>
              <description>XDMAC Channel 10 Enable Bit</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN11</name>
              <description>XDMAC Channel 11 Enable Bit</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN12</name>
              <description>XDMAC Channel 12 Enable Bit</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN13</name>
              <description>XDMAC Channel 13 Enable Bit</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN14</name>
              <description>XDMAC Channel 14 Enable Bit</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN15</name>
              <description>XDMAC Channel 15 Enable Bit</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XDMAC_GID</name>
          <description>Global Interrupt Disable Register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>ID0</name>
              <description>XDMAC Channel 0 Interrupt Disable Bit</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ID1</name>
              <description>XDMAC Channel 1 Interrupt Disable Bit</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ID2</name>
              <description>XDMAC Channel 2 Interrupt Disable Bit</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ID3</name>
              <description>XDMAC Channel 3 Interrupt Disable Bit</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ID4</name>
              <description>XDMAC Channel 4 Interrupt Disable Bit</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ID5</name>
              <description>XDMAC Channel 5 Interrupt Disable Bit</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ID6</name>
              <description>XDMAC Channel 6 Interrupt Disable Bit</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ID7</name>
              <description>XDMAC Channel 7 Interrupt Disable Bit</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ID8</name>
              <description>XDMAC Channel 8 Interrupt Disable Bit</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ID9</name>
              <description>XDMAC Channel 9 Interrupt Disable Bit</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ID10</name>
              <description>XDMAC Channel 10 Interrupt Disable Bit</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ID11</name>
              <description>XDMAC Channel 11 Interrupt Disable Bit</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ID12</name>
              <description>XDMAC Channel 12 Interrupt Disable Bit</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ID13</name>
              <description>XDMAC Channel 13 Interrupt Disable Bit</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ID14</name>
              <description>XDMAC Channel 14 Interrupt Disable Bit</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ID15</name>
              <description>XDMAC Channel 15 Interrupt Disable Bit</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XDMAC_GIE</name>
          <description>Global Interrupt Enable Register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>IE0</name>
              <description>XDMAC Channel 0 Interrupt Enable Bit</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IE1</name>
              <description>XDMAC Channel 1 Interrupt Enable Bit</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IE2</name>
              <description>XDMAC Channel 2 Interrupt Enable Bit</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IE3</name>
              <description>XDMAC Channel 3 Interrupt Enable Bit</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IE4</name>
              <description>XDMAC Channel 4 Interrupt Enable Bit</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IE5</name>
              <description>XDMAC Channel 5 Interrupt Enable Bit</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IE6</name>
              <description>XDMAC Channel 6 Interrupt Enable Bit</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IE7</name>
              <description>XDMAC Channel 7 Interrupt Enable Bit</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IE8</name>
              <description>XDMAC Channel 8 Interrupt Enable Bit</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IE9</name>
              <description>XDMAC Channel 9 Interrupt Enable Bit</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IE10</name>
              <description>XDMAC Channel 10 Interrupt Enable Bit</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IE11</name>
              <description>XDMAC Channel 11 Interrupt Enable Bit</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IE12</name>
              <description>XDMAC Channel 12 Interrupt Enable Bit</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IE13</name>
              <description>XDMAC Channel 13 Interrupt Enable Bit</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IE14</name>
              <description>XDMAC Channel 14 Interrupt Enable Bit</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IE15</name>
              <description>XDMAC Channel 15 Interrupt Enable Bit</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
