betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
        <register>
          <name>XDMAC_GIM</name>
          <description>Global Interrupt Mask Register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>IM0</name>
              <description>XDMAC Channel 0 Interrupt Mask Bit</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IM1</name>
              <description>XDMAC Channel 1 Interrupt Mask Bit</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IM2</name>
              <description>XDMAC Channel 2 Interrupt Mask Bit</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IM3</name>
              <description>XDMAC Channel 3 Interrupt Mask Bit</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IM4</name>
              <description>XDMAC Channel 4 Interrupt Mask Bit</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IM5</name>
              <description>XDMAC Channel 5 Interrupt Mask Bit</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IM6</name>
              <description>XDMAC Channel 6 Interrupt Mask Bit</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IM7</name>
              <description>XDMAC Channel 7 Interrupt Mask Bit</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IM8</name>
              <description>XDMAC Channel 8 Interrupt Mask Bit</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IM9</name>
              <description>XDMAC Channel 9 Interrupt Mask Bit</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IM10</name>
              <description>XDMAC Channel 10 Interrupt Mask Bit</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IM11</name>
              <description>XDMAC Channel 11 Interrupt Mask Bit</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IM12</name>
              <description>XDMAC Channel 12 Interrupt Mask Bit</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IM13</name>
              <description>XDMAC Channel 13 Interrupt Mask Bit</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IM14</name>
              <description>XDMAC Channel 14 Interrupt Mask Bit</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IM15</name>
              <description>XDMAC Channel 15 Interrupt Mask Bit</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XDMAC_GIS</name>
          <description>Global Interrupt Status Register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>IS0</name>
              <description>XDMAC Channel 0 Interrupt Status Bit</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IS1</name>
              <description>XDMAC Channel 1 Interrupt Status Bit</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IS2</name>
              <description>XDMAC Channel 2 Interrupt Status Bit</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IS3</name>
              <description>XDMAC Channel 3 Interrupt Status Bit</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IS4</name>
              <description>XDMAC Channel 4 Interrupt Status Bit</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IS5</name>
              <description>XDMAC Channel 5 Interrupt Status Bit</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IS6</name>
              <description>XDMAC Channel 6 Interrupt Status Bit</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IS7</name>
              <description>XDMAC Channel 7 Interrupt Status Bit</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IS8</name>
              <description>XDMAC Channel 8 Interrupt Status Bit</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IS9</name>
              <description>XDMAC Channel 9 Interrupt Status Bit</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IS10</name>
              <description>XDMAC Channel 10 Interrupt Status Bit</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IS11</name>
              <description>XDMAC Channel 11 Interrupt Status Bit</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IS12</name>
              <description>XDMAC Channel 12 Interrupt Status Bit</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IS13</name>
              <description>XDMAC Channel 13 Interrupt Status Bit</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IS14</name>
              <description>XDMAC Channel 14 Interrupt Status Bit</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IS15</name>
              <description>XDMAC Channel 15 Interrupt Status Bit</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XDMAC_GRS</name>
          <description>Global Channel Read Suspend Register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RS0</name>
              <description>XDMAC Channel 0 Read Suspend Bit</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RS1</name>
              <description>XDMAC Channel 1 Read Suspend Bit</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RS2</name>
              <description>XDMAC Channel 2 Read Suspend Bit</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RS3</name>
              <description>XDMAC Channel 3 Read Suspend Bit</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RS4</name>
              <description>XDMAC Channel 4 Read Suspend Bit</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RS5</name>
              <description>XDMAC Channel 5 Read Suspend Bit</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RS6</name>
              <description>XDMAC Channel 6 Read Suspend Bit</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RS7</name>
              <description>XDMAC Channel 7 Read Suspend Bit</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RS8</name>
              <description>XDMAC Channel 8 Read Suspend Bit</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RS9</name>
              <description>XDMAC Channel 9 Read Suspend Bit</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RS10</name>
              <description>XDMAC Channel 10 Read Suspend Bit</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RS11</name>
              <description>XDMAC Channel 11 Read Suspend Bit</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RS12</name>
              <description>XDMAC Channel 12 Read Suspend Bit</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RS13</name>
              <description>XDMAC Channel 13 Read Suspend Bit</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RS14</name>
              <description>XDMAC Channel 14 Read Suspend Bit</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RS15</name>
              <description>XDMAC Channel 15 Read Suspend Bit</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XDMAC_GRWR</name>
          <description>Global Channel Read Write Resume Register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>RWR0</name>
              <description>XDMAC Channel 0 Read Write Resume Bit</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RWR1</name>
              <description>XDMAC Channel 1 Read Write Resume Bit</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RWR2</name>
              <description>XDMAC Channel 2 Read Write Resume Bit</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RWR3</name>
              <description>XDMAC Channel 3 Read Write Resume Bit</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RWR4</name>
              <description>XDMAC Channel 4 Read Write Resume Bit</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RWR5</name>
              <description>XDMAC Channel 5 Read Write Resume Bit</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RWR6</name>
              <description>XDMAC Channel 6 Read Write Resume Bit</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RWR7</name>
              <description>XDMAC Channel 7 Read Write Resume Bit</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RWR8</name>
              <description>XDMAC Channel 8 Read Write Resume Bit</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RWR9</name>
              <description>XDMAC Channel 9 Read Write Resume Bit</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RWR10</name>
              <description>XDMAC Channel 10 Read Write Resume Bit</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RWR11</name>
              <description>XDMAC Channel 11 Read Write Resume Bit</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RWR12</name>
              <description>XDMAC Channel 12 Read Write Resume Bit</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RWR13</name>
              <description>XDMAC Channel 13 Read Write Resume Bit</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RWR14</name>
              <description>XDMAC Channel 14 Read Write Resume Bit</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RWR15</name>
              <description>XDMAC Channel 15 Read Write Resume Bit</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XDMAC_GRWS</name>
          <description>Global Channel Read Write Suspend Register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>RWS0</name>
              <description>XDMAC Channel 0 Read Write Suspend Bit</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RWS1</name>
              <description>XDMAC Channel 1 Read Write Suspend Bit</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RWS2</name>
              <description>XDMAC Channel 2 Read Write Suspend Bit</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RWS3</name>
              <description>XDMAC Channel 3 Read Write Suspend Bit</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RWS4</name>
              <description>XDMAC Channel 4 Read Write Suspend Bit</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RWS5</name>
              <description>XDMAC Channel 5 Read Write Suspend Bit</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RWS6</name>
              <description>XDMAC Channel 6 Read Write Suspend Bit</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RWS7</name>
              <description>XDMAC Channel 7 Read Write Suspend Bit</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RWS8</name>
              <description>XDMAC Channel 8 Read Write Suspend Bit</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RWS9</name>
              <description>XDMAC Channel 9 Read Write Suspend Bit</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RWS10</name>
              <description>XDMAC Channel 10 Read Write Suspend Bit</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RWS11</name>
              <description>XDMAC Channel 11 Read Write Suspend Bit</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RWS12</name>
              <description>XDMAC Channel 12 Read Write Suspend Bit</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RWS13</name>
              <description>XDMAC Channel 13 Read Write Suspend Bit</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RWS14</name>
              <description>XDMAC Channel 14 Read Write Suspend Bit</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RWS15</name>
              <description>XDMAC Channel 15 Read Write Suspend Bit</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
