betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
        <register>
          <name>XDMAC_GS</name>
          <description>Global Channel Status Register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>ST0</name>
              <description>XDMAC Channel 0 Status Bit</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ST1</name>
              <description>XDMAC Channel 1 Status Bit</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ST2</name>
              <description>XDMAC Channel 2 Status Bit</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ST3</name>
              <description>XDMAC Channel 3 Status Bit</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ST4</name>
              <description>XDMAC Channel 4 Status Bit</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ST5</name>
              <description>XDMAC Channel 5 Status Bit</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ST6</name>
              <description>XDMAC Channel 6 Status Bit</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ST7</name>
              <description>XDMAC Channel 7 Status Bit</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ST8</name>
              <description>XDMAC Channel 8 Status Bit</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ST9</name>
              <description>XDMAC Channel 9 Status Bit</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ST10</name>
              <description>XDMAC Channel 10 Status Bit</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ST11</name>
              <description>XDMAC Channel 11 Status Bit</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ST12</name>
              <description>XDMAC Channel 12 Status Bit</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ST13</name>
              <description>XDMAC Channel 13 Status Bit</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ST14</name>
              <description>XDMAC Channel 14 Status Bit</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ST15</name>
              <description>XDMAC Channel 15 Status Bit</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XDMAC_GSWF</name>
          <description>Global Channel Software Flush Request Register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>SWF0</name>
              <description>XDMAC Channel 0 Software Flush Request Bit</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWF1</name>
              <description>XDMAC Channel 1 Software Flush Request Bit</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWF2</name>
              <description>XDMAC Channel 2 Software Flush Request Bit</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWF3</name>
              <description>XDMAC Channel 3 Software Flush Request Bit</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWF4</name>
              <description>XDMAC Channel 4 Software Flush Request Bit</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWF5</name>
              <description>XDMAC Channel 5 Software Flush Request Bit</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWF6</name>
              <description>XDMAC Channel 6 Software Flush Request Bit</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWF7</name>
              <description>XDMAC Channel 7 Software Flush Request Bit</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWF8</name>
              <description>XDMAC Channel 8 Software Flush Request Bit</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWF9</name>
              <description>XDMAC Channel 9 Software Flush Request Bit</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWF10</name>
              <description>XDMAC Channel 10 Software Flush Request Bit</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWF11</name>
              <description>XDMAC Channel 11 Software Flush Request Bit</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWF12</name>
              <description>XDMAC Channel 12 Software Flush Request Bit</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWF13</name>
              <description>XDMAC Channel 13 Software Flush Request Bit</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWF14</name>
              <description>XDMAC Channel 14 Software Flush Request Bit</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWF15</name>
              <description>XDMAC Channel 15 Software Flush Request Bit</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XDMAC_GSWR</name>
          <description>Global Channel Software Request Register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>SWREQ0</name>
              <description>XDMAC Channel 0 Software Request Bit</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWREQ1</name>
              <description>XDMAC Channel 1 Software Request Bit</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWREQ2</name>
              <description>XDMAC Channel 2 Software Request Bit</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWREQ3</name>
              <description>XDMAC Channel 3 Software Request Bit</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWREQ4</name>
              <description>XDMAC Channel 4 Software Request Bit</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWREQ5</name>
              <description>XDMAC Channel 5 Software Request Bit</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWREQ6</name>
              <description>XDMAC Channel 6 Software Request Bit</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWREQ7</name>
              <description>XDMAC Channel 7 Software Request Bit</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWREQ8</name>
              <description>XDMAC Channel 8 Software Request Bit</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWREQ9</name>
              <description>XDMAC Channel 9 Software Request Bit</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWREQ10</name>
              <description>XDMAC Channel 10 Software Request Bit</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWREQ11</name>
              <description>XDMAC Channel 11 Software Request Bit</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWREQ12</name>
              <description>XDMAC Channel 12 Software Request Bit</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWREQ13</name>
              <description>XDMAC Channel 13 Software Request Bit</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWREQ14</name>
              <description>XDMAC Channel 14 Software Request Bit</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWREQ15</name>
              <description>XDMAC Channel 15 Software Request Bit</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XDMAC_GSWS</name>
          <description>Global Channel Software Request Status Register</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>SWRS0</name>
              <description>XDMAC Channel 0 Software Request Status Bit</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWRS1</name>
              <description>XDMAC Channel 1 Software Request Status Bit</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWRS2</name>
              <description>XDMAC Channel 2 Software Request Status Bit</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWRS3</name>
              <description>XDMAC Channel 3 Software Request Status Bit</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWRS4</name>
              <description>XDMAC Channel 4 Software Request Status Bit</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWRS5</name>
              <description>XDMAC Channel 5 Software Request Status Bit</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWRS6</name>
              <description>XDMAC Channel 6 Software Request Status Bit</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWRS7</name>
              <description>XDMAC Channel 7 Software Request Status Bit</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWRS8</name>
              <description>XDMAC Channel 8 Software Request Status Bit</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWRS9</name>
              <description>XDMAC Channel 9 Software Request Status Bit</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWRS10</name>
              <description>XDMAC Channel 10 Software Request Status Bit</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWRS11</name>
              <description>XDMAC Channel 11 Software Request Status Bit</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWRS12</name>
              <description>XDMAC Channel 12 Software Request Status Bit</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWRS13</name>
              <description>XDMAC Channel 13 Software Request Status Bit</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWRS14</name>
              <description>XDMAC Channel 14 Software Request Status Bit</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWRS15</name>
              <description>XDMAC Channel 15 Software Request Status Bit</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XDMAC_GTYPE</name>
          <description>Global Type Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>NB_CH</name>
              <description>Number of Channels Minus One</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FIFO_SZ</name>
              <description>Number of Bytes</description>
              <bitRange>[15:5]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>2047</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>NB_REQ</name>
              <description>Number of Peripheral Requests Minus One</description>
              <bitRange>[22:16]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>XDMAC_GWAC</name>
          <description>Global Weighted Arbiter Configuration Register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PW0</name>
              <description>Pool Weight 0</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PW1</name>
              <description>Pool Weight 1</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PW2</name>
              <description>Pool Weight 2</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PW3</name>
              <description>Pool Weight 3</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>XDMAC_GWS</name>
          <description>Global Channel Write Suspend Register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WS0</name>
              <description>XDMAC Channel 0 Write Suspend Bit</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WS1</name>
              <description>XDMAC Channel 1 Write Suspend Bit</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WS2</name>
              <description>XDMAC Channel 2 Write Suspend Bit</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WS3</name>
              <description>XDMAC Channel 3 Write Suspend Bit</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WS4</name>
              <description>XDMAC Channel 4 Write Suspend Bit</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WS5</name>
              <description>XDMAC Channel 5 Write Suspend Bit</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WS6</name>
              <description>XDMAC Channel 6 Write Suspend Bit</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WS7</name>
              <description>XDMAC Channel 7 Write Suspend Bit</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WS8</name>
              <description>XDMAC Channel 8 Write Suspend Bit</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WS9</name>
              <description>XDMAC Channel 9 Write Suspend Bit</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WS10</name>
              <description>XDMAC Channel 10 Write Suspend Bit</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WS11</name>
              <description>XDMAC Channel 11 Write Suspend Bit</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WS12</name>
              <description>XDMAC Channel 12 Write Suspend Bit</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WS13</name>
              <description>XDMAC Channel 13 Write Suspend Bit</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WS14</name>
              <description>XDMAC Channel 14 Write Suspend Bit</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WS15</name>
              <description>XDMAC Channel 15 Write Suspend Bit</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
