betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
        <register>
          <name>PIO_ISR2</name>
          <description>PIO Interrupt Status Register</description>
          <addressOffset>0x0AC</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>P0</name>
              <description>Input Change interrupt status on the I/O line 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P1</name>
              <description>Input Change interrupt status on the I/O line 1.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P2</name>
              <description>Input Change interrupt status on the I/O line 2.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P3</name>
              <description>Input Change interrupt status on the I/O line 3.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P4</name>
              <description>Input Change interrupt status on the I/O line 4.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P5</name>
              <description>Input Change interrupt status on the I/O line 5.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P6</name>
              <description>Input Change interrupt status on the I/O line 6.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P7</name>
              <description>Input Change interrupt status on the I/O line 7.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P8</name>
              <description>Input Change interrupt status on the I/O line 8.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P9</name>
              <description>Input Change interrupt status on the I/O line 9.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P10</name>
              <description>Input Change interrupt status on the I/O line 10.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P11</name>
              <description>Input Change interrupt status on the I/O line 11.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P12</name>
              <description>Input Change interrupt status on the I/O line 12.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P13</name>
              <description>Input Change interrupt status on the I/O line 13.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P14</name>
              <description>Input Change interrupt status on the I/O line 14.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P15</name>
              <description>Input Change interrupt status on the I/O line 15.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P16</name>
              <description>Input Change interrupt status on the I/O line 16.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P17</name>
              <description>Input Change interrupt status on the I/O line 17.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P18</name>
              <description>Input Change interrupt status on the I/O line 18.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P19</name>
              <description>Input Change interrupt status on the I/O line 19.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P20</name>
              <description>Input Change interrupt status on the I/O line 20.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P21</name>
              <description>Input Change interrupt status on the I/O line 21.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P22</name>
              <description>Input Change interrupt status on the I/O line 22.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P23</name>
              <description>Input Change interrupt status on the I/O line 23.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P24</name>
              <description>Input Change interrupt status on the I/O line 24.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P25</name>
              <description>Input Change interrupt status on the I/O line 25.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P26</name>
              <description>Input Change interrupt status on the I/O line 26.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P27</name>
              <description>Input Change interrupt status on the I/O line 27.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P28</name>
              <description>Input Change interrupt status on the I/O line 28.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P29</name>
              <description>Input Change interrupt status on the I/O line 29.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P30</name>
              <description>Input Change interrupt status on the I/O line 30.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P31</name>
              <description>Input Change interrupt status on the I/O line 31.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PIO_ISR3</name>
          <description>PIO Interrupt Status Register</description>
          <addressOffset>0x0EC</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>P0</name>
              <description>Input Change interrupt status on the I/O line 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P1</name>
              <description>Input Change interrupt status on the I/O line 1.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P2</name>
              <description>Input Change interrupt status on the I/O line 2.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P3</name>
              <description>Input Change interrupt status on the I/O line 3.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P4</name>
              <description>Input Change interrupt status on the I/O line 4.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P5</name>
              <description>Input Change interrupt status on the I/O line 5.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P6</name>
              <description>Input Change interrupt status on the I/O line 6.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P7</name>
              <description>Input Change interrupt status on the I/O line 7.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P8</name>
              <description>Input Change interrupt status on the I/O line 8.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P9</name>
              <description>Input Change interrupt status on the I/O line 9.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P10</name>
              <description>Input Change interrupt status on the I/O line 10.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P11</name>
              <description>Input Change interrupt status on the I/O line 11.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P12</name>
              <description>Input Change interrupt status on the I/O line 12.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P13</name>
              <description>Input Change interrupt status on the I/O line 13.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P14</name>
              <description>Input Change interrupt status on the I/O line 14.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P15</name>
              <description>Input Change interrupt status on the I/O line 15.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P16</name>
              <description>Input Change interrupt status on the I/O line 16.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P17</name>
              <description>Input Change interrupt status on the I/O line 17.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P18</name>
              <description>Input Change interrupt status on the I/O line 18.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P19</name>
              <description>Input Change interrupt status on the I/O line 19.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P20</name>
              <description>Input Change interrupt status on the I/O line 20.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P21</name>
              <description>Input Change interrupt status on the I/O line 21.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P22</name>
              <description>Input Change interrupt status on the I/O line 22.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P23</name>
              <description>Input Change interrupt status on the I/O line 23.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P24</name>
              <description>Input Change interrupt status on the I/O line 24.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P25</name>
              <description>Input Change interrupt status on the I/O line 25.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P26</name>
              <description>Input Change interrupt status on the I/O line 26.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P27</name>
              <description>Input Change interrupt status on the I/O line 27.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P28</name>
              <description>Input Change interrupt status on the I/O line 28.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P29</name>
              <description>Input Change interrupt status on the I/O line 29.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P30</name>
              <description>Input Change interrupt status on the I/O line 30.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P31</name>
              <description>Input Change interrupt status on the I/O line 31.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PIO_IOFR0</name>
          <description>PIO Freeze Configuration Register.</description>
          <addressOffset>0x03C</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>FRZKEY</name>
              <description>Freeze Key.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <enumeratedValues>
                <name>FRZKEY</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>PASSWD</name>
                  <description>Freeze key.</description>
                  <value>0x494F46</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FINT</name>
              <description>Freeze Interrupt Configuration.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>FINT</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No effect.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FREEZE</name>
                  <description>Freezes the following configuration of Non-Secure I/O lines if FRZKEY corresponds to 0x494F46, ("IOF" in ASCII): IFEN, IFSCEN and EVTSEL.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FPHY</name>
              <description>Freeze Physical Configuration.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>FPHY</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No effect.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FREEZE</name>
                  <description>Freezes the following configuration of Non-Secure I/O lines if FRZKEY corresponds to 0x494F46, ("IOF" in ASCII): FUNC, DIR, PUEN, PDEN, OPD, SCHMITT and DRVSTR.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PIO_IOFR1</name>
          <description>PIO Freeze Configuration Register.</description>
          <addressOffset>0x07C</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>FRZKEY</name>
              <description>Freeze Key.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <enumeratedValues>
                <name>FRZKEY</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>PASSWD</name>
                  <description>Freeze key.</description>
                  <value>0x494F46</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FINT</name>
              <description>Freeze Interrupt Configuration.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>FINT</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No effect.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FREEZE</name>
                  <description>Freezes the following configuration of Non-Secure I/O lines if FRZKEY corresponds to 0x494F46, ("IOF" in ASCII): IFEN, IFSCEN and EVTSEL.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FPHY</name>
              <description>Freeze Physical Configuration.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>FPHY</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No effect.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FREEZE</name>
                  <description>Freezes the following configuration of Non-Secure I/O lines if FRZKEY corresponds to 0x494F46, ("IOF" in ASCII): FUNC, DIR, PUEN, PDEN, OPD, SCHMITT and DRVSTR.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PIO_IOFR2</name>
          <description>PIO Freeze Configuration Register.</description>
          <addressOffset>0x0BC</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>FRZKEY</name>
              <description>Freeze Key.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <enumeratedValues>
                <name>FRZKEY</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>PASSWD</name>
                  <description>Freeze key.</description>
                  <value>0x494F46</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FINT</name>
              <description>Freeze Interrupt Configuration.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>FINT</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No effect.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FREEZE</name>
                  <description>Freezes the following configuration of Non-Secure I/O lines if FRZKEY corresponds to 0x494F46, ("IOF" in ASCII): IFEN, IFSCEN and EVTSEL.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FPHY</name>
              <description>Freeze Physical Configuration.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>FPHY</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No effect.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FREEZE</name>
                  <description>Freezes the following configuration of Non-Secure I/O lines if FRZKEY corresponds to 0x494F46, ("IOF" in ASCII): FUNC, DIR, PUEN, PDEN, OPD, SCHMITT and DRVSTR.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
