betrusted-io/xous-core/utralib/atsama5d/ATSAMA5D27.svd
        <register>
          <name>PIO_SIOSR1</name>
          <description>PIO Set I/O Secure Register</description>
          <addressOffset>0x074</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>P0</name>
              <description>Set the I/O line 0 in Secure mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P1</name>
              <description>Set the I/O line 1 in Secure mode.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P2</name>
              <description>Set the I/O line 2 in Secure mode.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P3</name>
              <description>Set the I/O line 3 in Secure mode.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P4</name>
              <description>Set the I/O line 4 in Secure mode.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P5</name>
              <description>Set the I/O line 5 in Secure mode.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P6</name>
              <description>Set the I/O line 6 in Secure mode.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P7</name>
              <description>Set the I/O line 7 in Secure mode.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P8</name>
              <description>Set the I/O line 8 in Secure mode.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P9</name>
              <description>Set the I/O line 9 in Secure mode.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P10</name>
              <description>Set the I/O line 10 in Secure mode.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P11</name>
              <description>Set the I/O line 11 in Secure mode.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P12</name>
              <description>Set the I/O line 12 in Secure mode.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P13</name>
              <description>Set the I/O line 13 in Secure mode.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P14</name>
              <description>Set the I/O line 14 in Secure mode.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P15</name>
              <description>Set the I/O line 15 in Secure mode.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P16</name>
              <description>Set the I/O line 16 in Secure mode.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P17</name>
              <description>Set the I/O line 17 in Secure mode.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P18</name>
              <description>Set the I/O line 18 in Secure mode.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P19</name>
              <description>Set the I/O line 19 in Secure mode.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P20</name>
              <description>Set the I/O line 20 in Secure mode.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P21</name>
              <description>Set the I/O line 21 in Secure mode.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P22</name>
              <description>Set the I/O line 22 in Secure mode.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P23</name>
              <description>Set the I/O line 23 in Secure mode.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P24</name>
              <description>Set the I/O line 24 in Secure mode.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P25</name>
              <description>Set the I/O line 25 in Secure mode.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P26</name>
              <description>Set the I/O line 26 in Secure mode.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P27</name>
              <description>Set the I/O line 27 in Secure mode.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P28</name>
              <description>Set the I/O line 28 in Secure mode.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P29</name>
              <description>Set the I/O line 29 in Secure mode.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P30</name>
              <description>Set the I/O line 30 in Secure mode.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P31</name>
              <description>Set the I/O line 31 in Secure mode.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PIO_SIOSR2</name>
          <description>PIO Set I/O Secure Register</description>
          <addressOffset>0x0B4</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>P0</name>
              <description>Set the I/O line 0 in Secure mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P1</name>
              <description>Set the I/O line 1 in Secure mode.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P2</name>
              <description>Set the I/O line 2 in Secure mode.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P3</name>
              <description>Set the I/O line 3 in Secure mode.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P4</name>
              <description>Set the I/O line 4 in Secure mode.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P5</name>
              <description>Set the I/O line 5 in Secure mode.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P6</name>
              <description>Set the I/O line 6 in Secure mode.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P7</name>
              <description>Set the I/O line 7 in Secure mode.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P8</name>
              <description>Set the I/O line 8 in Secure mode.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P9</name>
              <description>Set the I/O line 9 in Secure mode.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P10</name>
              <description>Set the I/O line 10 in Secure mode.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P11</name>
              <description>Set the I/O line 11 in Secure mode.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P12</name>
              <description>Set the I/O line 12 in Secure mode.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P13</name>
              <description>Set the I/O line 13 in Secure mode.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P14</name>
              <description>Set the I/O line 14 in Secure mode.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P15</name>
              <description>Set the I/O line 15 in Secure mode.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P16</name>
              <description>Set the I/O line 16 in Secure mode.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P17</name>
              <description>Set the I/O line 17 in Secure mode.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P18</name>
              <description>Set the I/O line 18 in Secure mode.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P19</name>
              <description>Set the I/O line 19 in Secure mode.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P20</name>
              <description>Set the I/O line 20 in Secure mode.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P21</name>
              <description>Set the I/O line 21 in Secure mode.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P22</name>
              <description>Set the I/O line 22 in Secure mode.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P23</name>
              <description>Set the I/O line 23 in Secure mode.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P24</name>
              <description>Set the I/O line 24 in Secure mode.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P25</name>
              <description>Set the I/O line 25 in Secure mode.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P26</name>
              <description>Set the I/O line 26 in Secure mode.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P27</name>
              <description>Set the I/O line 27 in Secure mode.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P28</name>
              <description>Set the I/O line 28 in Secure mode.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P29</name>
              <description>Set the I/O line 29 in Secure mode.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P30</name>
              <description>Set the I/O line 30 in Secure mode.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P31</name>
              <description>Set the I/O line 31 in Secure mode.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PIO_SIOSR3</name>
          <description>PIO Set I/O Secure Register</description>
          <addressOffset>0x0F4</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>P0</name>
              <description>Set the I/O line 0 in Secure mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P1</name>
              <description>Set the I/O line 1 in Secure mode.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P2</name>
              <description>Set the I/O line 2 in Secure mode.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P3</name>
              <description>Set the I/O line 3 in Secure mode.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P4</name>
              <description>Set the I/O line 4 in Secure mode.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P5</name>
              <description>Set the I/O line 5 in Secure mode.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P6</name>
              <description>Set the I/O line 6 in Secure mode.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P7</name>
              <description>Set the I/O line 7 in Secure mode.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P8</name>
              <description>Set the I/O line 8 in Secure mode.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P9</name>
              <description>Set the I/O line 9 in Secure mode.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P10</name>
              <description>Set the I/O line 10 in Secure mode.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P11</name>
              <description>Set the I/O line 11 in Secure mode.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P12</name>
              <description>Set the I/O line 12 in Secure mode.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P13</name>
              <description>Set the I/O line 13 in Secure mode.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P14</name>
              <description>Set the I/O line 14 in Secure mode.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P15</name>
              <description>Set the I/O line 15 in Secure mode.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P16</name>
              <description>Set the I/O line 16 in Secure mode.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P17</name>
              <description>Set the I/O line 17 in Secure mode.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P18</name>
              <description>Set the I/O line 18 in Secure mode.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P19</name>
              <description>Set the I/O line 19 in Secure mode.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P20</name>
              <description>Set the I/O line 20 in Secure mode.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P21</name>
              <description>Set the I/O line 21 in Secure mode.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P22</name>
              <description>Set the I/O line 22 in Secure mode.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P23</name>
              <description>Set the I/O line 23 in Secure mode.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P24</name>
              <description>Set the I/O line 24 in Secure mode.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P25</name>
              <description>Set the I/O line 25 in Secure mode.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P26</name>
              <description>Set the I/O line 26 in Secure mode.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P27</name>
              <description>Set the I/O line 27 in Secure mode.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P28</name>
              <description>Set the I/O line 28 in Secure mode.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P29</name>
              <description>Set the I/O line 29 in Secure mode.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P30</name>
              <description>Set the I/O line 30 in Secure mode.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P31</name>
              <description>Set the I/O line 31 in Secure mode.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
